[
  {
    "start": 0,
    "end": 1,
    "speaker": "Marc Raibert",
    "timestamp": "(00:00:00)",
    "text": "BigDog became LS3, which is the big load carrying one."
  },
  {
    "start": 2,
    "end": 3,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:04)",
    "text": "Just a quick pause. It can carry 400 pounds."
  },
  {
    "start": 4,
    "end": 5,
    "speaker": "Marc Raibert",
    "timestamp": "(00:00:08)",
    "text": "It was designed to carry 400, but we had it carrying about 1,000 pounds at one time."
  },
  {
    "start": 6,
    "end": 7,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:12)",
    "text": "Of course you did. Just to make sure."
  },
  {
    "start": 8,
    "end": 9,
    "speaker": "Marc Raibert",
    "timestamp": "(00:00:15)",
    "text": "We had one carrying the other one. We had two of them, so we had one carrying the other one."
  },
  {
    "start": 10,
    "end": 11,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:19)",
    "text": "So one of the things that stands out about the robots Boston Dynamics have created is how beautiful the movement is, how natural the walking is and running is, even flipping, it’s throwing is, so maybe you can talk about what’s involved in making it look natural."
  },
  {
    "start": 12,
    "end": 13,
    "speaker": "Marc Raibert",
    "timestamp": "(00:00:37)",
    "text": "Well, I think having good hardware is part of the story, and people who think you don’t need to innovate hardware anymore are wrong."
  },
  {
    "start": 14,
    "end": 15,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:49)",
    "text": "The following is a conversation with Marc Raibert, a legendary roboticist, founder and longtime CEO of Boston Dynamics, and recently the Executive Director of the newly created Boston Dynamics AI Institute, that focuses on research and the cutting edge, on creating future generations of robots that are far better than anything that exists today. He has been leading the creation of incredible legged robots for over 40 years at CMU, at MIT, the legendary MIT Leg Lab, and then of course, Boston Dynamics with amazing robots like BigDog, Atlas, Spot, and Handle. This was a big honor and pleasure for me."
  },
  {
    "start": 16,
    "end": 17,
    "speaker": "",
    "timestamp": "(00:01:35)",
    "text": "This is the Lex Friedman Podcast. To support it, please check out our sponsors in the description. And now, dear friends, here’s Marc Raibert. When did you first fall in love with robotics?"
  },
  {
    "start": 18,
    "end": 19,
    "speaker": "Marc Raibert",
    "timestamp": "(00:01:47)",
    "text": "Well, I was always a builder from a young age. I was lucky. My father was a frustrated engineer, and by that, I mean he wanted to be an aerospace engineer, but his mom from the old country thought that that would be like a grease monkey, and so she said no. So he became an accountant."
  },
  {
    "start": 20,
    "end": 21,
    "speaker": "",
    "timestamp": "(00:02:10)",
    "text": "But the result of that was our basement was always full of tools and equipment and electronics, and from a young age, I would watch him assembling an ICO kit or something like that. I still have a couple of his old ICO kits."
  },
  {
    "start": 22,
    "end": 23,
    "speaker": "",
    "timestamp": "(00:02:27)",
    "text": "But it was really during graduate school when I followed a professor back from class. It was Berthold Horn at MIT, and I was taking an interim class. It’s IAP, Independent Activities Period. And I followed him back to his lab, and on the table was a [inaudible 00:02:50] robot arm taken apart in probably a thousand pieces. And when I saw that, from that day on, I was a roboticist."
  },
  {
    "start": 24,
    "end": 25,
    "speaker": "Lex Fridman",
    "timestamp": "(00:02:58)",
    "text": "Do you remember the year?"
  },
  {
    "start": 26,
    "end": 27,
    "speaker": "Marc Raibert",
    "timestamp": "(00:02:59)",
    "text": "1974."
  },
  {
    "start": 28,
    "end": 29,
    "speaker": "Lex Fridman",
    "timestamp": "(00:03:02)",
    "text": "1974. So there’s just this arm in pieces."
  },
  {
    "start": 30,
    "end": 31,
    "speaker": "Marc Raibert",
    "timestamp": "(00:03:04)",
    "text": "Yeah."
  },
  {
    "start": 32,
    "end": 33,
    "speaker": "Lex Fridman",
    "timestamp": "(00:03:04)",
    "text": "And you saw the pieces and you saw in your vision the arm when it’s put back together and the possibilities that holds."
  },
  {
    "start": 34,
    "end": 35,
    "speaker": "Marc Raibert",
    "timestamp": "(00:03:12)",
    "text": "Somehow it spurred my imagination. I was in the branding cognitive sciences department as a graduate student doing neurophysiology. I’d been an electrical engineer as an undergrad at Northeastern. And the neurophysiology wasn’t really working for me. It wasn’t conceptual enough. I couldn’t see really how by looking at single neurons, you were going to get to a place where you could understand control systems or thought or anything like that. And the AI lab was always an appealing. This was before, [inaudible 00:03:47]. This was in the ’70s. So the AI lab was always an appealing idea. And so when I went back to the AI lab following him and I saw the arm, I just thought, “This is it.”"
  },
  {
    "start": 36,
    "end": 37,
    "speaker": "Lex Fridman",
    "timestamp": "(00:03:58)",
    "text": "It’s so interesting, the tension between the BCS, brain cognitive science approach to understanding intelligence, and the robotics approach to understanding intelligence."
  },
  {
    "start": 38,
    "end": 39,
    "speaker": "Marc Raibert",
    "timestamp": "(00:04:09)",
    "text": "Well, BCS is now morphed. They have the Center for Brains, minds and Machines, which is trying to bridge that gap. And even when I was there, David Maher was in the AI lab. David Maher had models of the brain that were appealing both to biologists but also to computer people. So he was a visitor in the AI lab at the time, and I guess he became full-time there."
  },
  {
    "start": 40,
    "end": 41,
    "speaker": "",
    "timestamp": "(00:04:34)",
    "text": "So that was the first time a bridge was made between those two groups then the bridge kind of went away, and then there was another time in the ’80s. And then recently the last five or so years, there’s been a stronger connection."
  },
  {
    "start": 42,
    "end": 43,
    "speaker": "Lex Fridman",
    "timestamp": "(00:04:48)",
    "text": "You said you were always kind of a builder. What stands out to you in memory of a thing you’ve built, maybe a trivial thing that just kind of inspired you in the possibilities that this direction of work might hold?"
  },
  {
    "start": 44,
    "end": 45,
    "speaker": "Marc Raibert",
    "timestamp": "(00:05:02)",
    "text": "We were just doing gadgets when we were kids. I have a friend, we were taking the… I don’t know if everybody remembers, but fluorescent lights had this little aluminum cylinder, I can’t even remember what it’s called now that you needed a starter, I think it was. And we would take those apart, fill them with match heads, put a tail on it and make it into little rockets."
  },
  {
    "start": 46,
    "end": 47,
    "speaker": "Lex Fridman",
    "timestamp": "(00:05:27)",
    "text": "So it wasn’t always about function, it was, well…"
  },
  {
    "start": 48,
    "end": 49,
    "speaker": "Marc Raibert",
    "timestamp": "(00:05:30)",
    "text": "Rocket was pretty [inaudible 00:05:32]."
  },
  {
    "start": 50,
    "end": 51,
    "speaker": "Lex Fridman",
    "timestamp": "(00:05:32)",
    "text": "I guess that is pretty functional. But yeah, I guess that is a question. How much was it about function versus just creating something cool?"
  },
  {
    "start": 52,
    "end": 53,
    "speaker": "Marc Raibert",
    "timestamp": "(00:05:39)",
    "text": "I think it’s still a balance between those two. There was a time though, I guess I was probably already a professor or maybe late in graduate school, when I thought that function was everything and that mobility, dexterity, perception and intelligence, those are the key functionalities for robotics, that that’s what mattered. And nothing else mattered."
  },
  {
    "start": 54,
    "end": 55,
    "speaker": "",
    "timestamp": "(00:06:04)",
    "text": "And I even had kind of this platonic ideal that a robot, if you just looked at a robot and it wasn’t doing anything, it would look like a pile of junk, which a lot of my robots looked like in those days. But then when it started moving, you’d get the idea that it had some kind of life or some kind of interest in its movement, and I think we purposely even designed the machines not worrying about the aesthetics of the structure itself. But then it turns out that the aesthetics of the thing itself add and combine with the lifelike things that the robots can do. But the heart of it is making them do things that are interesting."
  },
  {
    "start": 56,
    "end": 57,
    "speaker": "Lex Fridman",
    "timestamp": "(00:06:47)",
    "text": "One of the things that underlies a lot of your work is that the robots you create, the systems you have created for over 40 years now have a kind of, they’re not cautious. So a lot of robots that people know about move about this world very cautiously, carefully, very afraid of the world. A lot of the robots you built, especially in the early days, were very aggressive under actuated. They’re hopping, they’re wild, moving quickly. So is there a philosophy under underlying that?"
  },
  {
    "start": 58,
    "end": 59,
    "speaker": "Marc Raibert",
    "timestamp": "(00:07:20)",
    "text": "Well, let me tell you about how I got started on legs at all. When I was still a graduate student, I went to a conference. It was a biological legged locomotion conference, I think it was in Philadelphia. So it was all biomechanics people, researchers who would look at muscle and maybe neurons and things like that. They weren’t so much computational people, but they were more biomechanics and maybe there were a thousand people there."
  },
  {
    "start": 60,
    "end": 61,
    "speaker": "",
    "timestamp": "(00:07:45)",
    "text": "And I went to a talk. All the talks were about the body of either animals or people and respiration, things like that. But one talk was by a robotics guy, and he showed a six legged robot that walked very slowly. It always had at least three feet on the ground, so it worked like a table or a chair with tripod stability, and it moved really slowly."
  },
  {
    "start": 62,
    "end": 63,
    "speaker": "",
    "timestamp": "(00:08:12)",
    "text": "And I just looked at that and said, wow, that’s wrong. That’s not anything like how people and animals work because we bounce and fly. We have to predict what’s going to happen in order to keep our balance when we’re taking a running step or something like that. We use the springiness in our legs, our muscles and our tendons and things like that as part of the story. The energy circulates. We don’t just throw it away every time."
  },
  {
    "start": 64,
    "end": 65,
    "speaker": "",
    "timestamp": "(00:08:40)",
    "text": "I’m not sure I understood all that when I first thought, but I definitely got inspired to say, “Let’s try the opposite.” And I didn’t have a clue as to how to make a hopping robot work, not balance in 3D. In fact, when I started, it was all just about the energy of bouncing, and I was going to have a springy thing in the leg and some actuator so that you could get an energy regime going of bouncing."
  },
  {
    "start": 66,
    "end": 67,
    "speaker": "",
    "timestamp": "(00:09:08)",
    "text": "And the idea that balance was an important part of it didn’t come until a little later. And then I made the pogo stick robots. Now I think that we need to do that in manipulation. If you look at robot manipulation, a community has been working on it for 50 years. We’re nowhere near human levels of manipulation. It’s come along, but I think it’s all too safe."
  },
  {
    "start": 68,
    "end": 69,
    "speaker": "",
    "timestamp": "(00:09:35)",
    "text": "And I think trying to break out of that safety thing of static grasping. If you look at a lot of work that goes on, it’s about the geometry of the part, and then you figure out how to move your hand so that you can position it with respect to that, and then you grasp it carefully and then you move it. Well, that’s not anything like how people and animals work. We juggle in our hands, we hug multiple objects and can sort them. So."
  },
  {
    "start": 70,
    "end": 71,
    "speaker": "",
    "timestamp": "(00:10:03)",
    "text": "Now to be fair, being more aggressive is going to mean things aren’t going to work very well for a while, so it’s a longer term approach to the problem, and that’s just theory now. Maybe that won’t pay off, but that’s how I’m trying to think about it, trying to encourage our group to go at it."
  },
  {
    "start": 72,
    "end": 73,
    "speaker": "Lex Fridman",
    "timestamp": "(00:10:22)",
    "text": "Well, we’ll talk about what it means to what is the actual thing we’re trying to optimize for a robot, sometimes, especially with human robot interaction, maybe flaws is a good thing. Perfection is not necessarily the right thing to be chasing. Just like you said, maybe being good at fumbling an object, being good at fumbling might be the right thing to optimize versus perfect modeling of the object and perfect movement of the arm to grasp that object as maybe perfection is not supposed to exist in the real world."
  },
  {
    "start": 74,
    "end": 75,
    "speaker": "Marc Raibert",
    "timestamp": "(00:10:57)",
    "text": "I don’t know if you know my friend Matt Mason, who is the director of the Robotics Institute at Carnegie Mellon, and we go back to graduate school together, but he analyzed a movie of Julia Child’s doing a cooking thing, and she did, I think he said something like there were 40 different ways that she handled a thing and none of them was grasping. She would nudge, roll, flatten with her knife, things like that. And none of them was grasping."
  },
  {
    "start": 76,
    "end": 77,
    "speaker": "Lex Fridman",
    "timestamp": "(00:11:28)",
    "text": "So okay, let’s go back to the early days. First of all, you’ve created and led the Leg Lab, the legendary Leg Lab at MIT. So what was that first hopping robot?"
  },
  {
    "start": 78,
    "end": 79,
    "speaker": "Marc Raibert",
    "timestamp": "(00:11:38)",
    "text": "But first of all, the Leg Lab actually started at Carnegie Mellon."
  },
  {
    "start": 80,
    "end": 81,
    "speaker": "Lex Fridman",
    "timestamp": "(00:11:41)",
    "text": "Carnegie Mellon."
  },
  {
    "start": 82,
    "end": 83,
    "speaker": "Marc Raibert",
    "timestamp": "(00:11:42)",
    "text": "So I was a professor there starting in 1980, about 1986, so that’s where the first topping machines were built. I guess we got the first one working in about 1982, something like that. That was a simplified one. Then we got a three-dimensional one in 1983, the quadruped that we built at the Leg Lab, the first version was built in about 1984 or five, and really only got going about ’86 or so, and took years of development to get it to…"
  },
  {
    "start": 84,
    "end": 85,
    "speaker": "Lex Fridman",
    "timestamp": "(00:12:17)",
    "text": "Let’s just pause here. For people who don’t know, I’m talking to Mark Weber, founder of Boston Dynamics. But before that, you were a professor developing some of the most incredible robots for 15 years. And before that, of course, a grad student and all that. So you’ve been doing this for a really long time. You skipped over this, but go to the first hopping robot. There’s videos of some of this."
  },
  {
    "start": 86,
    "end": 87,
    "speaker": "",
    "timestamp": "(00:12:38)",
    "text": "These are incredible robots. You talked about the very first step was to get a thing hopping up and down, and then you realized, well, balancing is a thing you should care about, and it’s actually a solvable problem. Can you just go through how to create that robot? What was involved in creating that robot?"
  },
  {
    "start": 88,
    "end": 89,
    "speaker": "Marc Raibert",
    "timestamp": "(00:13:00)",
    "text": "Well, I’m going to start on not the technical side, but I guess we could call it the motivational side or the funding side. So before Carnegie Mellon, I was actually at JPL at the Jet Propulsion Lab for three years. And while I was there, I connected up with Ivan Sutherland, who is sometimes regarded as the father of computer graphics because of work he did both at MIT and then University of Utah and Evanston Sutherland."
  },
  {
    "start": 90,
    "end": 91,
    "speaker": "",
    "timestamp": "(00:13:28)",
    "text": "Anyway, I got to know him and at one point he said he encouraged me to do some kind of project at Caltech, even though I was at JPL. Those are kind of related institutions. And so I thought about it and I made up a list of three possible projects, and I purposely made the top one and the bottom one really boring sounding. And in the middle I put Pogo stick robot. And when he looked at it, Ivan is a brilliant guy, brilliant engineer, and a real cultivator of people. He looked at it and knew right away what thing that was worth doing. And so he had an endowed chair, so he had about $3,000 that he gave me to build the first model, which I went I to the shop and with my own hands kind of made a first model, which didn’t work and was just a beginning shot at it."
  },
  {
    "start": 92,
    "end": 93,
    "speaker": "",
    "timestamp": "(00:14:32)",
    "text": "Ivan and I took that to Washington. And in those days you could just walk into DARPA and walk down the hallway and see who’s there, and Ivan, who had been there in his previous life. And so we walked around and we looked in the offices. Of course, I didn’t know anything. I was basically a kid, but Ivan knew his way around, and we found Craig Fields in his office."
  },
  {
    "start": 94,
    "end": 95,
    "speaker": "",
    "timestamp": "(00:14:54)",
    "text": "Craig later became the director of DARPA, but in those days, he was a program manager. And so we went in, I had a little Samsonite suitcase, which we opened, and it had just the skeleton of this one-legged hopping robot. And we showed it to him, and you could almost see the drool going down his chin of excitement. And he sent me $250,000. He said, “Okay, I want to fund this.”"
  },
  {
    "start": 96,
    "end": 97,
    "speaker": "",
    "timestamp": "(00:15:19)",
    "text": "And I was between institutions, I was just about to leave JPL, and I hadn’t decided yet where I was going next, and then when I landed at CMU, he sent $250,000, which in 1980 was a lot of research money."
  },
  {
    "start": 98,
    "end": 99,
    "speaker": "Lex Fridman",
    "timestamp": "(00:15:34)",
    "text": "Did you see the possibility of where this is going, why this is an important problem?"
  },
  {
    "start": 100,
    "end": 101,
    "speaker": "Marc Raibert",
    "timestamp": "(00:15:39)",
    "text": "No."
  },
  {
    "start": 102,
    "end": 103,
    "speaker": "Lex Fridman",
    "timestamp": "(00:15:41)",
    "text": "It has to do with leg locomotion. I mean, it has to do with all these problems that the human body solves when we’re walking, for example. All the fundamentals are there."
  },
  {
    "start": 104,
    "end": 105,
    "speaker": "Marc Raibert",
    "timestamp": "(00:15:51)",
    "text": "Yeah, I think that was the motivation to try and get more at the fundamentals of how animals work, but the idea that it would result in machines that were anything practical like we’re making now, that wasn’t anywhere in my head. As an academic, I was mostly just trying to do the next thing, make some progress, impress my colleagues if I could."
  },
  {
    "start": 106,
    "end": 107,
    "speaker": "Lex Fridman",
    "timestamp": "(00:16:14)",
    "text": "And have fun."
  },
  {
    "start": 108,
    "end": 109,
    "speaker": "Marc Raibert",
    "timestamp": "(00:16:15)",
    "text": "And have fun."
  },
  {
    "start": 110,
    "end": 111,
    "speaker": "Lex Fridman",
    "timestamp": "(00:16:16)",
    "text": "Pogo stick robot."
  },
  {
    "start": 112,
    "end": 113,
    "speaker": "Marc Raibert",
    "timestamp": "(00:16:17)",
    "text": "Pogo stick robot."
  },
  {
    "start": 114,
    "end": 115,
    "speaker": "Lex Fridman",
    "timestamp": "(00:16:18)",
    "text": "So what was on the technical side? What are some of the challenges of getting to the point where we saw in the video the pogo stick robot that’s actually successfully hopping and then eventually doing flips and all this kind of stuff?"
  },
  {
    "start": 116,
    "end": 117,
    "speaker": "Marc Raibert",
    "timestamp": "(00:16:31)",
    "text": "Well, in the very early days, I needed some better engineering than I could do myself, and I hired Ben Brown. We each had our way of contributing to the design, and we came up with a thing that could start to work. I had some stupid ideas about how the actuation system should work, and we sorted that out."
  },
  {
    "start": 118,
    "end": 119,
    "speaker": "",
    "timestamp": "(00:16:52)",
    "text": "It wasn’t that hard to make it balanced once you get the physical machine to be working well enough and have enough control over the degrees of freedom. We started out by having it floating on an inclined air table, and then that only gave us like six foot of travel, so once it started working, we switched to a thing that could run around the room on another device. It’s hard to explain these without you seeing them, but you probably know what I’m talking about, a planarize."
  },
  {
    "start": 120,
    "end": 121,
    "speaker": "",
    "timestamp": "(00:17:23)",
    "text": "And then the next big step was to make it work in 3D, which that was really the scary part with these simple things. People had inverted pendulums at the time for years, and they could control them by driving a cart back and forth, but could you make it work in three dimensions while it’s bouncing and all that? But it turned out not to be that hard to do, at least at the level of performance we achieved at the time."
  },
  {
    "start": 122,
    "end": 123,
    "speaker": "Lex Fridman",
    "timestamp": "(00:17:46)",
    "text": "Okay. You mentioned inverted pendulum, but can you explain how a hopping stick in 3D can balance itself?"
  },
  {
    "start": 124,
    "end": 125,
    "speaker": "Marc Raibert",
    "timestamp": "(00:17:57)",
    "text": "Yeah, sure."
  },
  {
    "start": 126,
    "end": 127,
    "speaker": "Lex Fridman",
    "timestamp": "(00:17:58)",
    "text": "What does the actuation look like?"
  },
  {
    "start": 128,
    "end": 129,
    "speaker": "Marc Raibert",
    "timestamp": "(00:18:01)",
    "text": "The simple story is that there’s three things going on. There’s something making it bounce. And we had a system that was estimating how high the robot was off the ground and using that. There’s energy that can be in three places in a pogo stick: one is in the spring, one is in the altitude, and the other is in the velocity. And so when at the top of the hop, it’s all in the height, so you could just measure how high you’re going, and thereby have an idea of a lot about the cycle, and you could decide whether to put more energy in or less. That’s one element."
  },
  {
    "start": 130,
    "end": 131,
    "speaker": "",
    "timestamp": "(00:18:40)",
    "text": "Then there’s a part that you decide where to put the foot. And if you think when you’re landing on the ground with respect to the center of mass. So if you think of a pole vaulter, the key thing the pole vaulter has to do is get its body to the right place when the pole gets stuck. If they’re too far forward, they kind of get thrown backwards. If they’re too far back, they go over. And what they need to do is get it so that they go mostly up to get over the thing. And high jumpers is the same kind of thing. So there’s a calculation about where to put the foot, and we did something relatively simple."
  },
  {
    "start": 132,
    "end": 133,
    "speaker": "",
    "timestamp": "(00:19:16)",
    "text": "And then there’s a third part to keep the body at an attitude that’s upright, because if it gets too far, you could hop and just keep rotating around. But if it gets too far, then you run out of motion of the joints at the hips. So you have to do that. And we did that by applying a torque between the legs and the body. Every time the foot’s on the ground. You only can do it while the foot’s on the ground in the air. The physics don’t work out."
  },
  {
    "start": 134,
    "end": 135,
    "speaker": "Lex Fridman",
    "timestamp": "(00:19:42)",
    "text": "How far does it have to tilt before it’s too late to be able to balance itself or it’s impossible to balance itself, correct itself?"
  },
  {
    "start": 136,
    "end": 137,
    "speaker": "Marc Raibert",
    "timestamp": "(00:19:50)",
    "text": "Well, you’re asking an interesting question because in those days, we didn’t actually optimize things and they probably could have gone much further than we did and then had higher performance, and we just kind of got a sketch of a solution and worked on that. And then in years since, some people working for us, some people working for others, people came up with all kinds of equations or algorithms for how to do a better job, be able to go faster."
  },
  {
    "start": 138,
    "end": 139,
    "speaker": "",
    "timestamp": "(00:20:19)",
    "text": "One of my students worked on getting things to go faster. Another one worked on climbing over obstacles. Because when you’re running on the open ground, it’s one thing; if you’re running up a stair, you have to adjust where you are, otherwise things don’t work out. You land your foot on the edge of the steps. There’s other degrees of freedom to control if you’re getting to more realistic, practical situations."
  },
  {
    "start": 140,
    "end": 141,
    "speaker": "Lex Fridman",
    "timestamp": "(00:20:44)",
    "text": "I think it’s really interesting to ask about the early days because believing in yourself, believing that there’s something interesting here. And then you mentioned finding somebody else, Ben Brown. What’s that like, finding other people with whom you can build this crazy idea and actually make it work?"
  },
  {
    "start": 142,
    "end": 143,
    "speaker": "Marc Raibert",
    "timestamp": "(00:21:00)",
    "text": "Probably the smartest thing I ever did is to find the other people. When I look at it now, I look at Boston Dynamics and all the really excellent engineering there, people who really make stuff work, I’m only the dreamer."
  },
  {
    "start": 144,
    "end": 145,
    "speaker": "Lex Fridman",
    "timestamp": "(00:21:16)",
    "text": "So when you talk about pogo stick robot or legged robots, whether it’s quadrupeds or humanoid robots, did people doubt that this is possible? Did you experience a lot of people around you kind of…"
  },
  {
    "start": 146,
    "end": 147,
    "speaker": "Marc Raibert",
    "timestamp": "(00:21:29)",
    "text": "I don’t know if they doubted whether it was possible, but I think they thought it was a waste of time."
  },
  {
    "start": 148,
    "end": 149,
    "speaker": "Lex Fridman",
    "timestamp": "(00:21:34)",
    "text": "Oh, it’s not even an interesting problem."
  },
  {
    "start": 150,
    "end": 151,
    "speaker": "Marc Raibert",
    "timestamp": "(00:21:36)",
    "text": "I think for a lot of people. I think it’s been both, though. Some people, I felt like they were saying, “Oh, why are you wasting your time on this stupid problem?” But then I’ve been at many things where people have told me it’s been an inspiration to go out and attack these harder things. And I think legged locomotion has turned out to be a useful thing."
  },
  {
    "start": 152,
    "end": 153,
    "speaker": "Lex Fridman",
    "timestamp": "(00:22:06)",
    "text": "Did you ever have doubt about bringing Atlas to life, for example, or with Big Dog just every step of the way? Did you have doubt? This is too hard of a problem."
  },
  {
    "start": 154,
    "end": 155,
    "speaker": "Marc Raibert",
    "timestamp": "(00:22:19)",
    "text": "At first, I wasn’t an enthusiast for the humanoids. Again, it goes back to saying “what’s the functionality?” And the form wasn’t as important as the functionality. And also, there’s an aspect to humanoid robots that’s about about the cosmetics, where there isn’t really other functionality, and that kind of is off putting for me. As a roboticist, I think the functionality really matters. So probably that’s why I avoided the humanoid robots to start with."
  },
  {
    "start": 156,
    "end": 157,
    "speaker": "",
    "timestamp": "(00:22:51)",
    "text": "But I’ll tell you, after we started working on them, you could see that the connection and the impact with other people, whether they’re laypeople or even other technical people, there’s a special thing that goes on, even though most of the humanoid robots aren’t that much like a person."
  },
  {
    "start": 158,
    "end": 159,
    "speaker": "Lex Fridman",
    "timestamp": "(00:23:11)",
    "text": "But we anthropomorphize and we see the humanity. But also with Spot, you can see not the humanity, but whatever we find compelling about social interactions there in Spot, as well."
  },
  {
    "start": 160,
    "end": 161,
    "speaker": "Marc Raibert",
    "timestamp": "(00:23:24)",
    "text": "Well. I’ll tell you, I go around giving talks and take Spot to a lot of them, and it’s amazing. The media likes to say that they’re terrifying and that people are afraid, and YouTube commenters like to say that it’s frightening. But when you take a Spot out there, maybe it’s self-selecting, but you get a crowd of people who want to take pictures, want to pose for selfies, want to operate the robot, want to pet it, want to put clothes on it. It’s amazing."
  },
  {
    "start": 162,
    "end": 163,
    "speaker": "Lex Fridman",
    "timestamp": "(00:23:52)",
    "text": "Yeah, I love Spot. So if we move around history a little bit, so you said, I think, in the early days of Boston Dynamics that you quietly worked on making a running version of Aibo, Sony’s robot dog."
  },
  {
    "start": 164,
    "end": 165,
    "speaker": "Marc Raibert",
    "timestamp": "(00:24:05)",
    "text": "Yeah."
  },
  {
    "start": 166,
    "end": 167,
    "speaker": "Lex Fridman",
    "timestamp": "(00:24:06)",
    "text": "It’s just an interesting little tidbit of history for me. What stands out to your memory from that task? For people who don’t know, that little dog robot moves slowly. How did that become Big Dog? What was involved there? What was the dance between how do we make this cute little dog versus a thing that can actually carry a lot of payload and move fast and stuff like that?"
  },
  {
    "start": 168,
    "end": 169,
    "speaker": "Marc Raibert",
    "timestamp": "(00:24:29)",
    "text": "What the connection was is that at that point, Boston Dynamics was mostly a physics-based simulation company. So when I left MIT to start Boston Dynamics, there was a few years of overlap, but the concept wasn’t to start a robot company. The concept was to use this dynamic simulation tool that we developed to do robotics for other things. But working with Sony, we got back into robotics by doing the IBO Runner, we made some tools for programming Curio, which was a small humanoid this big that could do some dancing and other kinds of fun stuff. And I don’t think it ever reached the market, even though they did show it. When I look back, I say that we got us back where we belonged."
  },
  {
    "start": 170,
    "end": 171,
    "speaker": "Lex Fridman",
    "timestamp": "(00:25:14)",
    "text": "Yeah, you rediscovered the soul of the company."
  },
  {
    "start": 172,
    "end": 173,
    "speaker": "Marc Raibert",
    "timestamp": "(00:25:17)",
    "text": "That’s right."
  },
  {
    "start": 174,
    "end": 175,
    "speaker": "Lex Fridman",
    "timestamp": "(00:25:18)",
    "text": "And so from there, it was always about robots."
  },
  {
    "start": 176,
    "end": 177,
    "speaker": "Marc Raibert",
    "timestamp": "(00:25:21)",
    "text": "Yeah."
  },
  {
    "start": 178,
    "end": 179,
    "speaker": "Lex Fridman",
    "timestamp": "(00:25:23)",
    "text": "So you started Boston Dynamics in 1992."
  },
  {
    "start": 180,
    "end": 181,
    "speaker": "Marc Raibert",
    "timestamp": "(00:25:27)",
    "text": "Right."
  },
  {
    "start": 182,
    "end": 183,
    "speaker": "Lex Fridman",
    "timestamp": "(00:25:28)",
    "text": "What are some fond memories from the early days?"
  },
  {
    "start": 184,
    "end": 185,
    "speaker": "Marc Raibert",
    "timestamp": "(00:25:31)",
    "text": "One of the robots that we built wasn’t actually a robot, it was a surgical simulator, but it had force feedback, so it had all the techniques of robotics, and you look down into this mirror, it actually was, and it looked like you were looking down onto the body you were working on. Your hands were underneath the mirror where you were looking, and you had tools in your hands that were connected up to these force feedback devices made by another MIT spin out, Sensible Technologies."
  },
  {
    "start": 186,
    "end": 187,
    "speaker": "Marc Raibert",
    "timestamp": "(00:26:00)",
    "text": "Another MIT spin out sensible technologies. So they made the force feedback device, we attached the tools and we wrote all the software and did all the graphics. So we had 3D computer graphics. It was in the old days, this was in the late 90s when you had a Silicon Graphics computer that was about this big. It was the heater in the office basically."
  },
  {
    "start": 188,
    "end": 189,
    "speaker": "",
    "timestamp": "(00:26:24)",
    "text": "And we were doing surgical operations’ anastomosis, which was stitching tubes together. Tubes like blood vessels or other things in their body. And you could feel, you could see the tissues move. And it was really exciting. And the idea was to make a trainer to teach surgeons how to do stuff. We built a scoring system because we’d interviewed surgeons that told us what you’re supposed to do and what you’re not supposed to do."
  },
  {
    "start": 190,
    "end": 191,
    "speaker": "",
    "timestamp": "(00:26:50)",
    "text": "You’re not supposed to tear the tissue, you’re not supposed to touch it in any place except for where you’re trying to engage. There were a bunch of rules. So we built this thing and took it to a trade show, a surgical trade show, and the surgeons were practically lined up. Well, we kept a score and we posted their scores on a video game. And those guys are so competitive that they really, really loved doing it."
  },
  {
    "start": 192,
    "end": 193,
    "speaker": "",
    "timestamp": "(00:27:13)",
    "text": "And they would come around and they see someone’s score was higher there, so they would come back. But we figured out shortly after, that we thought surgeons were going to pay us to get trained on these things and the surgeons thought we should pay them so they could teach us about the thing. And there was no money from the surgeons. And we looked at it and thought, well, maybe we could sell it to hospitals that would train their surgeons."
  },
  {
    "start": 194,
    "end": 195,
    "speaker": "",
    "timestamp": "(00:27:39)",
    "text": "And then we said, at the time we were probably a 12 person company or maybe 15 people, I don’t remember, there’s no way we could go after a marketing activity. The company was all bootstrapped in those years. We never had investors until Google bought us, which was after 20 years. So we didn’t have any resources to go after hospitals. So one day, Rob and I were looking at that and we’d built another simulator for knee arthroscopy and we said, “This isn’t going to work.” And we killed it. And we moved on. And that was really a milestone in the company because we sort of understood who we were and what would work and what wouldn’t. Even though technically it was really a fascinating thing."
  },
  {
    "start": 196,
    "end": 197,
    "speaker": "Lex Fridman",
    "timestamp": "(00:28:24)",
    "text": "What was that meeting like, where you’re just sitting at a table, “You know what? We’re going to pivot completely. We’re going to let go of this thing we put so much hard work into and then go back to the thing it came from.”"
  },
  {
    "start": 198,
    "end": 199,
    "speaker": "Marc Raibert",
    "timestamp": "(00:28:39)",
    "text": "It just always felt right once we did it."
  },
  {
    "start": 200,
    "end": 201,
    "speaker": "Lex Fridman",
    "timestamp": "(00:28:42)",
    "text": "Just looked at each other and said, “Let’s build robots.”"
  },
  {
    "start": 202,
    "end": 203,
    "speaker": "Marc Raibert",
    "timestamp": "(00:28:44)",
    "text": "Yeah. What was the first robot you built under the flag of Boston Dynamics? BigDog?"
  },
  {
    "start": 204,
    "end": 205,
    "speaker": "Marc Raibert",
    "timestamp": "(00:28:51)",
    "text": "Well, there was the Aibo runner, but it wasn’t even a whole robot. We took off the legs on Aibos and attached legs we’ve made. And we got that working and showed it to the Sony people. We worked pretty closely with Sony in those years. One of the interesting things is that it was before the internet and Zoom and anything like that."
  },
  {
    "start": 206,
    "end": 207,
    "speaker": "",
    "timestamp": "(00:29:15)",
    "text": "So we had six ISDN lines installed and we would have a telecon every week that worked at very low frame rates, something like 10 hertz. English across the boundary with Japan was a challenge trying to understand what each of us was saying and have meetings every week for several years doing that."
  },
  {
    "start": 208,
    "end": 209,
    "speaker": "",
    "timestamp": "(00:29:39)",
    "text": "And it was a pleasure working with them. They were really supporters. They seemed to like us and what we were doing. That was the real transition from us being a simulation company into being a robotics company again."
  },
  {
    "start": 210,
    "end": 211,
    "speaker": "Lex Fridman",
    "timestamp": "(00:29:51)",
    "text": "It was a quadruplet. The legs were four legs digital legs?"
  },
  {
    "start": 212,
    "end": 213,
    "speaker": "Marc Raibert",
    "timestamp": "(00:29:55)",
    "text": "Yeah, no, four legs."
  },
  {
    "start": 214,
    "end": 215,
    "speaker": "Lex Fridman",
    "timestamp": "(00:29:56)",
    "text": "And what did you learn from that experience of building basically a fast moving quadruplet?"
  },
  {
    "start": 216,
    "end": 217,
    "speaker": "Marc Raibert",
    "timestamp": "(00:30:03)",
    "text": "Mostly we learned that something that small doesn’t look very exciting when it’s running. It’s like it’s scampering and you had to watch a slow mo for it to look like it was interesting. If you watch it fast, it was just like a-"
  },
  {
    "start": 218,
    "end": 219,
    "speaker": "Lex Fridman",
    "timestamp": "(00:30:17)",
    "text": "That’s funny."
  },
  {
    "start": 220,
    "end": 221,
    "speaker": "Marc Raibert",
    "timestamp": "(00:30:18)",
    "text": "One of my things was to show stuff in video from the very early days of the hopping machines. And so I was always focused on how’s this going to look through the Viewfinder and running Aibo didn’t look so cool through the Viewfinder."
  },
  {
    "start": 222,
    "end": 223,
    "speaker": "Lex Fridman",
    "timestamp": "(00:30:32)",
    "text": "So what came next? What was a big next milestone in terms of a robot you built?"
  },
  {
    "start": 224,
    "end": 225,
    "speaker": "Marc Raibert",
    "timestamp": "(00:30:40)",
    "text": "I mean, you got to say that BigDog sort of put us on the map and got our heads really pulled together. We scaled up the company. BigDog was the result of Alan Rudolph at DARPA starting a biodynamics program. And he put out a request for proposals and I think there were 42 proposals written and three got funded."
  },
  {
    "start": 226,
    "end": 227,
    "speaker": "",
    "timestamp": "(00:31:06)",
    "text": "One was BigDog, one was a climbing robot rise, and that put things in motion. We hired Martin Bueller, he was a professor in Montreal at McGill. He was incredibly important for getting BigDog out of the lab and into the mud, which was a key step to really be willing to go out there out and build it, break it, fix it, which is sort of one of our mottos at the company."
  },
  {
    "start": 228,
    "end": 229,
    "speaker": "Lex Fridman",
    "timestamp": "(00:31:32)",
    "text": "So testing it in the real world. For people who don’t know BigDog, maybe you can correct me, but it’s a big quadruplet four-legged robot. It looks big, could probably carry a lot of weight. Not the most weight that Boston Dynamics have built, but a lot."
  },
  {
    "start": 230,
    "end": 231,
    "speaker": "Marc Raibert",
    "timestamp": "(00:31:48)",
    "text": "Well, it’s the first thing that worked. So let’s see, if we go back to the leg lab, we built a quadruplet that could do many of the things that BigDog did, but it had a hydraulic pump sitting in the room with hoses connected to the robot. It had a VAX computer in the next room. It needed its own room because it was this giant thing with air conditioning and it had this very complicated bus connected to the robot."
  },
  {
    "start": 232,
    "end": 233,
    "speaker": "",
    "timestamp": "(00:32:12)",
    "text": "And the robot itself just had the actuators. It had gyroscopes for sensing and some other sensors, but all the power and computing was off board. BigDog had all that stuff integrated on the platform. It had a gasoline engine for power, which was a very complicated thing to undertake. It had to convert the rotation of the engine into hydraulic power, which is how we actuated it. So there was a lot of learning just on building the physical robot and the system integration for that. And then there was the controls of it."
  },
  {
    "start": 234,
    "end": 235,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:49)",
    "text": "So for BigDog, you brought it all together onto one platform so-"
  },
  {
    "start": 236,
    "end": 237,
    "speaker": "Marc Raibert",
    "timestamp": "(00:32:53)",
    "text": "You could take it out in the woods."
  },
  {
    "start": 238,
    "end": 239,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:55)",
    "text": "Yeah, and you did."
  },
  {
    "start": 240,
    "end": 241,
    "speaker": "Marc Raibert",
    "timestamp": "(00:32:56)",
    "text": "We did. We spent a lot of time down at the Marine Corps base in Quantico where there was a trail called the Guadalcanal Trail. And our milestone that DARPA had specified was that we could go on this one particular trail that involved a lot of challenge. And we spent a lot of time. Our team spent a lot of time down there hiking. Those were fun days."
  },
  {
    "start": 242,
    "end": 243,
    "speaker": "Lex Fridman",
    "timestamp": "(00:33:20)",
    "text": "Hiking with the robot. So what did you learn about what it takes to balance a robot like that on a trail, on a hiking trail in the woods? Basically, forget the woods. Just the real world. That’s the big leap into testing in the real world."
  },
  {
    "start": 244,
    "end": 245,
    "speaker": "Marc Raibert",
    "timestamp": "(00:33:36)",
    "text": "As challenging as the woods were, working inside of a home or in an office is really harder because when you’re in the woods, you can actually take any path up the hill. All you have to do is avoid the obstacles. There’s no such thing as damaging the woods, at least to first order. Whereas if you’re in a house, you can’t leave scuff marks, you can’t bang into the walls. The robots aren’t very comfortable bumping into the walls, especially in the early days."
  },
  {
    "start": 246,
    "end": 247,
    "speaker": "",
    "timestamp": "(00:34:05)",
    "text": "So I think those were actually bigger challenges. Once we faced them, it was mostly getting the systems to work well enough together, the hardware systems to work. And the controls. In those days, we did have a human operator who did all the visual perception going up the Guadalcanal Trail. So there was an operator who was right there who was very skilled even though the robot was balancing itself and placing its own feet, if the operator didn’t do the right thing, it wouldn’t go."
  },
  {
    "start": 248,
    "end": 249,
    "speaker": "",
    "timestamp": "(00:34:36)",
    "text": "But years later, we went back with one of the electric, the precursor to Spot, and we had advanced the controls and everything so much that a complete amateur could operate the robot the first time up and down and up and down. Whereas it taken us years to get there in the previous robot."
  },
  {
    "start": 250,
    "end": 251,
    "speaker": "Lex Fridman",
    "timestamp": "(00:34:55)",
    "text": "So if you fast-forward, BigDog eventually became Spot?"
  },
  {
    "start": 252,
    "end": 253,
    "speaker": "Marc Raibert",
    "timestamp": "(00:34:59)",
    "text": "So BigDog became LS3, which is the big load carrying one."
  },
  {
    "start": 254,
    "end": 255,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:03)",
    "text": "Just a quick pause, it can carry 400 pounds?"
  },
  {
    "start": 256,
    "end": 257,
    "speaker": "Marc Raibert",
    "timestamp": "(00:35:07)",
    "text": "It was designed to carry 400. But we had it carrying about a thousand pounds one time."
  },
  {
    "start": 258,
    "end": 259,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:12)",
    "text": "Of course you did. Just to make sure."
  },
  {
    "start": 260,
    "end": 261,
    "speaker": "Marc Raibert",
    "timestamp": "(00:35:14)",
    "text": "We had one carrying the other one. We had two of them, so we had one carrying the other one. There’s a little clip of that. We should put that out somewhere. That’s from 20 years ago."
  },
  {
    "start": 262,
    "end": 263,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:24)",
    "text": "Wow. And it can go for very long distances? You can travel the 20 miles."
  },
  {
    "start": 264,
    "end": 265,
    "speaker": "Marc Raibert",
    "timestamp": "(00:35:28)",
    "text": "Yeah. Gasoline."
  },
  {
    "start": 266,
    "end": 267,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:30)",
    "text": "Gasoline, yeah. And that event just… Okay, sorry. So LS3 then how did that lead to Spot?"
  },
  {
    "start": 268,
    "end": 269,
    "speaker": "Marc Raibert",
    "timestamp": "(00:35:38)",
    "text": "So BigDog and LS3 had engine power and hydraulic actuation. Then we made a robot that was electric power. So there’s a battery driving a motor, driving a pump, but still hydraulic actuation. Larry asked us, “Could you make something that weighed 60 pounds, that would not be so intimidating if you had it in a house where there were people.”"
  },
  {
    "start": 270,
    "end": 271,
    "speaker": "",
    "timestamp": "(00:36:07)",
    "text": "And that was the inspiration behind the spot pretty much as it exists today. We did a prototype the same size that was the first all electric, non-hydraulic robot."
  },
  {
    "start": 272,
    "end": 273,
    "speaker": "Lex Fridman",
    "timestamp": "(00:36:19)",
    "text": "What was the conversation with Larry Page about? Here’s a guy that is very product focused and can see a vision for what the future holds. That’s just interesting aside, what was the brainstorm about the future of robotics with him?"
  },
  {
    "start": 274,
    "end": 275,
    "speaker": "Marc Raibert",
    "timestamp": "(00:36:35)",
    "text": "I mean, it was almost as simple as what I just said. We were having meeting, he said, “Do you think you could make a smaller one that wouldn’t be so intimidating like a big dog if it was in your house?” And I said, “Yeah, we could do that.” And we started and did."
  },
  {
    "start": 276,
    "end": 277,
    "speaker": "Lex Fridman",
    "timestamp": "(00:36:52)",
    "text": "Is there a lot of technical challenges to go from hydraulic to electric?"
  },
  {
    "start": 278,
    "end": 279,
    "speaker": "Marc Raibert",
    "timestamp": "(00:36:57)",
    "text": "I had been in love with hydraulics and still love hydraulics. It’s a great technology. It’s too bad that somehow the world out there looks at it like it’s old-fashioned or that it’s icky. And it’s true that you do. It is very hard to keep it from having some amount of dripping from time to time. But if you look at the performance, how strong you can get in a lightweight package, and of course we did a huge amount of innovation."
  },
  {
    "start": 280,
    "end": 281,
    "speaker": "",
    "timestamp": "(00:37:26)",
    "text": "Most of hydraulic control, that is the valve that controls the flow of oil, had been designed in the 50s for airplanes. It had been made robust enough, safe enough that you could count on it so that humans could fly in airplanes and very little innovation had happened that might not be fair to the people who make the valves. I’m sure that they did innovate, but the basic had stayed the same and there was so much more you could do."
  },
  {
    "start": 282,
    "end": 283,
    "speaker": "",
    "timestamp": "(00:37:56)",
    "text": "And so our engineers designed valves, the ones that are in Atlas for instance, that had new kinds of circuits, they sort of did some of the computing that could get you much more efficient use. They were much smaller and lighter so the whole robot could be smaller and lighter. We made a hydraulic power supply that had a bunch of components integrated in this tiny package."
  },
  {
    "start": 284,
    "end": 285,
    "speaker": "",
    "timestamp": "(00:38:20)",
    "text": "It’s about this big, the size of a football weighs five kilograms and it produces five kilowatts of power. Of course it has to have a battery operating, but it’s got a motor, a pump filters, heat exchanger to keep it cool. Some valves all in this tiny little package. So hydraulics could still have a ways to go."
  },
  {
    "start": 286,
    "end": 287,
    "speaker": "Lex Fridman",
    "timestamp": "(00:38:44)",
    "text": "One of the things that stands out about the robots Boston Dynamics have created is how beautiful the movement is, how natural the walking is, and running is, even flipping is, throwing is. So maybe you can talk about what’s involved in making it look natural."
  },
  {
    "start": 288,
    "end": 289,
    "speaker": "Marc Raibert",
    "timestamp": "(00:39:02)",
    "text": "Well, I think having good hardware is part of the story and people who think you don’t need to innovate hardware anymore are wrong, in my opinion. So I think one of the things, certainly in the early years for me, taking a dynamic approach where you think about what’s the evolution of the motion of the thing going to be in the future and having a prediction of that that’s used at the time that you’re giving signals to it, as opposed to it all being sing, which is sing is sort of backward looking. It says, okay, where am I now? I’m going to try and adjust for that. But you really need to think about what’s coming."
  },
  {
    "start": 290,
    "end": 291,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:40)",
    "text": "So how far ahead you do, you have to look in time."
  },
  {
    "start": 292,
    "end": 293,
    "speaker": "Marc Raibert",
    "timestamp": "(00:39:44)",
    "text": "It’s interesting. I think that the number is only a couple of seconds for Spot. So there’s a limited horizon type approach where you’re recalculating assuming what’s going to happen in the next second or second and a half. And then you keep iterating at the next, even though a 10th of a second later you’ll say, okay, let’s do that again and see what’s happening."
  },
  {
    "start": 294,
    "end": 295,
    "speaker": "",
    "timestamp": "(00:40:06)",
    "text": "And you’re looking at what the obstacles are, where the feet are going to be placed. You have to coordinate a lot of things. If you have obstacles and you’re balancing at the same time and it’s that limited horizon type calculation that’s doing a lot of that. But if you’re doing something like a somersault, you’re looking out a lot further. If you want to stick the landing, you have to, at the time of launch, have momentum and rotation, all those things coordinated so that a landing is within reach."
  },
  {
    "start": 296,
    "end": 297,
    "speaker": "Lex Fridman",
    "timestamp": "(00:40:38)",
    "text": "How hard is it to stick a landing? I mean, it’s very much under actuated. In the air, you don’t have as much control about anything. So how hard is it to get that to work? First of all, did flips with a hopping robot."
  },
  {
    "start": 298,
    "end": 299,
    "speaker": "Marc Raibert",
    "timestamp": "(00:40:57)",
    "text": "If you look at the first time we ever made a robot do a somersault, it was in a planer robot. It had a boom. So it was restricted to the surface of a sphere. We call that planer. So it could move fore-and-aft, it could go up and down and it could rotate. And so the calculation of what you need to do to stick a landing isn’t all that complicated. You have to get time to make the rotation."
  },
  {
    "start": 300,
    "end": 301,
    "speaker": "",
    "timestamp": "(00:41:22)",
    "text": "So how high you jump gives you time. You look at how quickly you can rotate. And so if you get those two right, then when you land, you have the feet in the right place and you have to get rid of all that rotational and linear momentum. But that’s not too hard to figure out. And we made back in about 1985 or six, I can’t remember, we had a simple robot doing somersaults."
  },
  {
    "start": 302,
    "end": 303,
    "speaker": "",
    "timestamp": "(00:41:50)",
    "text": "To do it in 3D, really the calculation is the same. You just have to be balancing in the other degrees of freedom. If you’re just doing a somersault, it’s just a plainer thing. Ron Robert was my graduate student and we were at MIT, which is when we made a two-legged robot do a 3D somersault for the first time. There, in order to get enough rotation rate you needed to do tucking also, withdraw the legs in order to accelerate it."
  },
  {
    "start": 304,
    "end": 305,
    "speaker": "",
    "timestamp": "(00:42:15)",
    "text": "And he did some really fascinating work on how you stabilize more complicated maneuvers. You remember he was a gymnast at Champion Gymnast before he’d come to me. So he had the physical abilities and he was an engineer, so he could translate some of that into the math and the algorithms that you need to do that."
  },
  {
    "start": 306,
    "end": 307,
    "speaker": "Lex Fridman",
    "timestamp": "(00:42:37)",
    "text": "He knew how humans do it. You just have to get robots to do the same."
  },
  {
    "start": 308,
    "end": 309,
    "speaker": "Marc Raibert",
    "timestamp": "(00:42:41)",
    "text": "Unfortunately though, humans don’t really know how they do it, right. We are coached, we have ways of learning, but do we really understand in a physics way what we’re doing? Probably most gymnasts and athletes don’t know."
  },
  {
    "start": 310,
    "end": 311,
    "speaker": "Lex Fridman",
    "timestamp": "(00:42:57)",
    "text": "So in some way, by building robots, you are in part understanding how humans do walking. Most of us walk without considering how we walk really and how we make it so natural and efficient, all those kinds of things."
  },
  {
    "start": 312,
    "end": 313,
    "speaker": "Marc Raibert",
    "timestamp": "(00:43:10)",
    "text": "Atlas still doesn’t walk like a person and it still doesn’t walk quite as gracefully as a person. Even though it’s been getting closer and closer. The running might be close to a human, but the walking is still a challenge."
  },
  {
    "start": 314,
    "end": 315,
    "speaker": "Lex Fridman",
    "timestamp": "(00:43:23)",
    "text": "That’s interesting, right? That running is closer to a human. It just shows that the more aggressive and the more you leap into the unknown, the more natural it is. I mean, walking is kind of falling always right?"
  },
  {
    "start": 316,
    "end": 317,
    "speaker": "Marc Raibert",
    "timestamp": "(00:43:37)",
    "text": "And something weird about the knee that you can do this folding and unfolding and get it to work out just a human can get it to work out just right, there’s compliances. Compliance means springiness in the design that are important to how it all works. Well, we used to have a motto at the Boston Dynamics in the early days, which was you have to run before you can walk."
  },
  {
    "start": 318,
    "end": 319,
    "speaker": "Lex Fridman",
    "timestamp": "(00:44:00)",
    "text": "That’s a good motto because you also had Wildcat, which was one of along the way towards Spot, which is a quadruplet that went 19 miles an hour on flat terrain. Is that the fastest you’ve ever built?"
  },
  {
    "start": 320,
    "end": 321,
    "speaker": "Marc Raibert",
    "timestamp": "(00:44:14)",
    "text": "Oh, yeah."
  },
  {
    "start": 322,
    "end": 323,
    "speaker": "Lex Fridman",
    "timestamp": "(00:44:14)",
    "text": "Might be the fastest quadruplet in the world. I don’t know."
  },
  {
    "start": 324,
    "end": 325,
    "speaker": "Marc Raibert",
    "timestamp": "(00:44:17)",
    "text": "For a quadruplet, probably. Of course, it was probably the loudest too. So we had this little racing go-kart engine on it, and we would get people from three buildings away sending us… Complaining about how loud it was."
  },
  {
    "start": 326,
    "end": 327,
    "speaker": "Lex Fridman",
    "timestamp": "(00:44:31)",
    "text": "So at the leg lab, I believe most of the robots didn’t have knees. How do you figure out what is the right number of actuators? What are the joints to have? What do you need to have? We humans have knees and all kinds of interesting stuff on the feet. The toe is an important part, I guess, for humans, or maybe it’s not."
  },
  {
    "start": 328,
    "end": 329,
    "speaker": "",
    "timestamp": "(00:44:55)",
    "text": "I injured my toe recently and it made running very unpleasant. So that seems to be important. So how do you figure out for efficiency, for function, for aesthetics, how many joints to have, how many actuaries to have?"
  },
  {
    "start": 330,
    "end": 331,
    "speaker": "Marc Raibert",
    "timestamp": "(00:45:09)",
    "text": "Well, it’s always a balance between wanting to get where you really want to get and what’s practical to do based on your resources or what you know and all that. So I mean, the whole idea of the pogo stick was to do a simplification. Obviously, it didn’t look like a human. I think a technical scientist could appreciate that we were capturing some of the things that are important in human locomotion without it looking like it, without having a knee, an ankle."
  },
  {
    "start": 332,
    "end": 333,
    "speaker": "",
    "timestamp": "(00:45:40)",
    "text": "I’ll tell you the first sketch that Ben Brown made when we were talking about building this thing, was a very complicated thing with zillions of springs, lots of joints. It looked much more like a kangaroo or an ostrich or something like that. Things we were paying a lot of attention to at the time. So my job was to say, okay, well let’s do something simpler to get started and maybe we’ll get there at some point."
  },
  {
    "start": 334,
    "end": 335,
    "speaker": "Lex Fridman",
    "timestamp": "(00:46:10)",
    "text": "I just love the idea that you two were studying kangaroos and ostriches."
  },
  {
    "start": 336,
    "end": 337,
    "speaker": "Marc Raibert",
    "timestamp": "(00:46:14)",
    "text": "Oh yeah, we did. We filmed and digitized data from horses. I did a dissection of ostrich at one point, which has absolutely remarkable legs."
  },
  {
    "start": 338,
    "end": 339,
    "speaker": "Lex Fridman",
    "timestamp": "(00:46:27)",
    "text": "Dumb question. Do ostriches have a lot of musculature on the legs or no?"
  },
  {
    "start": 340,
    "end": 341,
    "speaker": "Marc Raibert",
    "timestamp": "(00:46:33)",
    "text": "Most of it’s up in the feathers, but there’s a huge amount going on in the feathers, including a knee joint. The knee joint’s way up there. The thing that’s halfway down the leg that looks like a backwards knee is actually the ankle. The thing on the ground which looks like the foot is actually the toes. It’s an extended toe."
  },
  {
    "start": 342,
    "end": 343,
    "speaker": "Lex Fridman",
    "timestamp": "(00:46:51)",
    "text": "Fascinating."
  },
  {
    "start": 344,
    "end": 345,
    "speaker": "Marc Raibert",
    "timestamp": "(00:46:52)",
    "text": "But the basic morphology is the same in all these animals."
  },
  {
    "start": 346,
    "end": 347,
    "speaker": "Lex Fridman",
    "timestamp": "(00:46:58)",
    "text": "What do you think is the most beautiful movement of an animal? What animal you think is the coolest land animal? That’s cool because fish is pretty cool. Like the fish in crystal water, but legged locomotion."
  },
  {
    "start": 348,
    "end": 349,
    "speaker": "Marc Raibert",
    "timestamp": "(00:47:12)",
    "text": "The slow mos of cheetahs running are incredible. There’s so much back motion and grace, and of course they’re moving very fast. The animals running away from the cheetah are pretty exciting. The pronghorn, which they do this all four legs at once, jump called the prog, especially if there’s a group of them, to confuse whoever’s chasing them."
  },
  {
    "start": 350,
    "end": 351,
    "speaker": "Lex Fridman",
    "timestamp": "(00:47:39)",
    "text": "So they do a misdirection type of thing?"
  },
  {
    "start": 352,
    "end": 353,
    "speaker": "Marc Raibert",
    "timestamp": "(00:47:41)",
    "text": "Yep. They do a misdirection thing. The front on views of the cheetahs running fast where the tail is whipping around to help in the turns to help stabilize in the turns. That’s pretty exciting."
  },
  {
    "start": 354,
    "end": 355,
    "speaker": "Lex Fridman",
    "timestamp": "(00:47:51)",
    "text": "Because they spend a lot of time in the air, I guess, as they’re running that fast."
  },
  {
    "start": 356,
    "end": 357,
    "speaker": "Marc Raibert",
    "timestamp": "(00:47:55)",
    "text": "But they also turn very fast."
  },
  {
    "start": 358,
    "end": 359,
    "speaker": "Lex Fridman",
    "timestamp": "(00:47:57)",
    "text": "Is that a tail thing or is do you have to have contact with ground?"
  },
  {
    "start": 360,
    "end": 361,
    "speaker": "Marc Raibert",
    "timestamp": "(00:48:00)",
    "text": "Everything in the body is probably helping turn because they’re chasing something that’s trying to get away. That’s also zigzagging around. But I would be remiss if I didn’t say humans are pretty good too. You watch gymnasts, especially these days, they’re doing just incredible stuff."
  },
  {
    "start": 362,
    "end": 363,
    "speaker": "Lex Fridman",
    "timestamp": "(00:48:19)",
    "text": "Well, especially Olympic level gymnasts. See, but there could be cheetahs that are Olympic level. We might be watching the average cheetah versus there could be a really special cheetah that can do-"
  },
  {
    "start": 364,
    "end": 365,
    "speaker": "Marc Raibert",
    "timestamp": "(00:48:31)",
    "text": "You’re right."
  },
  {
    "start": 366,
    "end": 367,
    "speaker": "Lex Fridman",
    "timestamp": "(00:48:32)",
    "text": "When did the knees first come into play in you building legged robots?"
  },
  {
    "start": 368,
    "end": 369,
    "speaker": "Marc Raibert",
    "timestamp": "(00:48:37)",
    "text": "In BigDog. BigDog came first and then LittleDog was later. And there’s a big compromise there. Human knees have multiple muscles and you could argue that there’s… I mean, it’s a technical thing about negative work when you’re contracting a joint, but you’re pushing out, that’s negative work. And if you don’t have a place to store that, it can be very expensive to do negative work."
  },
  {
    "start": 370,
    "end": 371,
    "speaker": "",
    "timestamp": "(00:49:08)",
    "text": "And in BigDog, there was no place to store negative work in the knees. But BigDog also had pogo stick springs down below. So part of the action was to comply in a bouncing motion. Later on in Spot, we took that out. As we got further and further away from the leg lab, we had more energy-driven controls."
  },
  {
    "start": 372,
    "end": 373,
    "speaker": "Lex Fridman",
    "timestamp": "(00:49:34)",
    "text": "Is there something to be said about needs that go forward versus backward?"
  },
  {
    "start": 374,
    "end": 375,
    "speaker": "Marc Raibert",
    "timestamp": "(00:49:40)",
    "text": "Sure. There’s this idea called passive dynamics, which says that although you can use computers and actuators to make a motion, a mechanical system can make a motion just by itself if it gets stimulated the right way. So Tad McGeer, I think in the mid 80s, maybe it was in the late 80s, started to work on that."
  },
  {
    "start": 376,
    "end": 377,
    "speaker": "",
    "timestamp": "(00:50:06)",
    "text": "And he made this legged system that could walk down an incline plane where the legs folded and unfolded and swung forward, do the whole walking motion where there was no computer. There were some adjustments to the mechanics so that there were dampers and springs in some places that helped the mechanical action happen. It was essentially a mechanical computer. And the interesting idea there is that it’s not all about the brain dictating to the body what the body should do. The body is a participant in the motion."
  },
  {
    "start": 378,
    "end": 379,
    "speaker": "Lex Fridman",
    "timestamp": "(00:50:42)",
    "text": "So a great design for a robot has a mechanical component where the movement is efficient even without a brain?"
  },
  {
    "start": 380,
    "end": 381,
    "speaker": "Marc Raibert",
    "timestamp": "(00:50:49)",
    "text": "Yes."
  },
  {
    "start": 382,
    "end": 383,
    "speaker": "Lex Fridman",
    "timestamp": "(00:50:50)",
    "text": "How do you design that?"
  },
  {
    "start": 384,
    "end": 385,
    "speaker": "Marc Raibert",
    "timestamp": "(00:50:52)",
    "text": "I think that these days most robots aren’t doing that. Most robots are basically using the computer to govern the motion. Now, the brain though is taking into account what the mechanical thing can do and how it’s going to behave. Otherwise, it would have to really forcefully move everything around all the time which probably some solutions do, but I think you end up with a more efficient and more graceful thing if you’re taking into account what the machine wants to do."
  },
  {
    "start": 386,
    "end": 387,
    "speaker": "Lex Fridman",
    "timestamp": "(00:51:23)",
    "text": "So this might be a good place to mention that you’re now leading up the Boston Dynamics AI Institute newly formed, which is focused more on designing the robots of the future. I think one of the things, maybe you can tell me the big vision for what’s going on, but one of the things is this idea that hardware still matters with organic design and so on. Maybe before that, can you zoom out and tell me what the vision is for the AI Institute?"
  },
  {
    "start": 388,
    "end": 389,
    "speaker": "Marc Raibert",
    "timestamp": "(00:51:57)",
    "text": "I like to talk about intelligence having two parts, an athletic part and a cognitive part."
  },
  {
    "start": 390,
    "end": 391,
    "speaker": "Marc Raibert",
    "timestamp": "(00:52:00)",
    "text": "An athletic part and a cognitive part. I think Boston Dynamics, in my view, has set the standard for what athletic intelligence can be. And it has to do with all the things we’ve been talking about, the mechanical design, the real-time control, the energetics and that kind of stuff. But obviously, people have another kind of intelligence, and animals have another kind of intelligence. We can make a plan. Our meeting started at 9:30, I looked up on Google Maps how long it took to walk over here. It was 20 minutes, so I decided, okay, I’d leave my house at nine, which is what I did. Simple intelligence, but we use that kind of stuff all the time. It’s what we think of as going on in our heads."
  },
  {
    "start": 392,
    "end": 393,
    "speaker": "",
    "timestamp": "(00:52:50)",
    "text": "And I think that’s in short supply for robots. Most robots are pretty dumb. As a result, it takes a lot of skilled people to program them to do everything they do, and it takes a long time. If robots are going to satisfy our dreams, they need to be smarter. So the AI Institute is designed to combine that physicality of the athletic side with the cognitive side."
  },
  {
    "start": 394,
    "end": 395,
    "speaker": "",
    "timestamp": "(00:53:22)",
    "text": "For instance, we’re trying to make robots that can watch a human do a task, understand what it’s seeing, and then do the task itself. OJT, on-the-job training for robots as a paradigm. Now, that’s pretty hard, and it’s sort of science fiction, but our idea is to work on a longer timeframe and work on solving those kinds of problems. I have a whole list of things that are in that vein."
  },
  {
    "start": 396,
    "end": 397,
    "speaker": "Lex Fridman",
    "timestamp": "(00:53:53)",
    "text": "Maybe we can just take many of the things you mentioned, just take it as a tangent. First of all, athletic intelligence is a super cool term. And that really is intelligence. We humans take it for granted that we’re so good at walking and moving about the world."
  },
  {
    "start": 398,
    "end": 399,
    "speaker": "Marc Raibert",
    "timestamp": "(00:54:10)",
    "text": "And using our hands."
  },
  {
    "start": 400,
    "end": 401,
    "speaker": "Lex Fridman",
    "timestamp": "(00:54:10)",
    "text": "Using your hands."
  },
  {
    "start": 402,
    "end": 403,
    "speaker": "Marc Raibert",
    "timestamp": "(00:54:11)",
    "text": "The mechanics of interacting with all these [inaudible 00:54:15] these two things."
  },
  {
    "start": 404,
    "end": 405,
    "speaker": "Lex Fridman",
    "timestamp": "(00:54:18)",
    "text": "And you’ve never touched those things before."
  },
  {
    "start": 406,
    "end": 407,
    "speaker": "Marc Raibert",
    "timestamp": "(00:54:18)",
    "text": "Never touched… Well, I’ve touched ones like this."
  },
  {
    "start": 408,
    "end": 409,
    "speaker": "Lex Fridman",
    "timestamp": "(00:54:20)",
    "text": "[inaudible 00:54:20]."
  },
  {
    "start": 410,
    "end": 411,
    "speaker": "Marc Raibert",
    "timestamp": "(00:54:20)",
    "text": "Look at all the things I can do, right? I can juggle them, I’m rotating it this way, I can rotate it without looking. I could fetch these things out my pocket and figure out which one was which and all that kind of stuff. And I don’t think we have much of a clue how all that works yet."
  },
  {
    "start": 412,
    "end": 413,
    "speaker": "Lex Fridman",
    "timestamp": "(00:54:36)",
    "text": "I really like putting that under the banner of athletic intelligence. What are the big open problems in athletic intelligence? Boston Dynamics, with Spot, with Atlas, just have shown time and time again, pushed the limits of what we think is possible with robots. But where do we stand actually, if we zoom out. What are the big open problems on the athletic intelligence side?"
  },
  {
    "start": 414,
    "end": 415,
    "speaker": "Marc Raibert",
    "timestamp": "(00:55:01)",
    "text": "I mean, one question you could ask, that isn’t my question, but are they commercially viable? Will they increase productivity? And I think we’re getting very close to that. I don’t think we’re quite there still. Most of the robotics companies, it’s a struggle. It’s really the lack of the cognitive side that probably is the biggest barrier at the moment, even for the physically successful robots."
  },
  {
    "start": 416,
    "end": 417,
    "speaker": "Lex Fridman",
    "timestamp": "(00:55:01)",
    "text": "Interesting."
  },
  {
    "start": 418,
    "end": 419,
    "speaker": "Marc Raibert",
    "timestamp": "(00:55:27)",
    "text": "But your question’s a good one. You can always do a thing that’s more efficient, lighter, more reliable. I’d say reliability. I know that Spot, they’ve been working very hard on getting the tail of the reliability curve up and they’ve made huge progress. There’s 1500 of them out there now, many of them being used in practical applications, day in and day out, where they have to work reliably. And it’s very exciting that they’ve done that. But it takes a huge effort to get that reliability in the robot."
  },
  {
    "start": 420,
    "end": 421,
    "speaker": "",
    "timestamp": "(00:56:07)",
    "text": "There’s cost too, you’d like to get the cost down. Spots are still pretty expensive, and I don’t think that they have to be, but it takes a different kind of activity to do that. I think that Boston Dynamics is owned primarily by Hyundai now, and I think that the skills of Hyundai in making cars can be brought to bear in making robots that are less expensive and more reliable and those kinds of things."
  },
  {
    "start": 422,
    "end": 423,
    "speaker": "Lex Fridman",
    "timestamp": "(00:56:40)",
    "text": "On the cognitive side for the AI Institute, what’s the trade-off between moonshot projects for you and maybe incremental progress?"
  },
  {
    "start": 424,
    "end": 425,
    "speaker": "Marc Raibert",
    "timestamp": "(00:56:50)",
    "text": "That’s a good question. I think we’re using the paradigm called stepping stones to moonshots. I don’t believe… That was in my original proposal for the institute, stepping stones to moonshots. I think if you go more than a year without seeing a tangible status report of where you are, which is the stepping stone, and it could be a simplification, you don’t necessarily have to solve all the problems of your target goal, even though your target goal is going to take several years, those stepping stone results give you feedback, give motivation, because usually there’s some success in there. So that’s the mantra we’ve been working on, and that’s pretty much how I’d say Boston Dynamics has worked, where you make progress and show it as you go. Show it to yourself, if not to the world."
  },
  {
    "start": 426,
    "end": 427,
    "speaker": "Lex Fridman",
    "timestamp": "(00:57:45)",
    "text": "What does success look like? What are some of the milestones you’re chasing?"
  },
  {
    "start": 428,
    "end": 429,
    "speaker": "Marc Raibert",
    "timestamp": "(00:57:52)",
    "text": "Well, with Watch Understand Do, the project I mentioned before, we’ve broken that down into getting some progress with, what does meaningfully watching something mean? Breaking down an observation of a person doing something into the components, segmenting. You watch me do something, I’m going to pick up this thing and put it down here and stack this on it. Well, it’s not obvious if you just look at the raw data, what the sequence of acts are. It’s really a creative intelligent act for you to break that down into the pieces and understand them in a way, so you could say, “Okay, what skill do I need to accomplish each of those things?” So we’re working on the front end of that kind of a problem, where we observe and translate the, it may be video, it may be live, into a description of what we think is going on and then try and map that into skills to accomplish that. And we’ve been developing skills as well. So we have multiple stabs at the pieces of doing that."
  },
  {
    "start": 430,
    "end": 431,
    "speaker": "Lex Fridman",
    "timestamp": "(00:58:55)",
    "text": "That. And this is usually video of humans manipulating objects with their hands, kind of thing."
  },
  {
    "start": 432,
    "end": 433,
    "speaker": "Marc Raibert",
    "timestamp": "(00:59:00)",
    "text": "Mm-hmm. We’re starting out with bicycle repair, some simple bicycle repair tasks."
  },
  {
    "start": 434,
    "end": 435,
    "speaker": "Lex Fridman",
    "timestamp": "(00:59:05)",
    "text": "Oh no. That seems complicated, that seems really complicated."
  },
  {
    "start": 436,
    "end": 437,
    "speaker": "Marc Raibert",
    "timestamp": "(00:59:07)",
    "text": "Well, it is, but there’s some parts of it that aren’t, like putting the seat into the… You have a tube that goes inside of another tube and there’s a latch. That should be within range."
  },
  {
    "start": 438,
    "end": 439,
    "speaker": "Lex Fridman",
    "timestamp": "(00:59:19)",
    "text": "Is it possible to observe, to watch a video like this without having an explicit model of what a bicycle looks like?"
  },
  {
    "start": 440,
    "end": 441,
    "speaker": "Marc Raibert",
    "timestamp": "(00:59:26)",
    "text": "I think it is, and I think that’s the kind of thing that people don’t recognize. Let me translate it to navigation. I think the basic paradigm for navigating a space is to get some kind of sensor that tells you where an obstacle is and what’s open, build a map and then go through the space. But if we were doing on the job training where I was giving you a task, I wouldn’t have to say anything about the room. We came in here, all we did is adjust the chair, but we didn’t say anything about the room and we could navigate it. So I think there’s opportunities to build that kind of navigation skill into robots and we’re hoping to be able to do that."
  },
  {
    "start": 442,
    "end": 443,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:07)",
    "text": "So operate successfully under a lot of uncertainty."
  },
  {
    "start": 444,
    "end": 445,
    "speaker": "Marc Raibert",
    "timestamp": "(01:00:10)",
    "text": "Yeah. And lack of specification."
  },
  {
    "start": 446,
    "end": 447,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:13)",
    "text": "Lack of specification."
  },
  {
    "start": 448,
    "end": 449,
    "speaker": "Marc Raibert",
    "timestamp": "(01:00:14)",
    "text": "I mean that’s what intelligence is, right? Dealing with… Understanding a situation even though it wasn’t explained."
  },
  {
    "start": 450,
    "end": 451,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:22)",
    "text": "So how big of a role does machine learning play in all of this? Is this more and more learning based?"
  },
  {
    "start": 452,
    "end": 453,
    "speaker": "Marc Raibert",
    "timestamp": "(01:00:32)",
    "text": "Since Chat GPT, which is a year ago, basically, there’s a huge interest in that and a huge optimism about it. I think that there’s a lot of things that that kind of machine learning, now of course there’s lots of different kinds of machine learning, I think there’s a lot of interest and optimism about it. The facts on the ground are that doing physical things with physical robots is a little bit different than language, and the tokens don’t exist. Pixel values aren’t like words. But I think that there’s a lot that can be done there."
  },
  {
    "start": 454,
    "end": 455,
    "speaker": "",
    "timestamp": "(01:01:12)",
    "text": "We have several people working on machine learning approaches. I don’t know if you know, but we opened an office in Zurich recently, and Marco Hutter, who’s one of the real leaders in reinforcement learning for robots, is the director of that office. He’s still half-time at ETH, the university there, where he has an unbelievably fantastic lab, and then he’s half-time leading, will be leading efforts in the Zurich office. So we have a healthy learning component."
  },
  {
    "start": 456,
    "end": 457,
    "speaker": "",
    "timestamp": "(01:01:48)",
    "text": "But there’s part of me that still says, if you look out in the world at what the most impressive performances are, they’re still pretty much, I hate to use the word traditional, but that’s what everybody’s calling it, traditional controls, like model predictive control. The Atlas performances that you’ve seen are mostly model predictive control. They’ve started to do some learning stuff that’s really incredible. I don’t know if it’s all been shown yet, but you’ll see it over time. And then Marco has done some great stuff and others."
  },
  {
    "start": 458,
    "end": 459,
    "speaker": "Lex Fridman",
    "timestamp": "(01:02:21)",
    "text": "So especially for the athletic intelligence piece, the traditional approach seems to be the one that still performs the best."
  },
  {
    "start": 460,
    "end": 461,
    "speaker": "Marc Raibert",
    "timestamp": "(01:02:29)",
    "text": "I think we’re going to find a mating of the two and we’ll have the best of both worlds. And we’re working on that at the institute too."
  },
  {
    "start": 462,
    "end": 463,
    "speaker": "Lex Fridman",
    "timestamp": "(01:02:36)",
    "text": "If I can talk to you about teams, you’ve built an incredible team of Boston Dynamics, before at MIT and CMU, at Boston Dynamics, and now at the AI Institute. And you said that there’s four components to a great team, technical fearlessness, diligence, intrepidness, and fun, technical fun. Can you explain each? Technical fearlessness, what do you mean by that?"
  },
  {
    "start": 464,
    "end": 465,
    "speaker": "Marc Raibert",
    "timestamp": "(01:02:58)",
    "text": "Sure. Technical fearlessness means being willing to take on a problem that you don’t know how to solve, and study it, figure out an entry point, maybe a simplified version, or a simplified solution or something, learn from the stepping stone, and go back and eventually make a solution that meets your goals. I think that’s really important."
  },
  {
    "start": 466,
    "end": 467,
    "speaker": "Lex Fridman",
    "timestamp": "(01:03:28)",
    "text": "The fearlessness comes into play because some of it has never been done before?"
  },
  {
    "start": 468,
    "end": 469,
    "speaker": "Marc Raibert",
    "timestamp": "(01:03:32)",
    "text": "Yeah, and you don’t know how to do it. There’s easier stuff to do in life. I mean, I don’t know, Watch Understand Do, it’s a mountain of a challenge."
  },
  {
    "start": 470,
    "end": 471,
    "speaker": "Lex Fridman",
    "timestamp": "(01:03:45)",
    "text": "So that’s the really big challenge you’re tackling now, can we watch humans at scale and have robots, by watching humans, become effective actors in the world?"
  },
  {
    "start": 472,
    "end": 473,
    "speaker": "Marc Raibert",
    "timestamp": "(01:03:57)",
    "text": "Yeah. I mean we have others like that. We have one called Inspect Diagnose Fix. You call up the Maytag repairman… Okay, he’s the one who you don’t have to call. But you call up the dishwasher repair person, and they come to your house and they look at your machine. It’s already been actually figured out that something doesn’t work, but they have to examine it and figure out what’s wrong and then fix it. I think robots should be able to do that. Boston Dynamics already has Spot robots collecting data on machines, things like thermal data, reading the gauges, listening to them, getting sounds, and that data are used to determine whether they’re healthy or not. But the interpretation isn’t done by the robots yet, and certainly the fixing, the diagnosing and the fixing isn’t done yet, but I think it could be. That’s bringing the AI and combining it with the physical skills to do it."
  },
  {
    "start": 474,
    "end": 475,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:00)",
    "text": "And you’re referring to the fixing in the physical world. I can’t wait until they can fix the psychological problems of humans, and show up and talk, do therapy."
  },
  {
    "start": 476,
    "end": 477,
    "speaker": "Marc Raibert",
    "timestamp": "(01:05:08)",
    "text": "Yeah, that’s a different thing."
  },
  {
    "start": 478,
    "end": 479,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:10)",
    "text": "Yeah, it’s a different. Well, it’s all part of the same thing. Again, humanity. Maybe, maybe."
  },
  {
    "start": 480,
    "end": 481,
    "speaker": "Marc Raibert",
    "timestamp": "(01:05:17)",
    "text": "You mean convincing you it’s okay that the dishwasher’s broken, just do the [inaudible 01:05:21]. The marketing approach."
  },
  {
    "start": 482,
    "end": 483,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:23)",
    "text": "Yeah, exactly. Don’t sweat the small stuff. As opposed to fixing the dishwasher, it’ll convince you that it’s okay that the dishwasher’s broken. It’s a different approach. Diligence. Why is diligence important?"
  },
  {
    "start": 484,
    "end": 485,
    "speaker": "Marc Raibert",
    "timestamp": "(01:05:39)",
    "text": "Well, if you want a real robot solution, it can’t be a very narrow solution that’s going to break at the first variation in what the robot does, or the environment if it wasn’t exactly as you expected it. So how do you get there? I think having an approach that leaves you unsatisfied until you’ve embraced the bigger problem is the diligence I’m talking about."
  },
  {
    "start": 486,
    "end": 487,
    "speaker": "",
    "timestamp": "(01:06:08)",
    "text": "Again, I’ll point at Boston Dynamics, some of the videos that we had showing the engineer making it hard for the robot to do its task. Spot opening a door and then the guy gets there and pushes on the door so it doesn’t open the way it’s supposed to. Pulling on the rope that’s attached to the robot, so its navigation has been screwed up. We have one where the robot’s climbing stairs and an engineer is tugging on a rope that’s pulling it back down the stairs. That’s totally different than just the robot seeing the stairs, making a model, putting its feet carefully on each step. But that’s what probably robotics needs to succeed, and having that broader idea that you want to come with a robust solution is what I meant by diligence."
  },
  {
    "start": 488,
    "end": 489,
    "speaker": "Lex Fridman",
    "timestamp": "(01:06:54)",
    "text": "So really testing it in all conditions, perturbing the system in all kinds of ways, and as a result, creating some epic videos. The legendary-"
  },
  {
    "start": 490,
    "end": 491,
    "speaker": "Marc Raibert",
    "timestamp": "(01:07:03)",
    "text": "The fun part, the hockey stick."
  },
  {
    "start": 492,
    "end": 493,
    "speaker": "Lex Fridman",
    "timestamp": "(01:07:04)",
    "text": "And then yes, tugging on Spot as it’s trying to open the door. I mean, it’s great testing, but it’s also, I don’t know, it’s just somehow extremely compelling demonstration of robotics in video form."
  },
  {
    "start": 494,
    "end": 495,
    "speaker": "Marc Raibert",
    "timestamp": "(01:07:21)",
    "text": "I learned something very early on with the first three-dimensional hopping machine. If you just show a video of it hopping, it’s a so what. If you show it falling over a couple of times, and you can see how easily and fast it falls over, then you appreciate what the robot’s doing when it’s doing its thing. So I think the reaction you just gave to the robot getting interfered with or tested while it’s going through the door, it’s showing you the scope of the solution."
  },
  {
    "start": 496,
    "end": 497,
    "speaker": "Lex Fridman",
    "timestamp": "(01:07:53)",
    "text": "The limits of the system, the challenges involved in failure. Showing both failure and success makes you appreciate the success, yeah. And then just the way the videos are done in Boston Dynamics are incredible. Because there’s no flash, there’s no extra production, it’s just raw testing of the robot."
  },
  {
    "start": 498,
    "end": 499,
    "speaker": "Marc Raibert",
    "timestamp": "(01:08:13)",
    "text": "Well, I was the final edit for most of the videos up until about three years ago, or four years ago. My theory of the video is no explanation. If they can’t see it, then it’s not the right thing. And if you do something worth showing, then let them see it. Don’t interfere with a bunch of titles that slow you down, or a bunch of distraction, just do something worth showing and then show it."
  },
  {
    "start": 500,
    "end": 501,
    "speaker": "Lex Fridman",
    "timestamp": "(01:08:47)",
    "text": "That’s brilliant."
  },
  {
    "start": 502,
    "end": 503,
    "speaker": "Marc Raibert",
    "timestamp": "(01:08:49)",
    "text": "It’s hard though for people to buy into that."
  },
  {
    "start": 504,
    "end": 505,
    "speaker": "Lex Fridman",
    "timestamp": "(01:08:53)",
    "text": "Yeah, I mean people always want to add more stuff, but the simplicity of just, “Do something worth showing and show it”, that’s brilliant. And don’t add extra stuff."
  },
  {
    "start": 506,
    "end": 507,
    "speaker": "Marc Raibert",
    "timestamp": "(01:09:03)",
    "text": "People have criticized, especially the Big Dog videos, where there’s a human driving the robot. And I understand the criticism now. At the time we wanted to just show, “Look, this thing’s using its legs to get up the hill.” So we focused on showing that, which was, we thought, the story. The fact that there was a human… So they were thinking about autonomy, whereas we were thinking about the mobility. So we’ve adjusted to a lot of things that we see that people care about, trying to be honest. We’ve always tried to be honest."
  },
  {
    "start": 508,
    "end": 509,
    "speaker": "Lex Fridman",
    "timestamp": "(01:09:38)",
    "text": "But also just show cool stuff in its raw form, the limits of the system. Let’s see the system be perturbed and be robust and resilient and all that kind of stuff. And dancing with some music. Intrepidness and fun. So, intrepid?"
  },
  {
    "start": 510,
    "end": 511,
    "speaker": "Marc Raibert",
    "timestamp": "(01:09:57)",
    "text": "I mean, it might be the most important ingredient."
  },
  {
    "start": 512,
    "end": 513,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:00)",
    "text": "Sure."
  },
  {
    "start": 514,
    "end": 515,
    "speaker": "Marc Raibert",
    "timestamp": "(01:10:00)",
    "text": "And that is, robotics is hard, it’s not going to work right right away, so don’t be discouraged, is all it really means. Usually, when I talk about these things, I show videos, and I show a long string of outtakes. You have to have courage to be intrepid, when you work so hard to build your machine, and then you’re trying it, and it just doesn’t do what you thought it would do, what you want it to do, and you have to stick to it and keep trying."
  },
  {
    "start": 516,
    "end": 517,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:35)",
    "text": "I mean, we don’t often see that, the story behind Spot and Atlas. How many failures were there along the way to get a working Atlas, a working Spot, in the early days, even a working Big Dog?"
  },
  {
    "start": 518,
    "end": 519,
    "speaker": "Marc Raibert",
    "timestamp": "(01:10:49)",
    "text": "There’s a video of Atlas climbing three big steps, and it’s very dynamic and it’s really exciting, real accomplishment. It took 109 tries and we have video of every one of them, we shoot everything. Again, we, this is at Boston Dynamics. So it took 109 tries, but once it did it had a high percentage of success. So it’s not like we’re cheating by just showing the best one, but we do show the evolved performance, not everything along the way. But everything along the way is informative. And it shows there’s stupid things that go wrong, like the robot, just when you say go and it collapses right there on the start, that doesn’t have to do with the steps. Or the perception didn’t work right, so you miss the target when you jump, or something breaks and there’s oil flying everywhere. But that’s fun."
  },
  {
    "start": 520,
    "end": 521,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:47)",
    "text": "Yeah. So the hardware failures and maybe some software-"
  },
  {
    "start": 522,
    "end": 523,
    "speaker": "Marc Raibert",
    "timestamp": "(01:11:50)",
    "text": "Lots of control of evolution during that time. I think it took six weeks to get those 109 trials, because there was programming going on. It was actually robot learning, but there were human in the loop helping with the learning. So all data-driven."
  },
  {
    "start": 524,
    "end": 525,
    "speaker": "Lex Fridman",
    "timestamp": "(01:12:08)",
    "text": "Okay, and you always are learning from that failure."
  },
  {
    "start": 526,
    "end": 527,
    "speaker": "Marc Raibert",
    "timestamp": "(01:12:12)",
    "text": "Right."
  },
  {
    "start": 528,
    "end": 529,
    "speaker": "Lex Fridman",
    "timestamp": "(01:12:16)",
    "text": "How do you protect Atlas from not getting damaged from 109 attempts?"
  },
  {
    "start": 530,
    "end": 531,
    "speaker": "Marc Raibert",
    "timestamp": "(01:12:24)",
    "text": "It’s remarkable. One of the accomplishments of Atlas is that the engineers have made a machine that’s robust enough that it can take that kind of testing, where it’s falling and stuff, and it doesn’t break every time. It still breaks, and part of the paradigm is to have people to repair stuff. You got to figure that in if you’re going to do this kind of work. I sometimes criticize the people who have their gold-plated thing and they keep it on the shelf and they’re afraid to use it. I don’t think you can make progress if you’re working that way. You need to be ready to have it break and go in there and fix it. It’s part of the thing. Plan your budget so you have spare parts and a crew and all that stuff."
  },
  {
    "start": 532,
    "end": 533,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:07)",
    "text": "If it falls 109 times, it’s okay. Wow. So, intrepid, truly. And that applies to Spot, that applies to all the other robot stuff."
  },
  {
    "start": 534,
    "end": 535,
    "speaker": "Marc Raibert",
    "timestamp": "(01:13:17)",
    "text": "Applies to everything. I think it applies to everything anybody tries to do that’s worth doing."
  },
  {
    "start": 536,
    "end": 537,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:22)",
    "text": "And especially with systems in the real world, right?"
  },
  {
    "start": 538,
    "end": 539,
    "speaker": "Marc Raibert",
    "timestamp": "(01:13:24)",
    "text": "Yeah."
  },
  {
    "start": 540,
    "end": 541,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:26)",
    "text": "So, fun."
  },
  {
    "start": 542,
    "end": 543,
    "speaker": "Marc Raibert",
    "timestamp": "(01:13:27)",
    "text": "Fun. Technical fun, I usually say."
  },
  {
    "start": 544,
    "end": 545,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:30)",
    "text": "Technical fun."
  },
  {
    "start": 546,
    "end": 547,
    "speaker": "Marc Raibert",
    "timestamp": "(01:13:31)",
    "text": "Have technical fun. I think that life as an engineer is really satisfying. To some degree it can be like crafts work, where you get to do things with your own hands, or your own design, or whatever your media is, and it’s very satisfying to be able to just do the work. Unlike a lot of people who have to do something that they don’t like doing, I think engineers typically get to do something that they like and there’s a lot of satisfaction from that. Then there’s, in many cases, you can have impact on the world somehow, because you’ve done something that other people admire, which is different from just the craft fun of building a thing. So that’s the second way that being an engineer is good."
  },
  {
    "start": 548,
    "end": 549,
    "speaker": "",
    "timestamp": "(01:14:19)",
    "text": "I think the third thing is that if you’re lucky to be working in a team where you’re getting the benefit of other people’s skills that are helping you do your thing. None of us has all the skills needed to do most of these projects, and if you have a team where you’re working well with the others, that can be very satisfying."
  },
  {
    "start": 550,
    "end": 551,
    "speaker": "",
    "timestamp": "(01:14:40)",
    "text": "Then if you’re an engineer, you also usually get paid. So you kind of get paid four times in my view of the world. So what could be better than that?"
  },
  {
    "start": 552,
    "end": 553,
    "speaker": "Lex Fridman",
    "timestamp": "(01:14:49)",
    "text": "Get paid to have fun. What do you love about engineering? When you say engineering, what does that mean to you exactly? What is this big thing that we call engineering?"
  },
  {
    "start": 554,
    "end": 555,
    "speaker": "Marc Raibert",
    "timestamp": "(01:15:00)",
    "text": "I think it’s both being a scientist, or getting to use science, at the same time as being an artist or a creator. Scientists only get to study what’s out there, and engineers get to make stuff that didn’t exist before. So it’s really, I think, a higher calling, even though I think most the public out there thinks science is top and engineering is somehow secondary, but I think it’s the other way around."
  },
  {
    "start": 556,
    "end": 557,
    "speaker": "Lex Fridman",
    "timestamp": "(01:15:26)",
    "text": "And at the cutting edge, I think, when you talk about robotics, there is a possibility to do art in that you do the first of its kind thing. Then there’s the production at scale, which is its own beautiful thing. But when you do the first new robot or the first new thing, that’s a possibility to create something totally new, that is art."
  },
  {
    "start": 558,
    "end": 559,
    "speaker": "Marc Raibert",
    "timestamp": "(01:15:48)",
    "text": "Bringing metal to life, or a machine to life, is fun. It was fun doing the dancing videos, where got a huge public response, and we’re going to do more. We’re doing some at the institute doing some at the institute and we’ll do more."
  },
  {
    "start": 560,
    "end": 561,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:05)",
    "text": "Well, that metal to life moment. I mean, to me that’s still magical. When inanimate objects comes to life, to me-"
  },
  {
    "start": 562,
    "end": 563,
    "speaker": "Marc Raibert",
    "timestamp": "(01:16:15)",
    "text": "It’s cool."
  },
  {
    "start": 564,
    "end": 565,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:16)",
    "text": "… to this day, is still an incredible moment. That human intelligence can create systems that instill life, or whatever that is, into inanimate objects, it’s truly magical. Especially when it’s at the scale that humans can perceive and appreciate directly."
  },
  {
    "start": 566,
    "end": 567,
    "speaker": "Marc Raibert",
    "timestamp": "(01:16:37)",
    "text": "But I think, with going back to the pieces of that, you design a linkage that turns out to be half the weight and just as strong, that’s very satisfying."
  },
  {
    "start": 568,
    "end": 569,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:48)",
    "text": "That’s [inaudible 01:16:49], yeah."
  },
  {
    "start": 570,
    "end": 571,
    "speaker": "Marc Raibert",
    "timestamp": "(01:16:49)",
    "text": "There are people who do that and it’s a creative act."
  },
  {
    "start": 572,
    "end": 573,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:54)",
    "text": "What to you is most beautiful about robotics? Sorry for the big romantic question."
  },
  {
    "start": 574,
    "end": 575,
    "speaker": "Marc Raibert",
    "timestamp": "(01:17:01)",
    "text": "I think having the robots move in a way that’s evocative of life is pretty exciting."
  },
  {
    "start": 576,
    "end": 577,
    "speaker": "Lex Fridman",
    "timestamp": "(01:17:08)",
    "text": "So the elegance of movement."
  },
  {
    "start": 578,
    "end": 579,
    "speaker": "Marc Raibert",
    "timestamp": "(01:17:09)",
    "text": "Yeah. Or if it’s a high performance act where it’s doing it faster, bigger than other robots. Usually we’re not doing it bigger, faster than people, but we’re getting there in a few narrow dimensions."
  },
  {
    "start": 580,
    "end": 581,
    "speaker": "Lex Fridman",
    "timestamp": "(01:17:22)",
    "text": "So faster, bigger, smoother, more elegant, more graceful."
  },
  {
    "start": 582,
    "end": 583,
    "speaker": "Marc Raibert",
    "timestamp": "(01:17:27)",
    "text": "I mean, I’d like to do dancing that starts… We’re nowhere near the dancing capabilities of a human. We’ve been having a ballerina in, who’s kind of a well-known ballerina, and she’s been programming the robot. We’ve been working on the tools that can make it so that she can use her way of talking, way of doing a choreography or something like that, more accessible, to get the robot to do things, and starting to produce some interesting stuff."
  },
  {
    "start": 584,
    "end": 585,
    "speaker": "Lex Fridman",
    "timestamp": "(01:17:58)",
    "text": "Well, we should mention that there is a choreography tool."
  },
  {
    "start": 586,
    "end": 587,
    "speaker": "Marc Raibert",
    "timestamp": "(01:18:00)",
    "text": "There is."
  },
  {
    "start": 588,
    "end": 589,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:02)",
    "text": "I guess-"
  },
  {
    "start": 590,
    "end": 591,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:00)",
    "text": "Tool."
  },
  {
    "start": 592,
    "end": 593,
    "speaker": "Marc Raibert",
    "timestamp": "(01:18:00)",
    "text": "There is."
  },
  {
    "start": 594,
    "end": 595,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:02)",
    "text": "I mean I guess I saw versions of it, which is pretty cool. You can, at slices of time, control different parts at the high level, the movement of the robot, Spot and other-"
  },
  {
    "start": 596,
    "end": 597,
    "speaker": "Marc Raibert",
    "timestamp": "(01:18:15)",
    "text": "We hope to take that forward and make it more tuned to how the dance world wants to talk, wants to communicate and get better performances. I mean, we’ve done a lot, but there’s still a lot possible. And I’d like to have performances where the robots are dancing with people. So right now almost everything that we’ve done on dancing is to a fixed time base. So once you press go, the robot does its thing and plays out its thing. It’s not listening, it’s not watching. But I think it should do those things."
  },
  {
    "start": 598,
    "end": 599,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:48)",
    "text": "I think I would love to see a professional ballerina, alone in her room with a robot, slowly teaching the robot. Just actually, the process of a clueless robot trying to figure out a small little piece of a dance. Because right now, Atlas and Spot have done perfect dancing to a beat and so on, to a degree, but the learning process of interacting with a human would be incredible to watch."
  },
  {
    "start": 600,
    "end": 601,
    "speaker": "Marc Raibert",
    "timestamp": "(01:19:19)",
    "text": "One of the cool things going on, you know that there’s a class at Brown University called Choreorobotics? Sidney Skybetter is a dancer, choreographer and he teamed up with Stefanie Tellex, who’s a computer science professor, and they taught this class and I think they have some graduate students helping teach it, where they have two spots and people come in. I think it’s 50/50 of computer science people and dance people, and they program performances that are very interesting. I show some of them sometimes when I give a talk."
  },
  {
    "start": 602,
    "end": 603,
    "speaker": "Lex Fridman",
    "timestamp": "(01:19:53)",
    "text": "And making that process of a human teaching the robot more efficient, more intuitive, maybe partial language, part movement. That’d be really fascinating because one of the things I’ve realized is humans communicate with movement a lot. It’s not just language, there’s a lot. There’s body language, there’s so many intricate little things. To watch a human and Spot communicate back and forth with movement, I mean there’s just so many wonderful possibilities there."
  },
  {
    "start": 604,
    "end": 605,
    "speaker": "Marc Raibert",
    "timestamp": "(01:20:28)",
    "text": "But it’s also a challenge. We get asked to have our robots perform with famous dancers and they have 200 degrees of freedom or something, every little ripple and thing, and they have all this head and neck and shoulders and stuff, and the robots mostly don’t have all that stuff and it’s a daunting challenge to not look physically stupid next to them. So we’ve pretty much avoided that performance, but we’ll get to it."
  },
  {
    "start": 606,
    "end": 607,
    "speaker": "Lex Fridman",
    "timestamp": "(01:21:04)",
    "text": "I think even with the limited degrees of freedom, we could still have some sass and flavor and so on. You can figure out your own thing even if you can’t-"
  },
  {
    "start": 608,
    "end": 609,
    "speaker": "Marc Raibert",
    "timestamp": "(01:21:11)",
    "text": "And we can reverse things. If you watch a human do a robot animation, which is a dance style where you jerk around and you pop and lock and all that stuff, I think the robots could show up the humans by doing unstable oscillations and things that are faster than a person could. So that’s on my plan, but I haven’t quite gotten there yet."
  },
  {
    "start": 610,
    "end": 611,
    "speaker": "Lex Fridman",
    "timestamp": "(01:21:39)",
    "text": "You mentioned about building teams and robotics teams and so on. How do you find great engineers? How do you hire great engineers?"
  },
  {
    "start": 612,
    "end": 613,
    "speaker": "Marc Raibert",
    "timestamp": "(01:21:45)",
    "text": "Well, it’s a chicken and egg. If you have an environment where interesting engineering is going on, then engineers want to work there. And I think it took a long time to develop that at Boston Dynamics. In fact, when we started, although I had the experience of building things in the leg lab, both at CMU and at MIT, we weren’t that sophisticated an engineering thing compared to what Boston Dynamics is now, but it was our ambition to do that. And Sarcos was another robot company, so I always thought of us as being this much on the computing side, and this much on the hardware side, and they were this. And then over the years, I think we achieved the same or better levels of engineering."
  },
  {
    "start": 614,
    "end": 615,
    "speaker": "",
    "timestamp": "(01:22:41)",
    "text": "Meanwhile, Sarcos got acquired and then they went through all changes and I don’t know exactly what their current status is. So it took many years, is part of the answer. I think you got to find people who love it. In the early days, we paid a little less so we only got people who were doing it because they really loved it. We also hired people who might not have professional degrees, people who were building bicycles and building kayaks. We have some people who come from the maker world, and that’s really important for the work we do, to have that be part of the mix."
  },
  {
    "start": 616,
    "end": 617,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:20)",
    "text": "Whatever that is. Whatever the magic ingredient that makes a great builder, maker. That’s the big part of it."
  },
  {
    "start": 618,
    "end": 619,
    "speaker": "Marc Raibert",
    "timestamp": "(01:23:26)",
    "text": "People who repaired their cars or motorcycles or whatever in their garages when they were kids."
  },
  {
    "start": 620,
    "end": 621,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:35)",
    "text": "The robotics students, grad students, and just roboticists that I know and I hang out with, there’s a endless energy and they’re just happy. Say, I compare another group of people that are alike that are people that skydive professionally. There’s just excitement and general energy that I think probably has to do with the fact that they’re just constantly, first of all, fail a lot. And then the joy of building a thing that you eventually works."
  },
  {
    "start": 622,
    "end": 623,
    "speaker": "Marc Raibert",
    "timestamp": "(01:24:06)",
    "text": "Talking about being happy, there used to be a time when I was doing the machine shop work myself back in those JPL and Caltech days, when, if I came home smelling like the machine shop because it’s an oily place, my wife would say, “You had a good day today.” Because she could tell that that’s where I’d been."
  },
  {
    "start": 624,
    "end": 625,
    "speaker": "Lex Fridman",
    "timestamp": "(01:24:26)",
    "text": "You’ve actually built something. You’ve done something in the physical world. And probably the videos help show off what robotics is."
  },
  {
    "start": 626,
    "end": 627,
    "speaker": "Marc Raibert",
    "timestamp": "(01:24:36)",
    "text": "At Boston Dynamics, it put us on the map. I remember interviewing some sales guy and he was from a company and he said, “Well, no one’s ever heard of my company but we have really good products. You guys, everybody knows who you are but you don’t have any products at all.” Which was true, and we thank YouTube for that. YouTube came, we caught the YouTube wave and it had a huge impact on our company."
  },
  {
    "start": 628,
    "end": 629,
    "speaker": "Lex Fridman",
    "timestamp": "(01:25:06)",
    "text": "I mean, it’s a big impact not just on your company, but on robotics in general and helping people understand and inspire what is possible with robots, and inspire imagination, fear and everything. The full spectrum of human emotion was aroused, which is great for the entirety of humanity, and also, it’s probably inspiring for young people that want to get into AI and robotics. Let me ask you about some competitors. You’ve been a complimentary of Elon and Tesla’s work on Optimus robot with their humanoid robot. What do you think of their efforts there with the humanoid robot?"
  },
  {
    "start": 630,
    "end": 631,
    "speaker": "Marc Raibert",
    "timestamp": "(01:25:48)",
    "text": "I really admire Elon as a technologist. I think that what he did with Tesla, it was just totally mind-boggling that he could go from this totally niche area that less than 1% of anybody seemed to be interested to making it, so that essentially every car company in the world is trying to do what he’s done. So you got to give it to him. Then look at SpaceX, he’s basically replaced NASA. That might be a little exaggeration, but not by much."
  },
  {
    "start": 632,
    "end": 633,
    "speaker": "",
    "timestamp": "(01:26:24)",
    "text": "So you got to admire the guy and I wouldn’t count him out for anything. I don’t think Optimus today is where Atlas is, for instance. I don’t know, it’s a little hard to compare them to the other companies. I visited Figure. I think they’re doing well and they have a good team. I’ve visited Apptronik and I think they have a good team and they’re doing well. But Elon has a lot of resources, he has a lot of ambition. I like to take some credit for his ambition. I think if I read between the lines, it’s hard not to think that him seeing what Atlas is doing is a little bit of an inspiration. I hope so."
  },
  {
    "start": 634,
    "end": 635,
    "speaker": "Lex Fridman",
    "timestamp": "(01:27:13)",
    "text": "Do you think Atlas and Optimus will hang out at some point?"
  },
  {
    "start": 636,
    "end": 637,
    "speaker": "Marc Raibert",
    "timestamp": "(01:27:17)",
    "text": "I would love to host that. Now that I’m not at Boston Dynamics, I’m not officially connected, I’m on the board but I’m not officially connected, I would love to host a-"
  },
  {
    "start": 638,
    "end": 639,
    "speaker": "Lex Fridman",
    "timestamp": "(01:27:27)",
    "text": "A robot meetups?"
  },
  {
    "start": 640,
    "end": 641,
    "speaker": "Marc Raibert",
    "timestamp": "(01:27:28)",
    "text": "… a wrote up meetup, yeah."
  },
  {
    "start": 642,
    "end": 643,
    "speaker": "Lex Fridman",
    "timestamp": "(01:27:31)",
    "text": "Does the AI Institute work with Spots and Atlas? Is it focused on Spots mostly right now as a platform?"
  },
  {
    "start": 644,
    "end": 645,
    "speaker": "Marc Raibert",
    "timestamp": "(01:27:37)",
    "text": "We have a bunch of different robots. We bought everything we could buy. So we have Spots. I think we have a good size fleet of them. I don’t know how many it is, but a good size fleet. We have a couple of ANYmal robots. ANYmal is a company founded by Marco Hutter, even though he’s not that involved anymore, but we have a couple of those. We have a bunch of arms like Franka’s and USRobotics. Because even though we have ambitions to build stuff and we are starting to build stuff, day one, getting off the ground, we just bought stuff."
  },
  {
    "start": 646,
    "end": 647,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:14)",
    "text": "I love this robot playground you’ve built."
  },
  {
    "start": 648,
    "end": 649,
    "speaker": "Marc Raibert",
    "timestamp": "(01:28:17)",
    "text": "You can come over and take a look if you want."
  },
  {
    "start": 650,
    "end": 651,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:19)",
    "text": "That’s great. So it’s all these kinds of robots, legged, arms."
  },
  {
    "start": 652,
    "end": 653,
    "speaker": "Marc Raibert",
    "timestamp": "(01:28:24)",
    "text": "Well, there’s some areas that feel like a playground, but it’s not like they’re all frolic together."
  },
  {
    "start": 654,
    "end": 655,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:31)",
    "text": "Again, maybe you’ll arrange a robot meetup. But in general, what’s your view on competition in this space for especially humanoid and legged robots? Are you excited by the competition or the friendly competition?"
  },
  {
    "start": 656,
    "end": 657,
    "speaker": "Marc Raibert",
    "timestamp": "(01:28:51)",
    "text": "I don’t think about competition that much. I’m not a commercial guy. I think for the many years I was at Boston Dynamics, we didn’t think about competition. We were just doing our thing there. It wasn’t like there were products out there that we were competing with. Maybe there was some competition for DARPA funding, which we got a lot of, got very good at getting. But even there, in a couple of cases where we might’ve competed, we ended up just being the robot provider, that is for the LittleDog program, we just made the robots. We didn’t participate as developers except for developing the robot. And in the DARPA robotics challenge, we didn’t compete. We provided the robots."
  },
  {
    "start": 658,
    "end": 659,
    "speaker": "",
    "timestamp": "(01:29:42)",
    "text": "In the AI world now, now that we’re working on cognitive stuff, it feels much more a competition. The entry requirements in terms of computing hardware and the skills of the team and hiring talent, it’s a much tougher place. So I think much more about competition now on the cognitive side. On the physical side, it doesn’t feel it’s that much about competition yet. Obviously, with 10 humanoid companies out there, 10 or 12, I mean there’s probably others that I don’t know about, they’re definitely in competition, will be in competition."
  },
  {
    "start": 660,
    "end": 661,
    "speaker": "Lex Fridman",
    "timestamp": "(01:30:22)",
    "text": "How much room is there for a quadruped and especially a humanoid robot to become cheaper? So cutting costs, and how low can you go? And how much of it is just mass production? So questions of how to produce versus engineering innovation, how to simplify it."
  },
  {
    "start": 662,
    "end": 663,
    "speaker": "Marc Raibert",
    "timestamp": "(01:30:47)",
    "text": "I think there’s a huge way to go. I don’t think we’ve seen the bottom of it, the bottom in terms of its lower prices. I think you should be totally optimistic that, at asymptote, things don’t have to be anything as expensive as they are now. Back to competition, I wanted to say one thing. I think in the quadruped space, having other people selling quadruped’s is a great thing for Boston Dynamics because I believe the question in the user’s minds is, “Which quadruped do I want?” It’s not, “Do I want a quadruped?” “Can a quadruped do my job?” It’s much more like that, which is a great place for it to be. Then you’re just doing the things you normally do to make your product better and compete, selling and all that stuff. And that’ll be the way it is with humanoids at some point."
  },
  {
    "start": 664,
    "end": 665,
    "speaker": "Lex Fridman",
    "timestamp": "(01:31:37)",
    "text": "Well, there’s a lot of humanoids and you’re just not even… It’s like iPhone versus Android and people are just buying both and it’s just, you’re not really-"
  },
  {
    "start": 666,
    "end": 667,
    "speaker": "Marc Raibert",
    "timestamp": "(01:31:48)",
    "text": "You’re creating the category or the category is happening. I mean right now, the use cases, that’s the key thing. Having realistic use cases that are moneymaking in robotics is a big challenge. There’s the warehouse use case. That’s probably the only thing that makes anybody any money in robotics at this point."
  },
  {
    "start": 668,
    "end": 669,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:10)",
    "text": "There’s got to be a moment-"
  },
  {
    "start": 670,
    "end": 671,
    "speaker": "Marc Raibert",
    "timestamp": "(01:32:11)",
    "text": "There’s old-fashioned robots. I mean, there’s fixed arms doing manufacturing. I don’t want to say that they’re not making money."
  },
  {
    "start": 672,
    "end": 673,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:17)",
    "text": "… Industrial robotics, yes. But there’s got to be a moment when social robotics starts making real money. Meaning a Spot type robot in the home and there’s tens of millions of them in the home and they’re, I don’t know, how many dogs there are in the United States as pets."
  },
  {
    "start": 674,
    "end": 675,
    "speaker": "Marc Raibert",
    "timestamp": "(01:32:34)",
    "text": "Many."
  },
  {
    "start": 676,
    "end": 677,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:35)",
    "text": "It feels there’s something we love about having a intelligent companion with us that remembers us, that’s excited to see us. All that stuff."
  },
  {
    "start": 678,
    "end": 679,
    "speaker": "Marc Raibert",
    "timestamp": "(01:32:44)",
    "text": "But it’s also true that the companies making those things, there’ve been a lot of failures in recent times. There’s that one year when I think three of them went under. So it’s not that easy to do that. Getting performance, safety and cost all to be where they need to be at the same time, that’s hard."
  },
  {
    "start": 680,
    "end": 681,
    "speaker": "Lex Fridman",
    "timestamp": "(01:33:07)",
    "text": "But also some of it is, like you say, you can have a product but people might not be aware of it. So also part of it is the videos or however you connect with the public, the culture and create the category. Make people realize this is the thing you want. There’s a lot of negative perceptions you can have. Do you really want a system with the camera in your home walking around? If it’s presented correctly and if there’s the right boundaries around it and you understand how it works and so on, a lot of people would want to. And if they don’t, they might be suspicious of it. So that’s an important one. We all use smartphones and that has a camera that’s looking at us."
  },
  {
    "start": 682,
    "end": 683,
    "speaker": "Marc Raibert",
    "timestamp": "(01:33:49)",
    "text": "It has two or three or four."
  },
  {
    "start": 684,
    "end": 685,
    "speaker": "Lex Fridman",
    "timestamp": "(01:33:50)",
    "text": "And it’s listening. Very few people are suspicious about it. They take it for granted and so on. And I think robots would be the same way."
  },
  {
    "start": 686,
    "end": 687,
    "speaker": "Marc Raibert",
    "timestamp": "(01:34:00)",
    "text": "I agree."
  },
  {
    "start": 688,
    "end": 689,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:02)",
    "text": "So as you work on the cognitive aspect of these robots, do you think we’ll ever get to human level or superhuman level intelligence? There’s been a lot of conversations about this recently, given the rapid development in large language models."
  },
  {
    "start": 690,
    "end": 691,
    "speaker": "Marc Raibert",
    "timestamp": "(01:34:21)",
    "text": "I think that intelligence is a lot of different things and I think some things, computers are already smarter than people, and some things they’re not even close. And I think you’d need a menu of detailed categories to come up with that. But I also think that the conversation that seems to be happening about AGI’s puzzles me. So I ask you a question, do you think there’s anybody smarter than you in the world?"
  },
  {
    "start": 692,
    "end": 693,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:55)",
    "text": "Absolutely, yes."
  },
  {
    "start": 694,
    "end": 695,
    "speaker": "Marc Raibert",
    "timestamp": "(01:34:57)",
    "text": "Do you find that threatening?"
  },
  {
    "start": 696,
    "end": 697,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:58)",
    "text": "No."
  },
  {
    "start": 698,
    "end": 699,
    "speaker": "Marc Raibert",
    "timestamp": "(01:34:59)",
    "text": "So I don’t understand, even if computers were smarter than people, why we should assume that that’s a threat, especially since they could easily be smarter but still available to us or under our control, which is basically how computers generally are."
  },
  {
    "start": 700,
    "end": 701,
    "speaker": "Lex Fridman",
    "timestamp": "(01:35:17)",
    "text": "I think the fear is that they would be 10x or 100x smarter and operating under different morals and ethical codes than humans naturally do, and so almost become misaligned in unintended ways and therefore harm humans in ways we just can’t predict. And even if we program them to do a thing, on the way of doing that thing, they would cause a lot of harm. And when they’re 100 times, 1,000 times, 10,000 times smarter than us, we won’t be able to stop it or we won’t be able to even see the harm as it’s happening until it’s too late. That stuff. So you can construct all possible trajectories of how the world ends because of super intelligent systems."
  },
  {
    "start": 702,
    "end": 703,
    "speaker": "Marc Raibert",
    "timestamp": "(01:36:05)",
    "text": "It’s a little bit like that line in the Oppenheimer movie where they contemplate whether the first time they set off a reaction, all matter on earth is going to go up. I don’t remember what the verb they used was for the chain reaction. I guess it’s possible, but I personally don’t think it’s worth worrying about that. I think that it’s balancing opportunities and risk. I think if you take any technology, there’s opportunity and risk. I’ll point at the car. They pollute and about what? 1.25 million people get killed every year around the world because of them. Despite that, I think they’re a boon to humankind, they’re very useful, many of us love them and those technical problems can be solved. I think they’re becoming safer. I think they’re becoming less polluting, at least some of them are. And every technology you can name has a story like that in my opinion."
  },
  {
    "start": 704,
    "end": 705,
    "speaker": "Lex Fridman",
    "timestamp": "(01:37:20)",
    "text": "What’s the story behind the Hawaiian shirt? Is it a fashion statement, a philosophical statement? Is it just a statement of rebellion? Engineering statement?"
  },
  {
    "start": 706,
    "end": 707,
    "speaker": "Marc Raibert",
    "timestamp": "(01:37:31)",
    "text": "It was born of me being a contrarian."
  },
  {
    "start": 708,
    "end": 709,
    "speaker": "Lex Fridman",
    "timestamp": "(01:37:35)",
    "text": "It’s a symbol."
  },
  {
    "start": 710,
    "end": 711,
    "speaker": "Marc Raibert",
    "timestamp": "(01:37:36)",
    "text": "Someone told me once that I was wearing one when I only had one or two and they said, “Those things are so old-fashioned. You can’t wear that, Marc.” And I stopped wearing them for about a week and then I said, “I’m not going to let them tell me what to do.” And so every day since, pretty much."
  },
  {
    "start": 712,
    "end": 713,
    "speaker": "Lex Fridman",
    "timestamp": "(01:37:55)",
    "text": "So it’s a symbol."
  },
  {
    "start": 714,
    "end": 715,
    "speaker": "Marc Raibert",
    "timestamp": "(01:37:56)",
    "text": "That was years ago. That was 20 years ago. 15 years ago probably."
  },
  {
    "start": 716,
    "end": 717,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:00)",
    "text": "That says something about your personality. That’s great."
  },
  {
    "start": 718,
    "end": 719,
    "speaker": "Marc Raibert",
    "timestamp": "(01:38:04)",
    "text": "It took me a while to realize that I was a contrarian, but it can be a useful tool."
  },
  {
    "start": 720,
    "end": 721,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:10)",
    "text": "Have you had people tell you on the robotics side that, “I don’t think you could do this”? A negative motivation?"
  },
  {
    "start": 722,
    "end": 723,
    "speaker": "Marc Raibert",
    "timestamp": "(01:38:21)",
    "text": "I’d rather talk about, when we were doing a lot of DARPA work, there was a Marine, Ed Tovar, who’s still around. What he would always say is when someone would say, “You can’t do that.” He’d say, “Why not?” And it’s a great question. I ask all the time when I’m thinking, “We’re not going to do that nice thing.” “Why not?” And I give him credit for opening my eyes to resisting that."
  },
  {
    "start": 724,
    "end": 725,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:50)",
    "text": "So the Hawaiian shirt is almost a symbol of “why not?” Okay. What advice would you give to young folks that are trying to figure out what they want to do with their life? How to have a life they can be proud of? How they can have a career they can be proud of?"
  },
  {
    "start": 726,
    "end": 727,
    "speaker": "Marc Raibert",
    "timestamp": "(01:39:06)",
    "text": "When I was teaching at MIT, for a while, I had undergraduate advisees where people would have to meet with me once a semester or something and they frequently would ask what they should do. And I think the advice I used to give was something like, “Well, if you had no constraints on you, no resource constraints, no opportunity constraints and no skill constraints, what could you imagine doing?” And I said, “Well, start there and see how close you can get to what’s realistic for how close you can get.” The other version of that is try and figure out what you want to do and do that. A lot of people think that they’re in a channel and there’s only limited opportunities, but it’s usually wider than they think."
  },
  {
    "start": 728,
    "end": 729,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:57)",
    "text": "The opportunities really are limitless. But at the same time, you want to pick a thing and it’s the diligence and really, really pursue it. And really pursue it. Because sometimes the really special stuff happens after years of pursuit."
  },
  {
    "start": 730,
    "end": 731,
    "speaker": "Marc Raibert",
    "timestamp": "(01:40:18)",
    "text": "Yeah. Oh, absolutely. It can take a while."
  },
  {
    "start": 732,
    "end": 733,
    "speaker": "Lex Fridman",
    "timestamp": "(01:40:21)",
    "text": "I mean, you’ve been doing this for 40 plus years."
  },
  {
    "start": 734,
    "end": 735,
    "speaker": "Marc Raibert",
    "timestamp": "(01:40:24)",
    "text": "Some people think I’m in a rut. And in fact, some of the inspiration for the AI Institute is to say, “I’ve been working on locomotion for however many years it was, let’s do something else.” And it’s a really fascinating and interesting challenge."
  },
  {
    "start": 736,
    "end": 737,
    "speaker": "Lex Fridman",
    "timestamp": "(01:40:44)",
    "text": "And you’re hoping to show it off also in the same way it has been done with Boston Dynamics?"
  },
  {
    "start": 738,
    "end": 739,
    "speaker": "Marc Raibert",
    "timestamp": "(01:40:48)",
    "text": "Just about to start showing some stuff off. I hope we have a YouTube channel. I mean one of the challenges is, it’s one thing to show athletic skills on YouTube. Showing cognitive function is a lot harder, and I haven’t quite figured out yet how that’s going to work."
  },
  {
    "start": 740,
    "end": 741,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:06)",
    "text": "There might be a way."
  },
  {
    "start": 742,
    "end": 743,
    "speaker": "Marc Raibert",
    "timestamp": "(01:41:07)",
    "text": "There’s a way."
  },
  {
    "start": 744,
    "end": 745,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:08)",
    "text": "There’s a way."
  },
  {
    "start": 746,
    "end": 747,
    "speaker": "Marc Raibert",
    "timestamp": "(01:41:09)",
    "text": "Why not?"
  },
  {
    "start": 748,
    "end": 749,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:10)",
    "text": "I also do think sucking at a task is also compelling. The incremental improvement. A robot being really terrible at a task and then slowly becoming better. Even in athletic intelligence, honestly. Learning to walk and falling and slowly figuring that out, I think there’s something extremely compelling about that. We like flaws, especially with the cognitive task. It’s okay to be clumsy. It’s okay to be confused and a little silly and all that stuff. It feels like in that space is where we can-"
  },
  {
    "start": 750,
    "end": 751,
    "speaker": "Marc Raibert",
    "timestamp": "(01:41:45)",
    "text": "There’s charm."
  },
  {
    "start": 752,
    "end": 753,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:46)",
    "text": "… There’s charm and there’s something inspiring about a robot sucking and then becoming less terrible slowly at a task."
  },
  {
    "start": 754,
    "end": 755,
    "speaker": "Marc Raibert",
    "timestamp": "(01:41:57)",
    "text": "No, I think you’re right."
  },
  {
    "start": 756,
    "end": 757,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:58)",
    "text": "That reveals something about ourselves. Ultimately, that’s what’s one of the coolest things about robots, is it’s a mirror about what makes humans special. Just by watching how hard it is to make a robot do the things that humans do. You realize how special we are. What do you think is the meaning of this whole thing? Why are we here? Marc, do you ever ask about the big questions as you try to create these humanoid, human-like intelligence systems?"
  },
  {
    "start": 758,
    "end": 759,
    "speaker": "Marc Raibert",
    "timestamp": "(01:42:32)",
    "text": "I don’t know. I think you have to have fun while you’re here. That’s about all I know. It would be a waste not to."
  },
  {
    "start": 760,
    "end": 761,
    "speaker": "Lex Fridman",
    "timestamp": "(01:42:40)",
    "text": "The ride is pretty short, so might as well have fun. Marc, I’m a huge fan of yours. It’s a huge honor that you would talk with me. This is really amazing and your work for many decades has been amazing and I can’t wait to see what you do at the AI Institute. I’m going to be waiting impatiently for the videos and the demos and the next robot meetup for maybe Atlas and Optimus to hang out."
  },
  {
    "start": 762,
    "end": 763,
    "speaker": "Marc Raibert",
    "timestamp": "(01:43:07)",
    "text": "I would love to do that. That would be fun."
  },
  {
    "start": 764,
    "end": 765,
    "speaker": "Lex Fridman",
    "timestamp": "(01:43:09)",
    "text": "Thank you so much for talking."
  },
  {
    "start": 766,
    "end": 767,
    "speaker": "Marc Raibert",
    "timestamp": "(01:43:10)",
    "text": "Thank you. It was fun talking to you."
  },
  {
    "start": 768,
    "end": 769,
    "speaker": "Lex Fridman",
    "timestamp": "(01:43:13)",
    "text": "Thanks for listening to this conversation with Marc Raibert. To support this podcast, please check out our sponsors in the description. And now let me leave you with some words from Arthur C. Clark. “Whether we’re based on carbon or on silken makes no fundamental difference. We should each be treated with appropriate respect.” Thank you for listening and hope to see you next time."
  }
]