[
  {
    "start": 0,
    "end": 1,
    "speaker": "Neil Adams",
    "timestamp": "(00:00:00)",
    "text": "When we go to the dojos there, we all get thrown by people that never come out to be world champions. They’re just in the mix or they’re going through three years of university and then they go. We had a guy, we had a guy that came in. He was business guy, came in with his suitcase in his tie up like that. And he’s in his lunch hour. He’s in his lunch hour, right? So it’s got to be quick."
  },
  {
    "start": 2,
    "end": 3,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:22)",
    "text": "Yeah."
  },
  {
    "start": 4,
    "end": 5,
    "speaker": "Neil Adams",
    "timestamp": "(00:00:24)",
    "text": "So he comes in and he goes through, he’s working his way through the whole of the British team. We’re all lined out, right? 10 minutes later, he’s tying his tie up like that. And back to work like that. Imagine him sitting behind his desk and his computer."
  },
  {
    "start": 6,
    "end": 7,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:39)",
    "text": "Yeah, yeah."
  },
  {
    "start": 8,
    "end": 9,
    "speaker": "Neil Adams",
    "timestamp": "(00:00:41)",
    "text": "I’m glad he didn’t get out."
  },
  {
    "start": 10,
    "end": 11,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:44)",
    "text": "Who do you think wins, Yamashita?"
  },
  {
    "start": 12,
    "end": 13,
    "speaker": "Neil Adams",
    "timestamp": "(00:00:44)",
    "text": "I think Yamashita. But I…"
  },
  {
    "start": 14,
    "end": 15,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:45)",
    "text": "Wait, you think Yamashita beats [inaudible 00:00:46]?"
  },
  {
    "start": 16,
    "end": 17,
    "speaker": "Neil Adams",
    "timestamp": "(00:00:46)",
    "text": "I think so."
  },
  {
    "start": 18,
    "end": 19,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:53)",
    "text": "Strong words."
  },
  {
    "start": 20,
    "end": 21,
    "speaker": "",
    "timestamp": "(00:00:58)",
    "text": "The following is a conversation with Neil Adams, a legend in the sport of judo. He is a world champion, two-time Olympic silver medalist, five-time European champion, and often referred to as the voice of judo commentating all the major events, world championships and Olympic Games. Highlighting the drama, the triumph, the artistry of the sport of judo. Making fans like me feel the biggest wins, the biggest losses, the surprise turns of fortune, the dominance of champions coming to an end and new champions made. Always speaking from the heart. This is the Lex Friedman podcast. To support it please check out our sponsors in the description. And now, dear friends, here’s Neil Adams."
  },
  {
    "start": 22,
    "end": 23,
    "speaker": "",
    "timestamp": "(00:01:47)",
    "text": "You are a five-time European champion, world champion two-time Olympic silver medalist. Let’s first go to the 1980 Olympics. Where was your mind? What was your preparation like? What was your strategy leading into that Olympics?"
  },
  {
    "start": 24,
    "end": 25,
    "speaker": "Neil Adams",
    "timestamp": "(00:02:01)",
    "text": "That was my first Olympic Games. So my preparation was a little bit different to how it was the ’84 and the ’88 Olympic Games. And I’d kind of done part of the preparation as well for ’76 Olympic Games. I wasn’t quite old enough for those, but I was first reserve. So in 1980 I’d had four years build up and I was hungry and I was one of these young athletes and I see them so often now that was developing and full of, I won’t say I was full of myself, but I was certainly confident of my ability and I wanted to conquer the world. And I’d had a couple of really tight matches with the current Olympic world champion. So I knew that there was a possibility that I could get there for the ’80 Olympics."
  },
  {
    "start": 26,
    "end": 27,
    "speaker": "",
    "timestamp": "(00:02:54)",
    "text": "So building up to the ’80 Olympics was quite interesting because I was kind of coming through the weights and I was halfway in between the 71 kilos weight category and the higher weight category of 78 kilograms. And I got third place at the ’79 world championships, the weight below. Fought the whole year at the higher weight category, didn’t lose a contest. So I’d beaten everybody in the world. And then I had to make the decision as to whether to drop to the weight below because I was seeding in the weight below. It was a different seeding then. And so I decided to drop into the weight below because I was seeded in the top four. And as it happens, I think it was probably the worst decision I made."
  },
  {
    "start": 28,
    "end": 29,
    "speaker": "",
    "timestamp": "(00:03:48)",
    "text": "Well because…"
  },
  {
    "start": 30,
    "end": 31,
    "speaker": "Lex Fridman",
    "timestamp": "(00:03:49)",
    "text": "Well…"
  },
  {
    "start": 32,
    "end": 33,
    "speaker": "Neil Adams",
    "timestamp": "(00:03:50)",
    "text": "Simply because, I mean, it was the only contest that I lost was the final of the Olympic Games in that year."
  },
  {
    "start": 34,
    "end": 35,
    "speaker": "Lex Fridman",
    "timestamp": "(00:03:55)",
    "text": "So you’re a young kid, what? Like 19-20 at that time full of confidence, vigor. So the decision to cut weight, how hard was it for you to cut weight to the 71 kg division?"
  },
  {
    "start": 36,
    "end": 37,
    "speaker": "Neil Adams",
    "timestamp": "(00:04:08)",
    "text": "I’ve got to say that it was the hardest because as I was going up, it was 73, then it was 74 kilos, 75. So I was moving through the weight category. It wasn’t like I was stuck in the middle and then I dropped the odd time to compete. It was literally going up in weight by a kilo every month. And then by the time I came to a month or two before the Olympics, it was really hard. Fought the European Championships at the higher weight category and won that. And so everybody that was on the Olympic rostrum at the Olympic Games was my rostrum at the European championships."
  },
  {
    "start": 38,
    "end": 39,
    "speaker": "",
    "timestamp": "(00:04:52)",
    "text": "So was it a mistake? Yeah, because I didn’t have my diet sorted out. My nutrition was appalling and when I, it wasn’t as kind of readily available as it is now for the nutrition. And I would say that if anything lost me that final, other than the fact that I was fighting somebody was terrific. He was an excellent, brilliant athlete, but definitely didn’t help that my nutrition was not very good."
  },
  {
    "start": 40,
    "end": 41,
    "speaker": "Lex Fridman",
    "timestamp": "(00:05:22)",
    "text": "Okay, so you lost to Ezio Gamba. There’s probably a lot of that we could say about that particular match. Maybe let’s zoom in. What were your strengths and weaknesses, judo-wise in that Olympics? You said you haven’t really lost the match, you won the European Championship leading into it, but if you had weak spots, okay, you already said diet, but specifically on the mat in terms of judo."
  },
  {
    "start": 42,
    "end": 43,
    "speaker": "Neil Adams",
    "timestamp": "(00:05:46)",
    "text": "I think that none of the fights lasted time going into the final. So I won fairly quickly and every match by ippon way before time."
  },
  {
    "start": 44,
    "end": 45,
    "speaker": "Lex Fridman",
    "timestamp": "(00:05:58)",
    "text": "Do you remember how you won the matches?"
  },
  {
    "start": 46,
    "end": 47,
    "speaker": "Neil Adams",
    "timestamp": "(00:06:00)",
    "text": "I won them by throw, a couple of throws for ippon and then an armlock for ippon. Semi-final was an armlock against the East German Kruger. And yeah, I was flying through."
  },
  {
    "start": 48,
    "end": 49,
    "speaker": "Lex Fridman",
    "timestamp": "(00:06:13)",
    "text": "What were the throws? Do you remember?"
  },
  {
    "start": 50,
    "end": 51,
    "speaker": "Neil Adams",
    "timestamp": "(00:06:15)",
    "text": "Tai otoshi, uchi mata. My favorite kind of te-waza, my favorite throws. And then Juji-Gatame as well, which was a Juji-Gatame roll. Against an East German who I’d beaten before but always had a really tough match, but managed to beat him well."
  },
  {
    "start": 52,
    "end": 53,
    "speaker": "Lex Fridman",
    "timestamp": "(00:06:34)",
    "text": "So you had a beautiful exhibition of Japanese-type Judo in the first two matches. You threw people and then you also did the [inaudible 00:06:43], unbarred a person. Great. So going into the final, what are the weaknesses going into the final against the Italian?"
  },
  {
    "start": 54,
    "end": 55,
    "speaker": "Neil Adams",
    "timestamp": "(00:06:49)",
    "text": "Like I say, taking nothing away from him as a great athlete and a brilliant Judo man and left, which wasn’t good for me. That was definite no, I hated fighting leftys, still do, but I’ll tell you why in a minute. I just did…"
  },
  {
    "start": 56,
    "end": 57,
    "speaker": "Lex Fridman",
    "timestamp": "(00:07:05)",
    "text": "That’s great."
  },
  {
    "start": 58,
    "end": 59,
    "speaker": "Neil Adams",
    "timestamp": "(00:07:05)",
    "text": "It’s one of those. But I think as I went through the contest, we had an eight-hour break from the semi-final to the final. They took us back to the Olympic village, then we had to come back in and then we had to start a warmup again. So I kind of lost my momentum, I had to start again, and I just had a job to get going. I got halfway through, started to rescue a dying match, and I was kind of one step, half a step behind all the way through. So never really got into it."
  },
  {
    "start": 60,
    "end": 61,
    "speaker": "Lex Fridman",
    "timestamp": "(00:07:39)",
    "text": "So why do you hate fighting leftys? And leftys are, we should say, overrepresented in terms of the higher ranks of Judo. I don’t know why that is."
  },
  {
    "start": 62,
    "end": 63,
    "speaker": "Neil Adams",
    "timestamp": "(00:07:50)",
    "text": "Well, the thing is about a lefty is a lefty will have more opportunity to fight rightys, right-handers. I mean 70% of the population are right-handers, 30% left. So they get to fight more right-handers and it’s just a fact that happens. So the thing that they hate is fighting left against left. They don’t like it left against left. Whereas a right-hander will go right against right, but the opposite is awkward would for me because just simply, I like to go onto the sleeve and then I like to dominate the grips, but the actual angle of the opponent wasn’t what I wanted, so I had to work hard, really hard against it."
  },
  {
    "start": 64,
    "end": 65,
    "speaker": "Lex Fridman",
    "timestamp": "(00:08:41)",
    "text": "What happened in that match?"
  },
  {
    "start": 66,
    "end": 67,
    "speaker": "Neil Adams",
    "timestamp": "(00:08:43)",
    "text": "It was a split decision in the end. And so to lose an Olympic final on a split decision is pretty, it’s something that’s still on my mind. And I think that it’s a strange one because I can still wake up, that one and four years later at the Olympics, I was silver medalist at the Olympics four years later as well. And yeah, it still haunts me."
  },
  {
    "start": 68,
    "end": 69,
    "speaker": "Lex Fridman",
    "timestamp": "(00:09:10)",
    "text": "Do you sometimes wake up and think like, “Eh, I should have eaten better” or maybe a specific grip that you’re like, “Ah, I shouldn’t have taken that grip.”?"
  },
  {
    "start": 70,
    "end": 71,
    "speaker": "Neil Adams",
    "timestamp": "(00:09:19)",
    "text": "I do. I mean the diet side of it, its difficult to really admit that, isn’t it that you went to an Olympic Games and the one thing that you really sucked at, right, was one of the most important things now at world level sport. Where you’ve got the nutrition, we’ve got it, you would think that most people have got it sorted, but there’s still people making mistakes and still people that haven’t got it totally sorted."
  },
  {
    "start": 72,
    "end": 73,
    "speaker": "Lex Fridman",
    "timestamp": "(00:09:48)",
    "text": "And then there’s people like Travis Stevens who I think doesn’t care. He’ll just have atrocious nutrition and he just makes it work. I think the way he spoke about it is you can’t always control nutrition, so it’s best to get good at having crappy nutrition."
  },
  {
    "start": 74,
    "end": 75,
    "speaker": "Neil Adams",
    "timestamp": "(00:10:06)",
    "text": "That’s a good way of looking at it. I never, yeah, maybe that’s what I did."
  },
  {
    "start": 76,
    "end": 77,
    "speaker": "Lex Fridman",
    "timestamp": "(00:10:11)",
    "text": "Exactly, exactly. Do you remember what you were eating? Are we talking about candy or?"
  },
  {
    "start": 78,
    "end": 79,
    "speaker": "Neil Adams",
    "timestamp": "(00:10:15)",
    "text": "Yeah, well I got a sweet tooth, but it wasn’t really, I mean, I didn’t have a lot of money at that particular time either. So the diet wasn’t steak and good nutritional salads and things like that. I did what I thought was best without proper advice. And the crazy thing is that I had such good advice as well when it came to fitness training and things like that. We’re quite ahead of our time and we really had it nailed as far as the conditioning was concerned, the judo training as well was way in advance. I was a good trainer and I trained more than most. I can honestly say that. It probably got me away with a lot."
  },
  {
    "start": 80,
    "end": 81,
    "speaker": "Lex Fridman",
    "timestamp": "(00:11:01)",
    "text": "Where was your mind? So mental preparation going into that Olympics, you said you were confident, but is there some preparation aspect behind that confidence?"
  },
  {
    "start": 82,
    "end": 83,
    "speaker": "Neil Adams",
    "timestamp": "(00:11:11)",
    "text": "I think in the early days I didn’t think I was going to lose. I never thought it was possible to lose. And I think that I went into every contest expecting to win. So when it didn’t quite go my way, I didn’t lose that many contests. So the only ones I lost were in the final of the world championships or in the final of the Olympic Games. I didn’t lose that many. I never lost a European title. I had seven golds at European championships, five at seniors, two at juniors under twenties. I never lost a final. And then I only lost two on a split decision. So I didn’t lose that many. And my attitude was that I wasn’t going to lose and couldn’t lose. So I was always surprised when I did, when something happened."
  },
  {
    "start": 84,
    "end": 85,
    "speaker": "Lex Fridman",
    "timestamp": "(00:12:00)",
    "text": "In Neil Adams, A Life in Judo, written in 1986. You wrote, “Ever since I can remember I have wanted to win. It wasn’t the ordinary feeling that children have when they take part in their first primary school sack race on a grass track or even the keen determination of a young swimmer prepared to train early in the cold winter mornings in order to make it into the county side. With me, the desire to win was and still is as much a part of me as my arms and legs. In other words, it wasn’t something I learned as I grew older, but rather it was deeply rooted in me. Perhaps this competitive instinct is the greatest difference between my public image and the view from the inside.”"
  },
  {
    "start": 86,
    "end": 87,
    "speaker": "",
    "timestamp": "(00:12:47)",
    "text": "So people see the kindness, the warmth you have the charisma of the excitement, but there’s this big drive to win inside you. So what’s behind that? Can you just speak to that, that drive to win and how that contributed to your career?"
  },
  {
    "start": 88,
    "end": 89,
    "speaker": "Neil Adams",
    "timestamp": "(00:13:05)",
    "text": "Do you know when I look back now…"
  },
  {
    "start": 90,
    "end": 91,
    "speaker": "Lex Fridman",
    "timestamp": "(00:13:08)",
    "text": "This is a lot of years ago, we should say."
  },
  {
    "start": 92,
    "end": 93,
    "speaker": "Neil Adams",
    "timestamp": "(00:13:09)",
    "text": "It is a lot of years ago."
  },
  {
    "start": 94,
    "end": 95,
    "speaker": "Lex Fridman",
    "timestamp": "(00:13:11)",
    "text": "Is that true or were you just being poetic?"
  },
  {
    "start": 96,
    "end": 97,
    "speaker": "Neil Adams",
    "timestamp": "(00:13:12)",
    "text": "It’s not far off. No. When I think about it now, I’d like to think that I’m a different person now. And since I’ve kind of calmed down, I see athletes now and I see them and their kind of arrogance, their walk, and it’s a strut and it’s a kind of a confidence, isn’t it? As we’re older and as I’ve become older, I’ve calmed down, but it doesn’t matter what I’m doing, it’s still that will to win. And I’m much better at masking it now if I don’t. But it still bothers me as much."
  },
  {
    "start": 98,
    "end": 99,
    "speaker": "Lex Fridman",
    "timestamp": "(00:13:53)",
    "text": "You’re talking about like… I don’t know, even just stupid, silly things. Like I don’t know, a game of pool or something like this or just anything."
  },
  {
    "start": 100,
    "end": 101,
    "speaker": "Neil Adams",
    "timestamp": "(00:14:00)",
    "text": "Yeah, I’m still trying to win. Like my son loves to… He loves to play me at bowls because I’m useless and I just can’t throw a straight bowl. So he loves playing me at that, but it bugs me that I’m not better and there are certain things that I do. It really bugs me when I’m not good at it. And I guess it’s one of the reasons that long after I’d finished competition judo, people still want to train with you. And even at an older age, even now if I do in a seminar or they’d still, “Do you still do? Do you want to still go? And can I feel it?”"
  },
  {
    "start": 102,
    "end": 103,
    "speaker": "",
    "timestamp": "(00:14:44)",
    "text": "And one of the things that’s in me is that I just all the way up to 40 years of age, so from 30 when I finished competition up to 40, I could still train with the best and I could still go with anybody. And then when 40 hit, kind of things started to fall off a little bit and I used to get either my hips or the legs and my knees. And I realized that I had to pick my practices and that rankled as well and I had to then just calm it down a little bit, otherwise I was going to be injured and I was going to be… It’s not a good thing when you getting older and you’ve still got the same competitive mind, but things change."
  },
  {
    "start": 104,
    "end": 105,
    "speaker": "Lex Fridman",
    "timestamp": "(00:15:26)",
    "text": "So it’s still there. You get on the mat probably even now, right? You get on the mat with a world champion, you still the current world champion, there’s still a little part of you. Could I still toss this guy?"
  },
  {
    "start": 106,
    "end": 107,
    "speaker": "Neil Adams",
    "timestamp": "(00:15:38)",
    "text": "But you know…"
  },
  {
    "start": 108,
    "end": 109,
    "speaker": "Lex Fridman",
    "timestamp": "(00:15:38)",
    "text": "Kids these days are soft."
  },
  {
    "start": 110,
    "end": 111,
    "speaker": "Neil Adams",
    "timestamp": "(00:15:41)",
    "text": "Well, you know what, some of these athletes, I mean I give you a prime example, right? Is Ilias Iliadis. He is a monster, right? And of course you couldn’t because just at sixty-something you couldn’t, but you like to think that you could."
  },
  {
    "start": 112,
    "end": 113,
    "speaker": "Lex Fridman",
    "timestamp": "(00:16:02)",
    "text": "You could, you never know. You got to find out."
  },
  {
    "start": 114,
    "end": 115,
    "speaker": "Neil Adams",
    "timestamp": "(00:16:03)",
    "text": "You know what you would do. What you can do is you can cause them problems and they feel it immediately. But you’d last a minute."
  },
  {
    "start": 116,
    "end": 117,
    "speaker": "Lex Fridman",
    "timestamp": "(00:16:11)",
    "text": "So you’ve trained with Ilias Iliadis, I’ve gotten a chance to train with him as well. He’s a really nice guy, really great."
  },
  {
    "start": 118,
    "end": 119,
    "speaker": "Neil Adams",
    "timestamp": "(00:16:16)",
    "text": "Great guy. He trained with me. We were training together every hotel that we used to go into, we’d end up in the gym together and we’d train. And this one time he was in there and he just wanted somebody to grab and grip hold of. And so we ended up doing this kind of grappling in the middle, the people doing weight training and the different things watching these two mad men doing… I’m glad we weren’t on a mat at that particular time. But good fun."
  },
  {
    "start": 120,
    "end": 121,
    "speaker": "Lex Fridman",
    "timestamp": "(00:16:43)",
    "text": "What do you think about that guy? He like you achieved a lot of success when he was young."
  },
  {
    "start": 122,
    "end": 123,
    "speaker": "Neil Adams",
    "timestamp": "(00:16:49)",
    "text": "17, can you imagine that? 17, 18 years of age and he’s able to compete with the men. There’s not many men can do that. And it doesn’t happen very often. It happens later with the men and often they’re not physically as developed as they… So for me, for example, I fought Nevzorov who was world Olympic champion. He was the current world Olympic champion, and they sent me to the European Championship senior at 17 and that doesn’t happen very often. And I fought, I pulled Nevzorov, I fought Nevzorov and I had him really worried because he expected without a doubt, to come out, throw this kid and junior."
  },
  {
    "start": 124,
    "end": 125,
    "speaker": "Lex Fridman",
    "timestamp": "(00:17:33)",
    "text": "And he was thick and shredded. [inaudible 00:17:36] he’s a man."
  },
  {
    "start": 126,
    "end": 127,
    "speaker": "Neil Adams",
    "timestamp": "(00:17:36)",
    "text": "He was shredded. There’s a picture of him in his judogi and his judogi is just cut and he looks the business. And there’s me in this baggy…"
  },
  {
    "start": 128,
    "end": 129,
    "speaker": "Lex Fridman",
    "timestamp": "(00:17:46)",
    "text": "Skinny kid."
  },
  {
    "start": 130,
    "end": 131,
    "speaker": "Neil Adams",
    "timestamp": "(00:17:49)",
    "text": "Skinny kid inside this baggy thing. And the thing was is that the more he tried and the harder he tried, and the more he panicked, the further it went away from him. And so of course he got the decision at the end and deservedly, but I worried him. And so for me that was a massive step forward because year later I was starting to fill out and two years later I was competing for the Olympic title."
  },
  {
    "start": 132,
    "end": 133,
    "speaker": "Lex Fridman",
    "timestamp": "(00:18:24)",
    "text": "I don’t know if I remember, but Ilias Iliadis is interesting because even at 17 I feel like he was doing big throws, like literally lifting them with the hips."
  },
  {
    "start": 134,
    "end": 135,
    "speaker": "Neil Adams",
    "timestamp": "(00:18:34)",
    "text": "Just rips them out the ground. And I was saying to Nikki, my wife, and she said, “What would you do now? It was different than the way you did then.” I never had any pickups. That’s not what we did. But you have a look at the young Ukrainians or the young Russians or the young Eastern Bloc Mongolians and they’re ripping people out the ground. I mean it’s just different style of judo and it just looks different. But now they’re starting to do traditional style judo as well."
  },
  {
    "start": 136,
    "end": 137,
    "speaker": "Lex Fridman",
    "timestamp": "(00:19:09)",
    "text": "So can you speak to that? What are the different styles of judo? So for you, you mentioned uchi mata, tai otoshi, these… How would you describe them? They’re like these effortless, less lifting off the ground and power and strength and more timing and position, movement, momentum, all this kind of stuff. That’s more traditionally associated with Japanese judo because for Japanese judo, the traditional judo, you’re supposed to throw people in a big way without much effort."
  },
  {
    "start": 138,
    "end": 139,
    "speaker": "Neil Adams",
    "timestamp": "(00:19:40)",
    "text": "And of course, 1990 we saw the introduction of all these Eastern Bloc countries. There were so many more, I mean it was Soviet Union when I was competing. And then of course in 1990 everything changed. And then there were so many more of them out there, different countries, their wrestling styles were introduced into judo. Put a jacket on them and let’s get into judo."
  },
  {
    "start": 140,
    "end": 141,
    "speaker": "",
    "timestamp": "(00:20:08)",
    "text": "So judo kind of changed shape. It changed shape from this upright standing and having to know the technicalities of how to get a body that’s weighing 14 stone, or whatever it is, up into the air and using the momentum and the balance and the direction and the skill to do that and knowing how to do it and how to use movement. And then you get the wrestlers and the leg picks and the single leg, double legs. And by 1995 judo was bent over. And so it was the IOC that went to IJF, International Judo Federation. And they said, “You’ve got to change this, or we’re just going to have one wrestling style. It looks like wrestling with judo, with judo jackets on. “So you either change it or we are going to take one of you out.”"
  },
  {
    "start": 142,
    "end": 143,
    "speaker": "Lex Fridman",
    "timestamp": "(00:21:07)",
    "text": "By the way, we should sort of clarify when we say people are bent over, that’s usually how you see freestyle wrestling. Wrestlers are more bent over to defend the legs and so on. And traditional judo people are more standing up because that’s the position for which you can do the big throws and all that kind of stuff. But I think the other case to make for banding leg grabs is a lot of people are using it for stalling and not for beautiful big throws and all that kind of stuff. So it’s not just to make it different from wrestling, it is also like you want to maximize the amount of epic throws and dynamic judo and exciting stuff to watch, right?"
  },
  {
    "start": 144,
    "end": 145,
    "speaker": "Neil Adams",
    "timestamp": "(00:21:44)",
    "text": "Yeah. Win by judo, not by wrestling. And I think that the ones that were shouting about it were the wrestlers, right? Because they like to compete with both. They want to do both. They want to do their wrestling matches and then come into judo. So basically, I mean, what we’ve said is they learn to do judo and there’s nothing stopping you then from doing both, but not from the other way around. All right?"
  },
  {
    "start": 146,
    "end": 147,
    "speaker": "",
    "timestamp": "(00:22:10)",
    "text": "So rules always dictate development. They’ll always dictate which direction it goes. So if you introduce a rule that states that you cannot dive at the legs and just pick up, then you’ll have to do it standing up. And also it increases the possibility of defense with the hips. Because actually good defense, judo wise, standing up is with the hips as opposed to sticking your arms out and then sticking your backsides out there just to defend. All right, so if you attack me and I move my body in the wrong place, so I’m in the wrong place at the right time, so you don’t hit the right target. And then also I use my hips. So again, it’s a form of judo that was being lost. So now we’ve got it back."
  },
  {
    "start": 148,
    "end": 149,
    "speaker": "Lex Fridman",
    "timestamp": "(00:23:02)",
    "text": "So let’s go there. Let’s speak about judo as if we’re talking to a group of five-year-olds. So what is judo? What are some defining characteristics of judo as a sport, as a way, as a martial arts, a way of life, all that kind of stuff?"
  },
  {
    "start": 150,
    "end": 151,
    "speaker": "Neil Adams",
    "timestamp": "(00:23:18)",
    "text": "I think when you say it is a way of life, I mean I think the great advantage that we have in judo, my young grandson… So I got two little boys that are three and a half years of age, love going to our dojo. They love it. So dojo was the first word that they used. It was one of the first. So when they come see us, so seeing my wife and I, it’s like dojo. It’s not grandma granddad, it’s dojo. So dojo. They take their shoes off going into the dojo. So they have respect for where they’re at. I think it has that kind of feeling that I tried to build my dojo with a feeling of reverence. It’s kind of almost peaceful. I’m not a religious person, but I like going to old churches because when I go into an old church, it doesn’t matter what the religion within the church, but there’s a reverence in there."
  },
  {
    "start": 152,
    "end": 153,
    "speaker": "Lex Fridman",
    "timestamp": "(00:24:19)",
    "text": "Reverence is a good word. It feels like a really special place no matter which dojo you go to, it’s just you bow and there’s a calmness before the storm of battle or whatever it is."
  },
  {
    "start": 154,
    "end": 155,
    "speaker": "Neil Adams",
    "timestamp": "(00:24:32)",
    "text": "Yeah, and respect."
  },
  {
    "start": 156,
    "end": 157,
    "speaker": "Lex Fridman",
    "timestamp": "(00:24:32)",
    "text": "Yeah, respect."
  },
  {
    "start": 158,
    "end": 159,
    "speaker": "Neil Adams",
    "timestamp": "(00:24:33)",
    "text": "I mean, look at the respect. We were just talking about it just before we came on air. We were just saying that we very, very seldom do we have a situation where there is animosity other than them fighting. So I’m not saying that they don’t fight each other because sometimes it does turn into a brawl and at the end, two people bow off and show their respect. And one of the things, so a champion, I see people winning events and they’re good judokara, they’re excellent, they win world championships might even win the Olympic Games."
  },
  {
    "start": 160,
    "end": 161,
    "speaker": "",
    "timestamp": "(00:25:13)",
    "text": "But a great champion for me is somebody who does the right thing when they lose. So when you see them lose, that’s when you see the true them. And actually that was one of the biggest things that I had to really cope with. So when I lost that Olympic Games in Moscow and also the one in Los Angeles, the hardest thing is when the microphone’s in there and you’ve got to be respectful and nice and the hardest thing is to smile."
  },
  {
    "start": 162,
    "end": 163,
    "speaker": "",
    "timestamp": "(00:25:49)",
    "text": "But actually some of the great champions, they’ll go, “That’s just one match.” I remember, we’ve got one great champion, Agbegnenou, she’s a five-time world champion, Olympic champion. She’s favorite as well to get this Olympic gold medal. French. What a great champion she is because she lost one of the matches. I mean, she’d come back and she’d given birth, come back after giving birth and everybody was going, “Well, will she…?” And then she lost one of the matches on the way through and she said, “Well, don’t be upset. It’s just one match. It’s just one contest. Next time I’m going to put it right.” And she did put it right and now she’s back up there and she won the world title back. So these are great champions for me."
  },
  {
    "start": 164,
    "end": 165,
    "speaker": "Lex Fridman",
    "timestamp": "(00:26:44)",
    "text": "Yeah, I mean that’s the right way to see it. But it’s also tragic to lose the Olympic Games."
  },
  {
    "start": 166,
    "end": 167,
    "speaker": "Neil Adams",
    "timestamp": "(00:26:49)",
    "text": "Twice."
  },
  {
    "start": 168,
    "end": 169,
    "speaker": "",
    "timestamp": "(00:26:52)",
    "text": "Yes, it is tragic. And I do have sleepless nights."
  },
  {
    "start": 170,
    "end": 171,
    "speaker": "Lex Fridman",
    "timestamp": "(00:26:57)",
    "text": "I mean that’s the magic of the Olympic Games. Anything can happen. And your 1980 Olympics were very different from 1984, but if we just linger on ’80 and just what we’re talking about, how much you wanted to win, do you love winning or hate losing more?"
  },
  {
    "start": 172,
    "end": 173,
    "speaker": "Neil Adams",
    "timestamp": "(00:27:17)",
    "text": "I hate losing more, but I love winning. When I won the world title the year later, and I had no doubt when I went into that day that I was going to be world champion. No doubt."
  },
  {
    "start": 174,
    "end": 175,
    "speaker": "Lex Fridman",
    "timestamp": "(00:27:31)",
    "text": "So you won the ’81 World Championship."
  },
  {
    "start": 176,
    "end": 177,
    "speaker": "Neil Adams",
    "timestamp": "(00:27:34)",
    "text": "At the higher weight."
  },
  {
    "start": 178,
    "end": 179,
    "speaker": "Lex Fridman",
    "timestamp": "(00:27:36)",
    "text": "At the 78."
  },
  {
    "start": 180,
    "end": 181,
    "speaker": "Neil Adams",
    "timestamp": "(00:27:38)",
    "text": "Yes."
  },
  {
    "start": 182,
    "end": 183,
    "speaker": "Lex Fridman",
    "timestamp": "(00:27:38)",
    "text": "Kg. Actually, can we go there? What was going through your mind? You ended up arm barring a Japanese fighter. I talked to Jimmy Pedro, a friend of yours, somebody who said you were a mentor to him for many years, and he told me a bunch of different questions to ask you, but he said that was a really special time. That was a really special dominant run you had, and especially finishing with an arm bar against a Japanese player. So take me through that. What do you remember from that?"
  },
  {
    "start": 184,
    "end": 185,
    "speaker": "Neil Adams",
    "timestamp": "(00:28:16)",
    "text": "I think that it was, so my weight was better. I didn’t have to lose weight. That was one thing. So the nutritional side wasn’t as important, but probably it still wasn’t as good as it could be. My nutrition. Although it was getting better and I was trying to eat the right things at the right time, but I still trained really well and I was so confident that going into that world championships that I could win it. I had no doubt in my mind that I was going to win. But obviously the corner of your mind, you’re thinking just don’t make mistakes."
  },
  {
    "start": 186,
    "end": 187,
    "speaker": "",
    "timestamp": "(00:28:54)",
    "text": "But this is the incredible thing, is that once you start to ask you, once I see contests change direction when I’m commentating. So I can see somebody who’s in there just going forward trying to win. And that’s a difference to somebody who’s trying not to lose. And there’s two different ways there. So sometimes when you… When I was world champion then I had a period of time where every time I stepped out there I was really afraid of losing. And I think that that’s what happens later on in your competitive career."
  },
  {
    "start": 188,
    "end": 189,
    "speaker": "",
    "timestamp": "(00:29:33)",
    "text": "The great champions managed to come through that. Teddy Renair is one of those, he puts it out there and he keeps beating them so they can’t take it away from them. It’s fantastic."
  },
  {
    "start": 190,
    "end": 191,
    "speaker": "Lex Fridman",
    "timestamp": "(00:29:44)",
    "text": "So stepping on the mat, every single encounter you’re trying to win, you’re looking for the grips with the intention to throw big, even when you’re ahead on points and all that kind of stuff."
  },
  {
    "start": 192,
    "end": 193,
    "speaker": "Neil Adams",
    "timestamp": "(00:29:56)",
    "text": "That’s a really good point is that if you go ahead in a match and you look at the clock, it depends when you go ahead. So I sometimes…"
  },
  {
    "start": 194,
    "end": 195,
    "speaker": "Neil Adams",
    "timestamp": "(00:30:00)",
    "text": "… match. And you look at the clock, it depends when you go ahead. So sometimes you can go ahead in the first minute, and you’ve still got three minutes to go. So I see the ones then that go into, “I don’t want to lose”, because they go into defensive mode. And then sometimes they can lose it on penalties or something can go wrong, and the other one comes on strong and then they can sneak the contest. And so it’s really difficult. But when I was coaching, I was trying to always encourage that positive attitude for the full four minutes, five minutes then."
  },
  {
    "start": 196,
    "end": 197,
    "speaker": "Lex Fridman",
    "timestamp": "(00:30:33)",
    "text": "I’ve competed a lot in judo and jiu-jitsu. I’ve always hated that part of myself. When I’m up on points by a lot, you look at the clock and it’s what you do when you look at the clock, it’s a minute and a half, you’re really tired and you quit. You just defend. And I hated that part about myself. It’s like that-"
  },
  {
    "start": 198,
    "end": 199,
    "speaker": "Neil Adams",
    "timestamp": "(00:30:52)",
    "text": "It’s saying don’t do it. Yeah."
  },
  {
    "start": 200,
    "end": 201,
    "speaker": "Lex Fridman",
    "timestamp": "(00:30:53)",
    "text": "Yeah. Well as opposed to, in judo for a big throw, just keep going For the throw. In jiu-jitsu, it’s go for the submission, win in the real way, versus on points. I hated that part of myself. Mostly underneath that is cowardice induced by exhaustion."
  },
  {
    "start": 202,
    "end": 203,
    "speaker": "Neil Adams",
    "timestamp": "(00:31:13)",
    "text": "Exhaustion is the one, isn’t it? But it is, isn’t it? It’s a mindset as well. So actually trying to get your mind positive all the way through. So if you listen, when I commentated now is I say I hope that they don’t change the mindset. And they are going forward all the time. And actually they’re then more difficult to catch. We had one just a couple of weeks ago, and he lost in the final second of the contest. He was the only one to score. He got penalized all the way up. Two seconds to go and stepped out of the area. But he went like that, thinking the bell was just going. And the bell went one second after he actually stepped out. So he got penalized, lost the match and lost all of the points for qualification. So that’s paying high price. That’s paying high price."
  },
  {
    "start": 204,
    "end": 205,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:14)",
    "text": "Yeah. There’s a thin line between triumph and tragedy in those competitions. But especially at the Olympic games. So let’s just stick on ’81 World Championship. What did it feel like to win that world championship. And also getting an arm bar as a Japanese player? Jamie told me your arms were exhausted."
  },
  {
    "start": 206,
    "end": 207,
    "speaker": "Neil Adams",
    "timestamp": "(00:32:36)",
    "text": "Yeah, the thing is sometimes when it’s competitive as well, hours is a different intensity to jiu-jitsu, where you can take time a little bit. Hours is, bang, it’s transitioning from standing down. You’ve got 10, 15 seconds to go in there. You go in a hundred percent. It’s a bit like running full out for 10 seconds. And then you’ve got to decide then, especially if they’re defending it, whether you let it go. Because when you get up and your forearms are blown, and you’ve got lactic acid in there, and you’ve still got to grip up, because remember ours is about gripping as well on the jacket."
  },
  {
    "start": 208,
    "end": 209,
    "speaker": "",
    "timestamp": "(00:33:18)",
    "text": "So if you can’t grip up, then you can’t gain the advantage, then they can throw you. So you have to decide. So I had a massive attack on him and we changed directions four or five times, and then I wasn’t going to let him go. But still when I was turning him there, I had to decide am I going to go all out for this? There has been occasions when I’ve released it, just if I’ve got a minute to go and just block out."
  },
  {
    "start": 210,
    "end": 211,
    "speaker": "Lex Fridman",
    "timestamp": "(00:33:51)",
    "text": "Yeah. Correct. So what you’re saying on the feet, there is a change of direction of all different kinds of attempts and then you went to the ground. Do you remember that decision of like, okay, am I going to finish this?"
  },
  {
    "start": 212,
    "end": 213,
    "speaker": "Neil Adams",
    "timestamp": "(00:34:01)",
    "text": "Yeah, I knew it. As soon as I climbed his back and then I thought he’s not going. I’m not going to let him up. So I was just changing-"
  },
  {
    "start": 214,
    "end": 215,
    "speaker": "Lex Fridman",
    "timestamp": "(00:34:10)",
    "text": "Little voice in your head."
  },
  {
    "start": 216,
    "end": 217,
    "speaker": "Neil Adams",
    "timestamp": "(00:34:12)",
    "text": "Little something in my head was going, “Just stick on him.” And then it’s always about pressure on the arm. And of course he was like that, defending. He was almost total bridge trying to get out of it."
  },
  {
    "start": 218,
    "end": 219,
    "speaker": "Lex Fridman",
    "timestamp": "(00:34:28)",
    "text": "Did it start in turtle and did you flip?"
  },
  {
    "start": 220,
    "end": 221,
    "speaker": "Neil Adams",
    "timestamp": "(00:34:30)",
    "text": "It started in turtle, because I did an attack, came back out of the attack and then he went on to his front. And then I was on his back. And then I started the whole [inaudible 00:34:41]."
  },
  {
    "start": 222,
    "end": 223,
    "speaker": "Lex Fridman",
    "timestamp": "(00:34:41)",
    "text": "Saw the opening. You just went for it?"
  },
  {
    "start": 224,
    "end": 225,
    "speaker": "Neil Adams",
    "timestamp": "(00:34:43)",
    "text": "It was an automatic transition. So the transitions are what we teach, because the ones that are quicker down with the transitions are the ones that catch it. That’s our newaza. Our groundwork is the transition from standing down to ground. We don’t have a situation where you can work your way in. You are in or you not in. You’re standing. So you’ve got to make sure that you’re in. And so I was just on his back like a leech and I never let him go."
  },
  {
    "start": 226,
    "end": 227,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:14)",
    "text": "So that’s where the arm bars, that’s where the attacks on the ground, which is called newaza, happens is in the transition. At that level, at that high world-class level?"
  },
  {
    "start": 228,
    "end": 229,
    "speaker": "Neil Adams",
    "timestamp": "(00:35:23)",
    "text": "Yeah, he was no mug either. I think he just got third place in All Japan Championships, which is all weight categories. So he wasn’t a mug. He was strong. And I’d fought him once before and I knew he was a lefty as well, which was really awkward for me."
  },
  {
    "start": 230,
    "end": 231,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:42)",
    "text": "Did it feel good?"
  },
  {
    "start": 232,
    "end": 233,
    "speaker": "Neil Adams",
    "timestamp": "(00:35:43)",
    "text": "Better for me than him. It did. It felt amazing. Because it was almost like all these things, disappointments and everything had come to this one point where I was at last champion of the world. It’s everything I said as a kid that I had no idea how difficult it was going to be. So as a kid, as a fourteen-year-old kid, I remember saying, “I’m going to be world champion. I’m going to be the best in the world.” I had no idea how difficult that was going to be."
  },
  {
    "start": 234,
    "end": 235,
    "speaker": "Lex Fridman",
    "timestamp": "(00:36:13)",
    "text": "Well there’s wisdom to that. There’s power and stupidity of youth."
  },
  {
    "start": 236,
    "end": 237,
    "speaker": "Neil Adams",
    "timestamp": "(00:36:18)",
    "text": "I like that. It is."
  },
  {
    "start": 238,
    "end": 239,
    "speaker": "Lex Fridman",
    "timestamp": "(00:36:19)",
    "text": "Yeah. Just I’m going to be a world champ. I’m going to win this without knowing how hard it is. And then once you go after it, you’re trapped. You’re going to have to do the work."
  },
  {
    "start": 240,
    "end": 241,
    "speaker": "Neil Adams",
    "timestamp": "(00:36:30)",
    "text": "Yeah, well you see it a lot with parents as well, don’t you? Parents, “Our little Johnny, he’s amazing. And he’s this, that and the other.” And they have no idea what’s out there. I remember the very first time I stepped out, 1974, into the European cadets. And I remember that we were fighting, I only ever fought in Great Britain. I was unbeaten in the juniors, kids. And went out there and there were these different fighters out there that were treating me with total disdain. And I remember thinking, “How dare they?” And I realized when I came back from that event, there’s other people out there. And there are different levels. Majority of people are just not informed as to what’s out there and the different levels that there are out there."
  },
  {
    "start": 242,
    "end": 243,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:27)",
    "text": "Do you remember a certain opponent that for the first time you felt like, “Holy shit.” Somebody just gripped you up and you’re like, “There’s another level to this game.”"
  },
  {
    "start": 244,
    "end": 245,
    "speaker": "Neil Adams",
    "timestamp": "(00:37:41)",
    "text": "Ezio was one of them. And I fought him and I beat him in the European championships. I beat two times, and then lost him in the Olympic games two months after I’d beaten him in the European championship."
  },
  {
    "start": 246,
    "end": 247,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:54)",
    "text": "Oh wow."
  },
  {
    "start": 248,
    "end": 249,
    "speaker": "Neil Adams",
    "timestamp": "(00:37:55)",
    "text": "Yeah. So that made it even more difficult."
  },
  {
    "start": 250,
    "end": 251,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:55)",
    "text": "So that’s literally your nemesis there. Wow."
  },
  {
    "start": 252,
    "end": 253,
    "speaker": "Neil Adams",
    "timestamp": "(00:38:03)",
    "text": "So that made it more difficult. And so Ezio was one. And I remember getting hold of Nishida of Japan. And he had me going up and down. And I thought, “Wow, this guy is amazing.” And first time I had ever fought Japanese in a major tournament. And I felt the danger. I always talk about the danger when we go out to Japan to train. I could go probably months without getting thrown in training here in Europe. And go to Japan and everybody’s thrown you. And that’s difficult to accept. And the reason that kind of danger and that kind of feeling of danger is something that puts a real edge on. And so that was the first time. When I got hold of Nishida, “I thought, oh my god. This guy.” It didn’t matter which way he was turning, like that you’d be stretched out. And I thought, “I want to do this.” And then I ended up fighting him again in Japan."
  },
  {
    "start": 254,
    "end": 255,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:13)",
    "text": "So that feeling of danger is really interesting. I’ve did randori with a lot of world-class people from different parts of the world including Ilias Iliadis. And there’s certain parts, like Eastern European judo, you feel like you’re screwed the whole way through. The gripping. You really feel it in the gripping."
  },
  {
    "start": 256,
    "end": 257,
    "speaker": "Neil Adams",
    "timestamp": "(00:39:35)",
    "text": "It’s the gripping that does it."
  },
  {
    "start": 258,
    "end": 259,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:36)",
    "text": "But with really good Japanese style, judoka, it’s a terrifying calmness, or at least the experiences that I’ve had. You don’t really feel it in the gripping, you just feel like anywhere you step you’re getting thrown. It’s a different-"
  },
  {
    "start": 260,
    "end": 261,
    "speaker": "Neil Adams",
    "timestamp": "(00:39:53)",
    "text": "It’s a different thing, isn’t it?"
  },
  {
    "start": 262,
    "end": 263,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:54)",
    "text": "It’s a different thing."
  },
  {
    "start": 264,
    "end": 265,
    "speaker": "Neil Adams",
    "timestamp": "(00:39:55)",
    "text": "So I mean mine was a mixture. I liked it to be a mixture because the gripping is definitely the key point. So if you get a high level guys that are gripping up, and I always used to put this to the referees when we were doing referee seminars when we first started them. And I’d say, “How many?” Because they would referee to their understanding of the match. So they were penalizing for certain grips that were… So as an ex-athlete, high level I would say, have you ever gripped up with high level? All right, because if you haven’t, you need to do it. Because then you’ll understand why they do certain things with the grips. Because these guys, when somebody grips you and you know you’re going to go. When Iliadis puts his arm over your back, all right. And you know you’re going to go up and over. You know you’re going to go over. That’s it."
  },
  {
    "start": 266,
    "end": 267,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:55)",
    "text": "It’s a cool feeling. It’s like whenever-"
  },
  {
    "start": 268,
    "end": 269,
    "speaker": "Neil Adams",
    "timestamp": "(00:39:55)",
    "text": "Not for me."
  },
  {
    "start": 270,
    "end": 271,
    "speaker": "Lex Fridman",
    "timestamp": "(00:41:02)",
    "text": "I understand. Because it feels way more powerful than it should. It’s weird. I don’t know. You want to attribute it to strength and all that kind of stuff. People say you have immense upper body strength, but it’s probably something else. It’s technique. It’s some kind of weird-"
  },
  {
    "start": 272,
    "end": 273,
    "speaker": "Neil Adams",
    "timestamp": "(00:41:16)",
    "text": "It’s mix of everything."
  },
  {
    "start": 274,
    "end": 275,
    "speaker": "Lex Fridman",
    "timestamp": "(00:41:17)",
    "text": "Just something hardened through lots of battles and randori and that kind of stuff. But it’s cool that humans are able to generate that kind of power. It’s cool."
  },
  {
    "start": 276,
    "end": 277,
    "speaker": "Neil Adams",
    "timestamp": "(00:41:27)",
    "text": "When I was ’84 Olympics, but I’m just going to go there now just quickly, but we had a freestyle wrestler. He’s American actually, but he had the English nationality. Noel Loban, his name is. And he competed for Great Britain. He got third place at the Olympics in ’84. We were training at Budokai and he was training. He came to do some judo, and put jacket on. And of course he was training with some of the lower levels and he was really handling himself well. When we did randori, so he did some randori with me, and I immediately thought, “I got to catch you. I got to stop single leg and double leg.” Because he was really quick. So strong as well, 90 something kilos. He’s a big guy."
  },
  {
    "start": 278,
    "end": 279,
    "speaker": "",
    "timestamp": "(00:42:26)",
    "text": "I caught his sleeve, immediately caught, and controlled him. And then he couldn’t start. So he said, “I needed to feel the difference.” So then I thought, “I better reciprocate this.” So we did the randori and I throw them a couple of times. He said, “I’m really glad we did that.” So then I said, “I need to feel the difference as well.” So we take the jackets off. So we took the jackets off and he was a nightmare. This guy was a nightmare. And like a monster. He was single legging me. And it was just totally different. So the jacket makes a massive difference. Huge difference to something. And people think it’s just the jacket that we’re wearing, but it isn’t. It’s our only tool actually."
  },
  {
    "start": 280,
    "end": 281,
    "speaker": "Lex Fridman",
    "timestamp": "(00:43:16)",
    "text": "Yeah, and it’s a way of establishing control over another body. And it’s a whole art form and a science. And I don’t even know if you understand it really. You understand it subconsciously through time, because there’s so much involved. Because pulling on one part of the jacket pulls other parts of the jacket and the physics of that is probably insane to understand."
  },
  {
    "start": 282,
    "end": 283,
    "speaker": "Neil Adams",
    "timestamp": "(00:43:40)",
    "text": "It’s absolutely insane. And then they change the rules for a little while and they changed the rules so that certain grips were not allowed. They only allowed certain amount of time. And there were a lot of penalties from it. And then they had some of the ex-fighters into the referee commission. And so we were pushing for just let them grip. Because that’s our game. That’s what makes us different. So they were on about Teddy Riner. Teddy Riner comes out, takes his sleeve, big arm over the top and then he throws people. So they were saying, “Yeah, but stop…” You can’t stop him doing it. This guy is six foot nine and he is built like Garth. And not only that, he’s skillful as well. And he’s got that mentality of a winner. He has got that mentality of a winner there. He just wins important matches."
  },
  {
    "start": 284,
    "end": 285,
    "speaker": "Lex Fridman",
    "timestamp": "(00:44:41)",
    "text": "And he goes over the top of the grip. Where’s that land now in terms of rules over the top? Because those are some of the most epic awesome types of grips. Just over the top, just big grab."
  },
  {
    "start": 286,
    "end": 287,
    "speaker": "Neil Adams",
    "timestamp": "(00:44:53)",
    "text": "Yeah, well as long as they throw from it. So they can take any grip as long as you move them and then catch them, action-reaction really. As long as you catch them on the move, then you can do it."
  },
  {
    "start": 288,
    "end": 289,
    "speaker": "Lex Fridman",
    "timestamp": "(00:45:05)",
    "text": "So as long as you’re not using it to stall or that kind of stuff."
  },
  {
    "start": 290,
    "end": 291,
    "speaker": "Neil Adams",
    "timestamp": "(00:45:08)",
    "text": "Yeah, you can’t block out. So for example, if I’ve got a dominant grip on you, and I just block out and I just stop you attacking me. So then what? I get you three penalties, get you off and you haven’t done an attack. So you’ve got to stop that. You can’t have that."
  },
  {
    "start": 292,
    "end": 293,
    "speaker": "Lex Fridman",
    "timestamp": "(00:45:26)",
    "text": "Yeah, definitely. You were the favorite to win the 1984 Olympics, but you got silver. I watched that match several times. You probably have it playing in your head. So there is a nice change of direction by your opponent, German Frank Wieneke."
  },
  {
    "start": 294,
    "end": 295,
    "speaker": "Neil Adams",
    "timestamp": "(00:45:44)",
    "text": "Yeah."
  },
  {
    "start": 296,
    "end": 297,
    "speaker": "Lex Fridman",
    "timestamp": "(00:45:45)",
    "text": "It was a fake right uchi mata? And then to a left drops seoi-nage. How did that loss feel?"
  },
  {
    "start": 298,
    "end": 299,
    "speaker": "Neil Adams",
    "timestamp": "(00:45:56)",
    "text": "Devastating is not enough really. Because the strange thing is coming into that Olympics, I was tired. Really tired. So my mental state wasn’t the best. Wasn’t certainly the same as it was coming into the previous. And I remember thinking, “I just need to get this over with, and then I’m going to have a break .and just have a rest.” And that’s totally the wrong attitude. It’s just not good for going into an Olympic games. And so I was coming in there with a different mindset. And I remember every match that I had, I was winning well, but I was winning with a struggle. I’d fought Nowak, of France, who was one of the strongest physically. That was in the quarterfinals."
  },
  {
    "start": 300,
    "end": 301,
    "speaker": "",
    "timestamp": "(00:46:57)",
    "text": "I beat Brett Barron by an ippon. I armlocked him. I won my first match by ippon as well. And then Michel Nowak, I was fighting, of France. And I was lucky to win it. I was up, I scored on him. But I was starting to defend and just everything that I talked to you about, and then just about held on. And then I won. So him and I were talking some years afterwards and he said, “I was close, wasn’t I?” “Yeah, but not close enough.” I didn’t mean it, but I had to say it."
  },
  {
    "start": 302,
    "end": 303,
    "speaker": "Lex Fridman",
    "timestamp": "(00:47:37)",
    "text": "Of course. Of course."
  },
  {
    "start": 304,
    "end": 305,
    "speaker": "Neil Adams",
    "timestamp": "(00:47:39)",
    "text": "And no, he was right. And it was one of those. So it’s through to the semi-final. I fought Lescak, and I fought him in the semi-final of the Worlds as well. I’d never gone time with him. I’d always beaten him fairly easily by ippon. And that went time. So I was just glad to get it done. And I was in the final then against Frank Wieneke of Germany. And I’d beaten Wieneke before, but he was just a young German coming through. And when I started the final, and I started all my techniques just that little bit off. Nothing was coordinated. I can’t really explain why it was just a little bit off. I see it so often now with a lot of the guys that are going for second, third Olympic games. And I see their technique just not quite there and they’re struggling. And I know what they’re going through and I empathize with them."
  },
  {
    "start": 306,
    "end": 307,
    "speaker": "Lex Fridman",
    "timestamp": "(00:48:48)",
    "text": "Well it felt like you were dominating that final."
  },
  {
    "start": 308,
    "end": 309,
    "speaker": "Neil Adams",
    "timestamp": "(00:48:50)",
    "text": "I dominated it, yeah. I was winning. And actually if it’d gone another minute and a half, it would’ve been all over and I would’ve been Olympic champion. And it would’ve been done. He wouldn’t have batted an eyelid. Because he would’ve fought me really, really well. And we talked about it afterwards. And he said, “It was just a good day for me.” And he knows. He was very respectful. This guy is very respectful."
  },
  {
    "start": 310,
    "end": 311,
    "speaker": "Lex Fridman",
    "timestamp": "(00:49:13)",
    "text": "He was surprised almost. Not almost. He was very surprised and celebrating like a surprise [inaudible 00:49:19]."
  },
  {
    "start": 312,
    "end": 313,
    "speaker": "Neil Adams",
    "timestamp": "(00:49:19)",
    "text": "Jumping up and down. And you can look at that, can’t you go, well it wasn’t ippon. But would I have got it back? I don’t know. I think that actually taking the pressure off, because that was another thing as well. Pressure of being favorite. And I see that with a lot of them. And the great champions, the ones that keep coming through, Krpalek. There’s a guy. He can look very ordinary and then comes to the big tournament and he’ll win it."
  },
  {
    "start": 314,
    "end": 315,
    "speaker": "Lex Fridman",
    "timestamp": "(00:49:52)",
    "text": "The tragedy of the Olympic games. You were the favorite. And just like that split moment, you lost it."
  },
  {
    "start": 316,
    "end": 317,
    "speaker": "Neil Adams",
    "timestamp": "(00:49:59)",
    "text": "Split moment. Devastating. And lived it, probably not every day, but Niki, my wife will tell you that woken up in sweats. And I think they contributed as well, because I had a period of my life after where I was drinking too much. And I think when I look back, led into that dark period in my life. And I never ever, ever did it go through my mind anything else. But it definitely affected me. And I was on a downward spiral in a lot of different ways."
  },
  {
    "start": 318,
    "end": 319,
    "speaker": "",
    "timestamp": "(00:50:43)",
    "text": "And we have an amazing marriage and we have an amazing family, and everything’s great. But I still wake up sometimes and I’ll say, “I’ve just dreamt it.” And it’s the same reoccurring dream where I’m trying to get somewhere and I’m trying to put it right. And I’ve got this chance of putting this Olympic final right. In this dream I’ve got a chance of doing it, but I can’t get there. And the traffic’s stopping me or something stops me. And then I wake up and I’m sweating. And you think, well after all this time that’s not possible. But it is. And it happens."
  },
  {
    "start": 320,
    "end": 321,
    "speaker": "Lex Fridman",
    "timestamp": "(00:51:22)",
    "text": "Yeah, in the match itself, there’s that feeling, for me just watching it. You’re going for throws, you’re almost getting there with the throws and it’s almost like he’s going for a crappy uchi mata. And then you’re blocking it. And all of a sudden… That’s the beauty of the Olympics, he finds it in himself to switch, against a favorite, against the great British judoka, just finds the perfect drop seoi-nage."
  },
  {
    "start": 322,
    "end": 323,
    "speaker": "Neil Adams",
    "timestamp": "(00:51:55)",
    "text": "Well his team doctor and coach, he came up to me afterwards and said, “I’m just really sorry.” And that’s all they said is, “I’m just really sorry.” They were sorry because the obvious sadness about that. And I went actually, was it three weeks later? The German open? So he had to compete in the German open three weeks later. So I went over to fight him and beat him in the final of the German open. And it didn’t do anything for me. Because it was a much tighter match. He was a lot closer, he had a lot more confidence coming in. So he fought me a lot differently. And then it was me pulling it back and just managing to win in the final. And I thought, “Well it appeased nothing.” Didn’t do anything."
  },
  {
    "start": 324,
    "end": 325,
    "speaker": "Lex Fridman",
    "timestamp": "(00:52:51)",
    "text": "When you give your whole life to judo and your love of winning, it’s crazy how much the Olympic games mean."
  },
  {
    "start": 326,
    "end": 327,
    "speaker": "Neil Adams",
    "timestamp": "(00:52:59)",
    "text": "It means so much. And I’ve got to say this, and this is honestly, that if I’d have won that Olympic games and it had to change my life into a different direction, which I probably would’ve not competed in the ’88 Olympic games then, all right, so if it had changed my life and then I didn’t meet my wife, and I didn’t have my family that I’ve got now, I wouldn’t swap what I’ve got now for anything."
  },
  {
    "start": 328,
    "end": 329,
    "speaker": "Lex Fridman",
    "timestamp": "(00:53:29)",
    "text": "Well, part of the demons that you’ve gotten to know, because of those losses as part of probably the central reason that made you the man you are, a legend of the sport. You could have been not that. Because an gold is just an Olympic gold."
  },
  {
    "start": 330,
    "end": 331,
    "speaker": "Neil Adams",
    "timestamp": "(00:53:47)",
    "text": "Yeah. And it is, isn’t it? And I think that there’s a lot of Olympic champions and world champions that win and then are forgotten. And I said to Niki, my wife, I said, “I don’t want to be forgotten and I want to be remembered. So if I’m going to do anything, anything I do, if I’m going to do commentary or whatever it is, coaching, I want to do coaching to a high level. And I want to commentate at a high level.” I remember the first commentary I ever did. It was terrible. And I just thought, “I’ve got to do better than this.” And I thought I need to do it well, and I’ve got to do it professionally."
  },
  {
    "start": 332,
    "end": 333,
    "speaker": "Lex Fridman",
    "timestamp": "(00:54:30)",
    "text": "In the book A Game of Throws, you have a chapter titled Lessons in Losing. What are some of the lessons here? What are some of the deeper lessons you’ve pulled out of losing?"
  },
  {
    "start": 334,
    "end": 335,
    "speaker": "Neil Adams",
    "timestamp": "(00:54:42)",
    "text": "I think great champions are made up of the people that handle it in the right way. And you could say, “Well, I don’t like losing.” And you could throw your dummy out the pram and you can be a bad loser in front of everybody. And actually people pick up on that very, very quickly. You know what it’s like in broadcasting, right?"
  },
  {
    "start": 336,
    "end": 337,
    "speaker": "Lex Fridman",
    "timestamp": "(00:55:04)",
    "text": "Mm-hmm."
  },
  {
    "start": 338,
    "end": 339,
    "speaker": "Neil Adams",
    "timestamp": "(00:55:04)",
    "text": "Somebody Has a bad word to say about somebody, but actually the ones that endear themselves to you are the ones that handle it in the right way, the correct way. It doesn’t mean that you’ve got to like it. I didn’t like it. And I thought that I handled it, certainly in later years, in the right way. And I like to see athletes do it in the right way. And I think it is a make or break situation. It’s not all the contests they win, it’s the one that they lose .and then how they pick themselves up and handle themselves after. So I think that is a big one for me."
  },
  {
    "start": 340,
    "end": 341,
    "speaker": "",
    "timestamp": "(00:55:42)",
    "text": "And also I went through obviously a later divorce. And that was difficult on my son, really difficult on Ashley. And then I think that some of that was the fact that I wasn’t drinking all the time, but I was drinking in excess at the wrong times. And I think that that’s what a lot of people do sometimes is that they use it for the wrong reasons. And I used to hear it, I hear it now all the time, and it’s that I need to knock the edge off, and I need to just forget, and you need to be in a fuzzy place for a while. And I had a lot of time in fuzzy place, and I needed to get rid of that. And I needed to clear my head."
  },
  {
    "start": 342,
    "end": 343,
    "speaker": "Lex Fridman",
    "timestamp": "(00:56:32)",
    "text": "Where was that place? Some of the lower points in your life that you’ve reached mentally?"
  },
  {
    "start": 344,
    "end": 345,
    "speaker": "Neil Adams",
    "timestamp": "(00:56:41)",
    "text": "I think definitely the fact that my first marriage didn’t work. And it’s a mix of things between us. So that’s not where I wanted to be at the time. And the effects that it had on my son, and it took a long time for him then to come round and to trust me again, and to have belief. He always had belief in me, but to trust me again. I think that that was low. And I think that when I look back is that a lot of my bad decisions were when I was in that fuzzy haze. And that it got progressively worse."
  },
  {
    "start": 346,
    "end": 347,
    "speaker": "",
    "timestamp": "(00:57:33)",
    "text": "That got progressively worse to the degree where it was trying to hide it, and trying to hide how much. And I was a functioning drunk. I think you could probably say that. And I was functioning, I was still training most days, crazily enough. I was training to mask it and cover it. And that was probably my savior, because I remember I said to my wife, I said to Niki, “If I’m a drunk then I’m the fittest drunk in the world.” She said, “Yeah, you probably are, actually.” I was in great condition for a drunk."
  },
  {
    "start": 348,
    "end": 349,
    "speaker": "Lex Fridman",
    "timestamp": "(00:58:16)",
    "text": "So the fuzzy haze, where was your mind? Did you have periods of depression?"
  },
  {
    "start": 350,
    "end": 351,
    "speaker": "Neil Adams",
    "timestamp": "(00:58:24)",
    "text": "I had periods of depression. I can honestly say that my depression wasn’t that bad, although it’s like anything that gives you an up, it gives you an even bigger down, doesn’t it? And so I hated that feeling. And also hated myself for letting it happen. Because I have got this really, it’s a bizarre, I don’t know whether you can call it a power, but I have the ability to be able to say, “Stop.” And that’s what I did in the end. In the end, there was an incident when I was working for Belgium Judo. And there was an incident, it was Christmas, I tell you exactly the day, it was 20th of December. And me and a Belgian coach, we got absolutely hammered. But we were at the wrong place and he got noticed."
  },
  {
    "start": 352,
    "end": 353,
    "speaker": "",
    "timestamp": "(00:59:23)",
    "text": "And so I remember they pulled me up in front of this board. And I looked down at these guys and half of them were people I didn’t want to be in that situation with. They’re not people that I respected and they’re not people that I trusted. So I said, “If you’re going to sack me, sack me. But I’ll promise you now that this is it. I’ll stop. I’m just going to stop. I’ve decided.” On the way back in the car I rang Niki up, my wife, and I said, “Whatever you hear…"
  },
  {
    "start": 354,
    "end": 355,
    "speaker": "Neil Adams",
    "timestamp": "(01:00:00)",
    "text": "I rang Nikki up, my wife, and I said, “Whatever you hear now, whatever, I’m just going to stop.” That was it, stopped."
  },
  {
    "start": 356,
    "end": 357,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:10)",
    "text": "You just saw the moment and said, “Stop.”"
  },
  {
    "start": 358,
    "end": 359,
    "speaker": "Neil Adams",
    "timestamp": "(01:00:14)",
    "text": "Stop."
  },
  {
    "start": 360,
    "end": 361,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:15)",
    "text": "So that fuzzy place, what advice could you give to people about how to overcome that dark place, the depression, whether it has to do with drinking or not."
  },
  {
    "start": 362,
    "end": 363,
    "speaker": "Neil Adams",
    "timestamp": "(01:00:26)",
    "text": "I think if it’s to do with drinking, all I can say is that the two days or a week into not drinking, you’ll feel different. It’ll make a physical difference and you’ll like that physical difference. And then from a mental perspective as well, because I think that you have a massive downer. And I think that that must be because of drugs as well because I had a situation with my brother, he was professional wrestling and the drugs was an element there. So I’d never touched a drug or even seen one in my life. But I’d let the alcohol side go too far and then decided never to do that. So then I guess I had people ringing me up saying, “How can we stop?” When they say, “Can I have a word? Can I discuss something with you?” And I know then what they want to discuss with me. And the thing is that I would say, if you stop, then feel the effects of it and it will make a difference to your everyday life. And that will make a massive difference."
  },
  {
    "start": 364,
    "end": 365,
    "speaker": "",
    "timestamp": "(01:01:49)",
    "text": "And I think about anybody who is down all the time is to find the cause of what’s pushing you down. You know what I mean? And try and attack that. Somebody once said to me, they said, “Whatever you got, we’ve got something special.” We have a great life and I’ve had a great competition record. It could have been better, but it was great. But I’ve had success with my business and we’re still out there and we have great life. We travel all the world. There’s people out there that would live in your house at the drop of a hat, wherever you are. They drive your car no matter what car it is. Some people haven’t got a car. And whatever food you’re having and you’re moaning about food, somebody out there that would take that and gladly eat that. All right? So there’s always somebody worse off than you. And I think that we tend to sometimes look at the things that we haven’t got rather than the things we have got."
  },
  {
    "start": 366,
    "end": 367,
    "speaker": "Lex Fridman",
    "timestamp": "(01:02:59)",
    "text": "Yeah, it’s a skill probably just to be grateful for the things you have. Exactly as you said. Sometimes the little things like food and cars and all that kind of stuff, just to have gratitude for. And family, all this kind of stuff. But it’s still, having talked to a bunch of Olympic athletes, when you give so much of your life to winning and then you lose, sometimes even when you win. But when you lose, at the very top, it’s a tough, tough, tough thing to go through."
  },
  {
    "start": 368,
    "end": 369,
    "speaker": "Neil Adams",
    "timestamp": "(01:03:37)",
    "text": "The most difficult thing I think for anybody is when they have to decide when to stop."
  },
  {
    "start": 370,
    "end": 371,
    "speaker": "Lex Fridman",
    "timestamp": "(01:03:42)",
    "text": "Yeah, yeah."
  },
  {
    "start": 372,
    "end": 373,
    "speaker": "Neil Adams",
    "timestamp": "(01:03:46)",
    "text": "All of a sudden, and I see the ones that are going second Olympic games and then third Olympic and the ones that are there and they’re holding on and they’re in their 30s now, different to when they were 19 years of age, thirty-something is different to 19. What are you going to do afterwards? And then how do you become just a normal person? You’re never going to be a normal person, as such. But I think you’ve got to do normal things. I remember the first time that when I finished competition, I had good sponsors. This was 40 years ago, but I had two really good sponsorships, vitamin company and also a judogi company. And I had a car. Do you know, I had money. And I was going all over the world. I was successful. And then I stopped. And they took everything back. They took my car and they did it within two weeks as well. They stopped my funding. And the vitamin company said, “Thank you very much. It’s been a great. We’ve done well by you. Bye-bye.”"
  },
  {
    "start": 374,
    "end": 375,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:55)",
    "text": "This was after your last Olympics?"
  },
  {
    "start": 376,
    "end": 377,
    "speaker": "Neil Adams",
    "timestamp": "(01:04:57)",
    "text": "’88 Olympics."
  },
  {
    "start": 378,
    "end": 379,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:58)",
    "text": "Yeah, in ’88."
  },
  {
    "start": 380,
    "end": 381,
    "speaker": "Neil Adams",
    "timestamp": "(01:04:59)",
    "text": "When that finished and then that was it. And then it’s right, okay. First time I had to go in there and buy a tracksuit and a pair of training shoes. Wow."
  },
  {
    "start": 382,
    "end": 383,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:09)",
    "text": "Yeah, those are difficult, sitting there in the evening by yourself."
  },
  {
    "start": 384,
    "end": 385,
    "speaker": "Neil Adams",
    "timestamp": "(01:05:13)",
    "text": "So you go from seven days a week or six days a week going into the gym and you’re working out the dojo and then you don’t have to do it. And that’s why you get a lot of, when they finish competition, they finish that 30 to 40. Ilias is still doing it now. He’s still in there and he still, because he can, right? And it’s natural. And I did exactly the same. And then, like I say, you just get to an age and you just think, well, I just going to take a step back,"
  },
  {
    "start": 386,
    "end": 387,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:47)",
    "text": "Which is why there’s certain athletes like Ryoko Tani never stops. It just dominates for 14 years, probably one of the winning-est athletes in Judo. Seven-time world champ, two-time Olympic champ, medaled at five Olympics. So it’s always impressive when you…"
  },
  {
    "start": 388,
    "end": 389,
    "speaker": "Neil Adams",
    "timestamp": "(01:06:06)",
    "text": "Never stopped."
  },
  {
    "start": 390,
    "end": 391,
    "speaker": "Lex Fridman",
    "timestamp": "(01:06:07)",
    "text": "Never stopped. So that’s an option if you’re the greatest ever."
  },
  {
    "start": 392,
    "end": 393,
    "speaker": "Neil Adams",
    "timestamp": "(01:06:12)",
    "text": "It’d be interesting, wouldn’t it, just to see what they’re doing now. Because at some stage you have to get a normal…"
  },
  {
    "start": 394,
    "end": 395,
    "speaker": "Lex Fridman",
    "timestamp": "(01:06:17)",
    "text": "You do have to stop."
  },
  {
    "start": 396,
    "end": 397,
    "speaker": "Neil Adams",
    "timestamp": "(01:06:18)",
    "text": "You have to stop at some stage. You have to decide what you’re going to do. It’s either into coaching, the Judo is either to coaching or if you’re not in coaching, then it’s into something to do with the media. And I was lucky that it was just by accident really with the commentary. Somebody said, “Would you do a voiceover?” So I did this voiceover and that was back in 1982, I did that."
  },
  {
    "start": 398,
    "end": 399,
    "speaker": "Lex Fridman",
    "timestamp": "(01:06:49)",
    "text": "So you’ve been commentating since 1982."
  },
  {
    "start": 400,
    "end": 401,
    "speaker": "Neil Adams",
    "timestamp": "(01:06:52)",
    "text": "I did some voiceovers, I wouldn’t call it commentating, but I did some voiceovers. We did some different European championships, world championship events. And I did the voiceovers for it. The way that it was done that it was more narration. And so it turned into, then somebody asked me to do an event and when you listen to the intonation of the voice and stuff like that, it wasn’t like it is now. I guess that’s just something that developed, because then it was coming from the heart. I started to get excited and just do my thing. And it was just me really. It’s just my style."
  },
  {
    "start": 402,
    "end": 403,
    "speaker": "Lex Fridman",
    "timestamp": "(01:07:34)",
    "text": "Well, I’ve listened to your commentary from a while back. I don’t know if it’s the ’80s, but it’s still there."
  },
  {
    "start": 404,
    "end": 405,
    "speaker": "Neil Adams",
    "timestamp": "(01:07:40)",
    "text": "I think it’s timing as well, isn’t it? It’s like you get your timing a bit better and know when to go in, when to come out, when to say something, when not. I think that in the early days I tended to want to talk all the time and you don’t have to do that."
  },
  {
    "start": 406,
    "end": 407,
    "speaker": "Lex Fridman",
    "timestamp": "(01:07:59)",
    "text": "So knowing when to shut up."
  },
  {
    "start": 408,
    "end": 409,
    "speaker": "Neil Adams",
    "timestamp": "(01:08:01)",
    "text": "That’s the key, isn’t it?"
  },
  {
    "start": 410,
    "end": 411,
    "speaker": "Lex Fridman",
    "timestamp": "(01:08:02)",
    "text": "Yeah, part of the drama is in the silence, building up to the setup and the throw and all that kind of stuff. But also you’re very good at, while radiating passion, being very precise and specific about the details of the throw and the setup and why something worked and didn’t."
  },
  {
    "start": 412,
    "end": 413,
    "speaker": "Neil Adams",
    "timestamp": "(01:08:22)",
    "text": "I think there’s two kinds of commentating. You can commentate what you see and then you commentate what people can’t see. And so if you’ve got somebody that is not really understanding of what’s happening in the inner part of the game, so it might be a technical thing or it might be the tactical part of the play here that’s going on. And if you can introduce that, as well, then you’ve got an advantage."
  },
  {
    "start": 414,
    "end": 415,
    "speaker": "Lex Fridman",
    "timestamp": "(01:08:50)",
    "text": "Quick pause. I need a bathroom break.="
  },
  {
    "start": 416,
    "end": 417,
    "speaker": "Neil Adams",
    "timestamp": "(01:08:52)",
    "text": "Okay. Good stuff."
  },
  {
    "start": 418,
    "end": 419,
    "speaker": "Lex Fridman",
    "timestamp": "(01:08:54)",
    "text": "So we just took a little break and went to Judotv.com, which is, I guess, an IGF website. IGF is the organization behind a lot of the big judo events in the world. And I just signed up, you should sign up, too. It’s great."
  },
  {
    "start": 420,
    "end": 421,
    "speaker": "Neil Adams",
    "timestamp": "(01:09:09)",
    "text": "Absolutely, sign up. Cheaper the price, cheaper the price."
  },
  {
    "start": 422,
    "end": 423,
    "speaker": "Lex Fridman",
    "timestamp": "(01:09:14)",
    "text": "And you can watch basically any match from the Grand Slams and going back through history, I guess."
  },
  {
    "start": 424,
    "end": 425,
    "speaker": "Neil Adams",
    "timestamp": "(01:09:20)",
    "text": "Yeah, I’ve got to say Lex, I mean everybody. Still people saying to me, “We need more judo on television.” They’ve got judo on television every other week that they can access. All of the top people in all the top events and it costs $100 a year to access everything. And they can play all the videos. I mean we’ve just accessed this here, the Paris tournament, and we’re going to have a look at Teddy Riner. It’s cheap at the price."
  },
  {
    "start": 426,
    "end": 427,
    "speaker": "Lex Fridman",
    "timestamp": "(01:09:51)",
    "text": "We’re now in Paris Grand Slam 2024. Teddy Riner final. By the way, super cool. You click on the draw. You can just look at any of the matches. You can go at the bottom of the finals, you can go…"
  },
  {
    "start": 428,
    "end": 429,
    "speaker": "Neil Adams",
    "timestamp": "(01:10:05)",
    "text": "To anyone."
  },
  {
    "start": 430,
    "end": 431,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:06)",
    "text": "Any one of them. That’s so cool. That’s really well done. Really well done interface. Anyway, let me first ask the ridiculous big question. Who do you think is the greatest of all time? Is Teddy Riner in the running?"
  },
  {
    "start": 432,
    "end": 433,
    "speaker": "Neil Adams",
    "timestamp": "(01:10:17)",
    "text": "He’s the greatest judo winner of all time. Of that, there’s no doubt. I think if you asked him whether he was the greatest judo man in the world of all time, he would say, “No, I’m not.” And he’s not the greatest judo man. There are people with more beautiful judo in some ways, although he’s got great technique. But he is the ultimate winner."
  },
  {
    "start": 434,
    "end": 435,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:47)",
    "text": "10-time world champ, two-time gold medalist in the Olympics. I guess two-time bronze medalist. He’s going to Paris?"
  },
  {
    "start": 436,
    "end": 437,
    "speaker": "Neil Adams",
    "timestamp": "(01:10:57)",
    "text": "Yeah."
  },
  {
    "start": 438,
    "end": 439,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:57)",
    "text": "He’s going after it again. So he’s right here."
  },
  {
    "start": 440,
    "end": 441,
    "speaker": "Neil Adams",
    "timestamp": "(01:11:00)",
    "text": "He’s right there. This is just a couple of months ago. And then last week, last week he was out again and he won again."
  },
  {
    "start": 442,
    "end": 443,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:07)",
    "text": "You think he gets gold medal this time?"
  },
  {
    "start": 444,
    "end": 445,
    "speaker": "Neil Adams",
    "timestamp": "(01:11:09)",
    "text": "There’s people getting closer to him, right? He’s, obviously, age-wise and the amount of time that he’s been there, he’s obviously somebody that he’s starting not quite at his best as he was when he was younger. But like I say, he still puts it on the line. He lays it on the line every single time. And then not only does he lay it on the line, but he beats them all. And last week he just beat Saito who was a young up-and-coming Japanese fighter and he beat him in the final. It was close and he did well. There are certain people, the smaller ones, actually, not the taller ones because, like we were saying about the big arm over the top that he likes and the dominant grip that he likes, there are people that can give him a hard time. Now if at the Olympic Games he has two or three of those on the trot, it might work against him."
  },
  {
    "start": 446,
    "end": 447,
    "speaker": "",
    "timestamp": "(01:12:05)",
    "text": "It’s by no means an absolute certainty that he’s going to win the Olympic gold medal. But he’s got to be one of the favorites, top favorite. No matter what happens now, Teddy Riner is the greatest winner, and if you asked the great Yamashita, he would say the same. There’s nobody that’s, and Yamashita was unbeaten in international competition. I trained with Yamashita a lot over a two-year period and got to know him quite well. And he was one of the greatest of all times. For me, he was one of the greatest Judo men. I’m talking about from a technical point of view, from a spectacular judo point of view, understanding the fundamental principles of how techniques work. Sometimes having different techniques that work for you. So if one doesn’t work and one particular direction doesn’t work, you can change the direction completely."
  },
  {
    "start": 448,
    "end": 449,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:04)",
    "text": "In case people don’t know, Yamashita has this legendary judoka heavyweight. Teddy Riner heavyweight, that’s plus 100 kg."
  },
  {
    "start": 450,
    "end": 451,
    "speaker": "Neil Adams",
    "timestamp": "(01:13:13)",
    "text": "He would’ve caused him all sorts of problems."
  },
  {
    "start": 452,
    "end": 453,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:15)",
    "text": "Oh yeah, that’s cool. Who do you think wins? Yamashita?"
  },
  {
    "start": 454,
    "end": 455,
    "speaker": "Neil Adams",
    "timestamp": "(01:13:18)",
    "text": "Yes, I think Yamashita."
  },
  {
    "start": 456,
    "end": 457,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:21)",
    "text": "Whoa, whoa, whoa. You think Yamashita beats Teddy Riner?"
  },
  {
    "start": 458,
    "end": 459,
    "speaker": "Neil Adams",
    "timestamp": "(01:13:24)",
    "text": "I think so."
  },
  {
    "start": 460,
    "end": 461,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:26)",
    "text": "Strong words. You think so. You think so. Yamashita is on the shorter side, right?"
  },
  {
    "start": 462,
    "end": 463,
    "speaker": "Neil Adams",
    "timestamp": "(01:13:32)",
    "text": "Yeah, and he finds it more difficult with shorter people. It would’ve been a very interesting confrontation. And I think if you asked Yamashita, he would probably say that Teddy Riner, he’s very gracious. He’s really gracious. It would be really good. It would’ve been an unbelievable matchup. And I’ve got to say this, that Teddy Riner is the greatest winner of all time."
  },
  {
    "start": 464,
    "end": 465,
    "speaker": "Lex Fridman",
    "timestamp": "(01:14:03)",
    "text": "Competition wise. It’s interesting. Both of them, maybe you can correct me, but have this Osoto Gari, which is kind of trip that I never understood."
  },
  {
    "start": 466,
    "end": 467,
    "speaker": "Neil Adams",
    "timestamp": "(01:14:14)",
    "text": "Yeah."
  },
  {
    "start": 468,
    "end": 469,
    "speaker": "Lex Fridman",
    "timestamp": "(01:14:16)",
    "text": "It is a very tricky thing to do, right? It’s very easy to do maybe as a white belt. You roll in. You can understand. But to do it at the high, high, high level?"
  },
  {
    "start": 470,
    "end": 471,
    "speaker": "Neil Adams",
    "timestamp": "(01:14:27)",
    "text": "You see any of the top guys now, especially if they’re second time out. So they might catch somebody by surprise. They come out and they go, bang. And you go, “That was amazing.” But if they fought again 10 minutes later, you go, “You’re not going to catch me with that.” You’ve got a different situation here. And so it’s slightly different. But the best fighters adapt like that. And they’re able to see a situation, feel the situation, and they attack once and then go again and attack second, third time. And in the third time they make it work>"
  },
  {
    "start": 472,
    "end": 473,
    "speaker": "Lex Fridman",
    "timestamp": "(01:15:06)",
    "text": "Both Yamashita and Teddy Riner with the Osoto Gari, they’ll just hit it over and over in the match."
  },
  {
    "start": 474,
    "end": 475,
    "speaker": "Neil Adams",
    "timestamp": "(01:15:11)",
    "text": "Yeah, sometimes it’ll hit first time and it won’t go. And then you make a readjustment of the way in. It’s a little bit like, I mean, if you take a really easy way of understanding it is that if we’re shooting at a target and all of a sudden you start moving that target, it’s different hitting a moving target. But it’s also different hitting a moving target that’s trying to hit you as well. And that’s our game. So we are not only trying to throw a moving target, we’re trying to throw a moving target that’s trying to throw us. So it makes it even more difficult."
  },
  {
    "start": 476,
    "end": 477,
    "speaker": "Lex Fridman",
    "timestamp": "(01:15:45)",
    "text": "Yeah, there’s a few folks who, you know what’s coming. It’s over and over and over it’s the same attack. Anyway, with this uchi mata it’s different. It’s different. There’s not many people like that where it’s the same attack. I mean there’s other attacks also, but they’ll just go after the same thing over and over and over."
  },
  {
    "start": 478,
    "end": 479,
    "speaker": "Neil Adams",
    "timestamp": "(01:16:05)",
    "text": "When I watch great athletes, most of them can throw over both flanks, not always going left and right, though our sport always, the cat are always demonstrated left and right. If you demonstrate, if you do something on one side, then can you demonstrate it on the other side? Right? Okay. So can you do it equally? No, but you’ll do it differently on the other side. So when I’m teaching, I don’t teach left and right. If I was teaching you to do a technique, first thing I’d do is say, “I need you to take the sleeve under lapel.” All right?"
  },
  {
    "start": 480,
    "end": 481,
    "speaker": "",
    "timestamp": "(01:16:46)",
    "text": "So I’d let you decide what was left and right. Okay? Because often what happens is we impart on people whether they’re going to be left or right when we start teaching. You get a lot of teachers do that all. And they’ll say, immediately, “What do you write with? Left or right hand?” And it’s no indicator actually as to how we do judo because I’m left-handed and I do more predominantly right-handed because I lead off my strongest hand. And actually most people do. So actually left and right is a bit of a trap sometimes when we’re teaching. Better to get, because we can go… My point was, is that a lot of people can go both flanks, so they’ll do something over this side and something over this side."
  },
  {
    "start": 482,
    "end": 483,
    "speaker": "Lex Fridman",
    "timestamp": "(01:17:32)",
    "text": "But anyway, he was one-sided?"
  },
  {
    "start": 484,
    "end": 485,
    "speaker": "Neil Adams",
    "timestamp": "(01:17:36)",
    "text": "He was one-sided, but he could switch it. So he had a seoi nage as well on the other side so he could switch it if he had to."
  },
  {
    "start": 486,
    "end": 487,
    "speaker": "Lex Fridman",
    "timestamp": "(01:17:42)",
    "text": "Interesting. And by the way, your opponent in ’84, was he righty or lefty?"
  },
  {
    "start": 488,
    "end": 489,
    "speaker": "Neil Adams",
    "timestamp": "(01:17:50)",
    "text": "He was a righty."
  },
  {
    "start": 490,
    "end": 491,
    "speaker": "Lex Fridman",
    "timestamp": "(01:17:51)",
    "text": "So that drop left seoi, where did that come from?"
  },
  {
    "start": 492,
    "end": 493,
    "speaker": "Neil Adams",
    "timestamp": "(01:17:55)",
    "text": "Well, I mean again, he could have probably in other contests, he’d hit me with it several times and I’ve just stopped it. Just at the wrong place at the right time for him. Right place in the wrong time for me. Right?"
  },
  {
    "start": 494,
    "end": 495,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:10)",
    "text": "That’s life. Yeah."
  },
  {
    "start": 496,
    "end": 497,
    "speaker": "Neil Adams",
    "timestamp": "(01:18:10)",
    "text": "Yeah."
  },
  {
    "start": 498,
    "end": 499,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:12)",
    "text": "All right, let’s watch some Teddy Riner."
  },
  {
    "start": 500,
    "end": 501,
    "speaker": "Neil Adams",
    "timestamp": "(01:18:17)",
    "text": "This is final of Paris tournament. And this is against the Korean. The Korean had had a great day, actually."
  },
  {
    "start": 502,
    "end": 503,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:29)",
    "text": "Again, shorter."
  },
  {
    "start": 504,
    "end": 505,
    "speaker": "Neil Adams",
    "timestamp": "(01:18:31)",
    "text": "Again, shorter. So he does find that difficult. Have a look at Teddy Riner. Teddy Riner will try and catch the sleeve. He’s after the sleeve and then the right arm over the top. That’s the key point for Teddy Riner. And of course, what he has done, if he can’t always catch the big Osoto Gari over, his right-hand side, he’s been doing something to the opposite side."
  },
  {
    "start": 506,
    "end": 507,
    "speaker": "Lex Fridman",
    "timestamp": "(01:19:01)",
    "text": "The Korean just went for a drop sail and Teddy Riner blocked with the hips."
  },
  {
    "start": 508,
    "end": 509,
    "speaker": "Neil Adams",
    "timestamp": "(01:19:12)",
    "text": "A big boy has difficulty always against somebody smaller dropping with the seoi nages."
  },
  {
    "start": 510,
    "end": 511,
    "speaker": "Lex Fridman",
    "timestamp": "(01:19:19)",
    "text": "Has Teddy Riner ever been thrown for ippon?"
  },
  {
    "start": 512,
    "end": 513,
    "speaker": "Neil Adams",
    "timestamp": "(01:19:22)",
    "text": "I’ve never seen his thrown ippon, but he was thrown last week for a nice technique and he’s being caught more and more."
  },
  {
    "start": 514,
    "end": 515,
    "speaker": "Lex Fridman",
    "timestamp": "(01:19:29)",
    "text": "So it’s getting close."
  },
  {
    "start": 516,
    "end": 517,
    "speaker": "Neil Adams",
    "timestamp": "(01:19:30)",
    "text": "And Tasoev, in the final of the world championships, they had a strange situation there where Tasoev was a technique down and then pulled off a counter. And they didn’t count it, but then they overruled it. Unfortunately, I was commentating at the time and I went for a score for Tasoev. Anyway, they overruled it and then they awarded a second gold medal to Tasoev."
  },
  {
    "start": 518,
    "end": 519,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:01)",
    "text": "What can you say about Tamerlan Bashaev who also gave him trouble?"
  },
  {
    "start": 520,
    "end": 521,
    "speaker": "Neil Adams",
    "timestamp": "(01:20:06)",
    "text": "Yeah, Bashaev and Tasoev are the two that could possibly go to the Olympics. That was a close one there from Riner, that was closest that he’d actually been there."
  },
  {
    "start": 522,
    "end": 523,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:16)",
    "text": "Oh, wow."
  },
  {
    "start": 524,
    "end": 525,
    "speaker": "Neil Adams",
    "timestamp": "(01:20:18)",
    "text": "Didn’t have the sleeve and he relies on the sleeve, greatly. Big support there in the French, in the crowd."
  },
  {
    "start": 526,
    "end": 527,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:26)",
    "text": "And also maybe can you explain the penalties for stalling?"
  },
  {
    "start": 528,
    "end": 529,
    "speaker": "Neil Adams",
    "timestamp": "(01:20:31)",
    "text": "Yeah, so if they don’t attack, if they’ve got a grip and they’ve got sleeve, lapel, or they’ve got two hands on. If they’re too passive and they don’t attack. If they’ve got dominant sleeve grip, they don’t attack. That was quite close as well from the Koreans. So the Korean here, you can see, is having a real go. The penalties will come if they don’t attack at the right time. Step outside the yellow area, they’ll get penalized as well."
  },
  {
    "start": 530,
    "end": 531,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:56)",
    "text": "That’s dedication for…"
  },
  {
    "start": 532,
    "end": 533,
    "speaker": "Neil Adams",
    "timestamp": "(01:20:59)",
    "text": "Absolutely. I mean it was really close, wasn’t it? They nice little kouchi gari there from the Korean. And if they touch below the belt line with the arms, they’re not allowed to grab the legs. They’ve stopped grabbing the legs."
  },
  {
    "start": 534,
    "end": 535,
    "speaker": "Lex Fridman",
    "timestamp": "(01:21:16)",
    "text": "Wow. The Koreans really going."
  },
  {
    "start": 536,
    "end": 537,
    "speaker": "Neil Adams",
    "timestamp": "(01:21:17)",
    "text": "The Koreans having a real good go at it."
  },
  {
    "start": 538,
    "end": 539,
    "speaker": "Lex Fridman",
    "timestamp": "(01:21:20)",
    "text": "I guess every single person in that division is probably training for Teddy Riner, right?"
  },
  {
    "start": 540,
    "end": 541,
    "speaker": "Neil Adams",
    "timestamp": "(01:21:24)",
    "text": "You think that Teddy Riner has been there a long time and he’s got another guy here in the final of the Paris tournament. He’s got 18,000 people watching him. They’re all on Teddy Riner’s side. They want him to win. And the Korean’s out there on his own with his coach."
  },
  {
    "start": 542,
    "end": 543,
    "speaker": "Lex Fridman",
    "timestamp": "(01:21:39)",
    "text": "But also the pressure on Teddy Riner."
  },
  {
    "start": 544,
    "end": 545,
    "speaker": "Neil Adams",
    "timestamp": "(01:21:43)",
    "text": "Amazing pressure. We interviewed him after this and he said, “I’ve got pressure. People go, well, is he going to do it at the Olympic Games? Can I do it in Paris?” He wanted to go to Paris. I mean really, the last Olympic Games should have been it, shouldn’t it? The last should have been the final one. But he’s gone, “No, I’ve got to do another four years.” Two penalties are on the board already for the Korean. That Korean is really having a great go on Teddy Riner."
  },
  {
    "start": 546,
    "end": 547,
    "speaker": "Lex Fridman",
    "timestamp": "(01:22:11)",
    "text": "He’s got a bit of a lift on him. He’s going after it."
  },
  {
    "start": 548,
    "end": 549,
    "speaker": "Neil Adams",
    "timestamp": "(01:22:14)",
    "text": "He’s really going after it. It’s an amazing effort there from the Korean. And he’s getting some last minute information. I don’t know if you’ve ever seen his coach, stood next to him like that. But it’s amazing. He’s six foot six and he’s about four foot six. He’s a real pitch."
  },
  {
    "start": 550,
    "end": 551,
    "speaker": "Lex Fridman",
    "timestamp": "(01:22:34)",
    "text": "Full of passion. I love it. He’s screaming."
  },
  {
    "start": 552,
    "end": 553,
    "speaker": "Neil Adams",
    "timestamp": "(01:22:37)",
    "text": "Golden score."
  },
  {
    "start": 554,
    "end": 555,
    "speaker": "Lex Fridman",
    "timestamp": "(01:22:38)",
    "text": "How does golden score work? Can you say?"
  },
  {
    "start": 556,
    "end": 557,
    "speaker": "Neil Adams",
    "timestamp": "(01:22:40)",
    "text": "So the golden score, if it goes without any point on the board from a throw or a hold down or arm lock strangle, then it goes into golden score. So two shidos on the board a piece, one more mistake now and it’s going to be all over. And that’s it."
  },
  {
    "start": 558,
    "end": 559,
    "speaker": "",
    "timestamp": "(01:22:57)",
    "text": "Teddy Riner just manages to turn it on the Korean. And that went really against the run of play, didn’t it? The Korean did better. But Teddy Riner is a winner. And he says, “Right, okay, let’s have more cheering.”"
  },
  {
    "start": 560,
    "end": 561,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:15)",
    "text": "Finds a way to score in the…"
  },
  {
    "start": 562,
    "end": 563,
    "speaker": "Neil Adams",
    "timestamp": "(01:23:18)",
    "text": "And I have to say, that even when he loses, he’s always graceful. He doesn’t like it, but he’s graceful."
  },
  {
    "start": 564,
    "end": 565,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:25)",
    "text": "Yeah, there was so much love there. Celebration. It’s great. It’s great to see. It’s great that he’s doing it again, going after it. Chasing the gold medal again."
  },
  {
    "start": 566,
    "end": 567,
    "speaker": "Neil Adams",
    "timestamp": "(01:23:33)",
    "text": "Well, he’s chasing the gold medal. It’s going to be in Paris, which is going to be even more fantastic. He’s already the greatest. You said, “What has he got to do to be the greatest?” He’s already the greatest competitor Judo’s ever known. And that was even with the great Tani. Tani was amazing, as well."
  },
  {
    "start": 568,
    "end": 569,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:56)",
    "text": "Are you part of the commentating team for Paris?"
  },
  {
    "start": 570,
    "end": 571,
    "speaker": "Neil Adams",
    "timestamp": "(01:23:58)",
    "text": "I’m part of the commentating team, but it won’t be for IJF because it’s independent broadcast."
  },
  {
    "start": 572,
    "end": 573,
    "speaker": "Lex Fridman",
    "timestamp": "(01:24:03)",
    "text": "Have you ever had an athlete come up to you and ask, “Why’d you say that?” Or disagree with your commentary?"
  },
  {
    "start": 574,
    "end": 575,
    "speaker": "Neil Adams",
    "timestamp": "(01:24:12)",
    "text": "I’ve got to say that 99.9% of everybody is so grateful that I’ve commentated their fights all the way through. They know if they’ve messed up. So if I say something and I’m never disparaging, really disparaging, but what I will say is, “It was a great throw by the other guy. Or it was a great match.” And if they made a mistake, so if they walk out, they know that I will say something that will mean something. Nobody really moans about it. I try and talk the truth, if I can."
  },
  {
    "start": 576,
    "end": 577,
    "speaker": "Lex Fridman",
    "timestamp": "(01:24:49)",
    "text": "So who else would you consider as some of the greats? So I personally, just because I love the seoi nage, Koga. So there’s the number of times you won the world championships and the Olympic Games, but there’s also how you won and how you wanted to fight and what you did. It’s not necessarily about getting gold medals, it’s about how you fought and how you represent the sport. There’s certain athletes, like Inoue and Iliadis, that are going after the big throws."
  },
  {
    "start": 578,
    "end": 579,
    "speaker": "Neil Adams",
    "timestamp": "(01:25:21)",
    "text": "Only after they want to win by ippon. And I think that that’s the difference is they’re the ones that come out there and it’s a bit like when Tyson stepped out there, you knew what you were going to get. And if they went toe-to-toe, if Tyson had somebody going toe-to-toe, somebody was going to get knocked out. We got the same in Judo, when people go head-to-head and it’s an open match and I often talk about an open match, I say, “It’s an open match. They’re both trying to score. Somebody is going to get scored on. Somebody’s going to go.” And that makes it exciting. When they come out and they close up, then that’s not an exciting match."
  },
  {
    "start": 580,
    "end": 581,
    "speaker": "Lex Fridman",
    "timestamp": "(01:26:02)",
    "text": "Is there a case for Ono? Shohei Ono, three-time world champ, two-time gold medalist?"
  },
  {
    "start": 582,
    "end": 583,
    "speaker": "Neil Adams",
    "timestamp": "(01:26:09)",
    "text": "I think that judo-wise, he’s got to be one of the greatest because he had such versatility. He could go right and he could go left. He could pick up. He could go to the ground as well. He won a lot of his earlier matches on the ground. I think his empathy and how he presents himself, sometimes he falls down. I think that hopefully that should come with tutoring and how to be a great champion after. It’s not just about what you do on the mat, but what you do off the mat as well."
  },
  {
    "start": 584,
    "end": 585,
    "speaker": "Lex Fridman",
    "timestamp": "(01:26:47)",
    "text": "To you a great champion is the whole package of how you present yourself when you lose? How you represent yourself just off the mat?"
  },
  {
    "start": 586,
    "end": 587,
    "speaker": "Neil Adams",
    "timestamp": "(01:26:55)",
    "text": "Yeah, I think it’s how you present yourself afterwards, how you are with people, how much you can help people. I mean, people, kids, and they look up to these great champions because they want to be like them. So the worst thing is when you get somebody that’s a bit of an ass and they’re not presenting themselves in the right way. So I like to see somebody presenting themselves in the right way. And I think that it’s something that can be taught. It’s something that normally comes with a little bit of experience and a little bit of age. I like to think that I’m a little bit different now than I was when I was 19. Not that I was bad, I just think I was just, I see it often now, just full of beans."
  },
  {
    "start": 588,
    "end": 589,
    "speaker": "Lex Fridman",
    "timestamp": "(01:27:40)",
    "text": "You’re a beautiful work in progress. What about Nomura, Tadahro Nomura, three-time gold medalist?"
  },
  {
    "start": 590,
    "end": 591,
    "speaker": "Neil Adams",
    "timestamp": "(01:27:50)",
    "text": "Never lost an Olympic fight."
  },
  {
    "start": 592,
    "end": 593,
    "speaker": "Lex Fridman",
    "timestamp": "(01:27:52)",
    "text": "There’s something there."
  },
  {
    "start": 594,
    "end": 595,
    "speaker": "Neil Adams",
    "timestamp": "(01:27:54)",
    "text": "Yeah, nobody ever done that. You know what I mean? So that’s got to be, it has to stand. He took two years off in between every Olympic Games and came back, did the right amount of events to qualify for not only did he having to qualify, he had to qualify through Japan. Now Japan, remember, have got the greatest depth. So they got people coming through all the time. And then he had to win the Japanese trials. I mean we had a four-time world champion from Japan."
  },
  {
    "start": 596,
    "end": 597,
    "speaker": "",
    "timestamp": "(01:28:25)",
    "text": "This is when World Championships was every other year. And this is Shozo Fujii and he was the greatest middleweight of all time and never got to participate in the Olympics because he lost the Japanese trials twice, in two Olympic possibilities. He had to qualify for Japan and then go to the Olympic Games and then do it there. Sometimes some of the best people in Japan can’t get outside of Japan. Look at the situation they had with Abe and then they had Maruyama. Maruyama and Abe were both the best. By far. In the under-66 kilos category. This is for the last Olympic Games. And they sent one to the world Championships one to the Olympic Games and they both won gold medals."
  },
  {
    "start": 598,
    "end": 599,
    "speaker": "Lex Fridman",
    "timestamp": "(01:29:21)",
    "text": "Yeah, that’s why the all Japan Championships is legendary, that there’s these battles with Dimash and all of them."
  },
  {
    "start": 600,
    "end": 601,
    "speaker": "Neil Adams",
    "timestamp": "(01:29:32)",
    "text": "Abe and Maruyama, they had trials in the Kodokan. It was 26 minutes, I think it was 26 minutes, it went. They were battling it out for 26 minutes."
  },
  {
    "start": 602,
    "end": 603,
    "speaker": "Lex Fridman",
    "timestamp": "(01:29:45)",
    "text": "That’s great. If we can just go to, you’ve trained in Japan. What are those randoris like? What’s that training like?"
  },
  {
    "start": 604,
    "end": 605,
    "speaker": "Neil Adams",
    "timestamp": "(01:29:54)",
    "text": "I touched on the danger. That danger of being thrown, when you get hold of somebody or somebody gets hold of you. And I often reflect-"
  },
  {
    "start": 606,
    "end": 607,
    "speaker": "Neil Adams",
    "timestamp": "(01:30:00)",
    "text": "Hold of somebody or somebody gets hold of you. I often reflect, and I often talk about it when I’m commentating because I can see immediately… It’s easy, isn’t it? In the commentary chair, or if you’re in the coach’s chair and you don’t really understand totally, absolutely what’s going on when somebody’s being out-gripped. When they’re in danger of being thrown, if you are in danger of being thrown, the first thing you do is stick your backside out and defend by not being in the position they want you to be in. All right? So that’s danger. You feel the danger. So in Japan, that was the place I used to go to train because I felt the danger, and so my defenses would be heightened. One Olympic cycle, I went two years, two months without having a score on me in any competition."
  },
  {
    "start": 608,
    "end": 609,
    "speaker": "",
    "timestamp": "(01:31:03)",
    "text": "Then I went to one competition in the European Championships, which I won, and I was struggling all the way through it and got scored on three times in my first pool of fights, and I was devastated. I actually nearly lost the whole competition because I was more mortified about being scored on three times when I hadn’t been scored on for 2 1/2 years. I had this thing in my head about 2 1/2 years, and then all of a sudden I’m not unbeatable and you go… I almost lost it, completely lost it. Just so fortunate, couple of things went my way and just came out, and I scraped and scratched my way to the final and won the final well, all right? But that was my best match, but I almost lost it."
  },
  {
    "start": 610,
    "end": 611,
    "speaker": "Lex Fridman",
    "timestamp": "(01:31:57)",
    "text": "Well, what do you do with the fact that if you go to Japan and you’re getting, you’re saying danger, you’re probably getting-"
  },
  {
    "start": 612,
    "end": 613,
    "speaker": "Neil Adams",
    "timestamp": "(01:32:02)",
    "text": "Getting thrown."
  },
  {
    "start": 614,
    "end": 615,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:03)",
    "text": "Getting thrown in Japan. What does that do to your ego?"
  },
  {
    "start": 616,
    "end": 617,
    "speaker": "Neil Adams",
    "timestamp": "(01:32:06)",
    "text": "Well, again, that was a winning ego that had to adapt. I remember we went to the kasejo, which police dojo one time, and they created this groundwork competition because they wanted to see me do the jiu-ji, how I went in and-"
  },
  {
    "start": 618,
    "end": 619,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:06)",
    "text": "The arm bar."
  },
  {
    "start": 620,
    "end": 621,
    "speaker": "Neil Adams",
    "timestamp": "(01:32:28)",
    "text": "Yeah, the arm bar, right? They wanted to see how I did it from underneath or over the top, and they just created this event."
  },
  {
    "start": 622,
    "end": 623,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:35)",
    "text": "Studied the creature."
  },
  {
    "start": 624,
    "end": 625,
    "speaker": "Neil Adams",
    "timestamp": "(01:32:36)",
    "text": "Yeah, they started it and then winner stays on competition was happening at the kasejo. So I did about seven, I think it was seven in, and then my coach came in and said, “No, it’s finished. That’s it now, it’s finished.” Suddenly we realized what was going on and I was going, “No, no, no, no, don’t stop it like that.” And it was one of those moments where the boot was on my foot, you could say, rather than the other side, the other way."
  },
  {
    "start": 626,
    "end": 627,
    "speaker": "",
    "timestamp": "(01:33:09)",
    "text": "Because I had been to Japan in situation… I remember as a sixteen-year-old, I got such such a drumming from one of the Japanese guys, older students. And he had a gold tooth. And so he was Gold Tooth to me and he was my nightmare. And I remember kept coming out to fight him because he kept throwing me and I was crying and I was upset and I was like… And then that was another occasion where I got dragged away and I said, “No.” So I wanted to go back and fight him. And I went back to the same dojo every year to fight him. He was on my mind morning, noon, night. He was on my mind."
  },
  {
    "start": 628,
    "end": 629,
    "speaker": "Lex Fridman",
    "timestamp": "(01:33:57)",
    "text": "Gold Tooth was on your mind."
  },
  {
    "start": 630,
    "end": 631,
    "speaker": "Neil Adams",
    "timestamp": "(01:33:58)",
    "text": "Gold tooth was on my mind."
  },
  {
    "start": 632,
    "end": 633,
    "speaker": "Lex Fridman",
    "timestamp": "(01:33:59)",
    "text": "Did you ever get him?"
  },
  {
    "start": 634,
    "end": 635,
    "speaker": "Neil Adams",
    "timestamp": "(01:34:01)",
    "text": "Two years later. Two years to me from 16 to 18 was totally different. 18 years of age I was pretty competitive with him. And it was like I was standing up with him. 19, he was in the groundwork competition."
  },
  {
    "start": 636,
    "end": 637,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:20)",
    "text": "And that’s when the switch happened."
  },
  {
    "start": 638,
    "end": 639,
    "speaker": "Neil Adams",
    "timestamp": "(01:34:22)",
    "text": "Switch happened. Because I just, well, because I remember getting the arm lock and didn’t put it on immediately. I needed it to last. It had to last."
  },
  {
    "start": 640,
    "end": 641,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:34)",
    "text": "Sure. It had to last."
  },
  {
    "start": 642,
    "end": 643,
    "speaker": "Neil Adams",
    "timestamp": "(01:34:35)",
    "text": "So I spread, the whole thing lasted as long as I could possibly get it. And it was a long memory as I was looking down at him."
  },
  {
    "start": 644,
    "end": 645,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:45)",
    "text": "And now he has nightmares about you."
  },
  {
    "start": 646,
    "end": 647,
    "speaker": "Neil Adams",
    "timestamp": "(01:34:47)",
    "text": "Now he has-"
  },
  {
    "start": 648,
    "end": 649,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:47)",
    "text": "I wonder what nickname he has for you."
  },
  {
    "start": 650,
    "end": 651,
    "speaker": "Neil Adams",
    "timestamp": "(01:34:49)",
    "text": "I don’t know, I’m hoping that he remembers me."
  },
  {
    "start": 652,
    "end": 653,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:53)",
    "text": "He has a photo of you."
  },
  {
    "start": 654,
    "end": 655,
    "speaker": "Neil Adams",
    "timestamp": "(01:34:54)",
    "text": "Do you know what? He probably doesn’t say, just bat an eyelid, doesn’t say a thing about it."
  },
  {
    "start": 656,
    "end": 657,
    "speaker": "Lex Fridman",
    "timestamp": "(01:35:01)",
    "text": "I mean, can you just speak to that training with those folks? You said crying, just the frustration of being thrown. It’s such a beautiful part of the process of becoming great."
  },
  {
    "start": 658,
    "end": 659,
    "speaker": "Neil Adams",
    "timestamp": "(01:35:16)",
    "text": "Yeah, I think it is just something that doesn’t happen at this level. We were talking about levels and then at this level it never happened. And then I went out in my first European cadet and all of a sudden I wasn’t this top guy. I was in the mix. And then I had to work myself to the top of that mix and then to the top of the next one because I went to the European Senior Championships."
  },
  {
    "start": 660,
    "end": 661,
    "speaker": "",
    "timestamp": "(01:35:45)",
    "text": "And again, you’re not the top and you’ve worked your way to the top of that. I think it is a frustration, but I think it’s that kind of hatred of losing and also being out of control. I think that the first Senior European Championships I fought Nevzorov, but he was only one of my contests. Then I had to fight a Frenchman for third place. But he totally out-gripped me. And I remember I was more upset though I won the contest, I was more upset that he totally out… He did out-grip me and I was more upset. And then I fought him a year later and out-gripped him. All right. So it was one of those, it was a learning process all the way through."
  },
  {
    "start": 662,
    "end": 663,
    "speaker": "Lex Fridman",
    "timestamp": "(01:36:36)",
    "text": "That frustration is like, whatever that does to your soul, the building up afterwards is what actually makes you better. It’s fascinating. And do you think there’s, in Japan, just killers there that the world doesn’t know about, that just-"
  },
  {
    "start": 664,
    "end": 665,
    "speaker": "Neil Adams",
    "timestamp": "(01:36:56)",
    "text": "Yeah, there’s world champions in the dojo. There’s people that never make it out. I remember we were training and everybody that goes to Japan, all my friends that have been world Olympic champions, they all know what I’m talking about. They know exactly what I’m saying, is that when we go to the dojos there, we all get thrown by people that never come out to be world champions. They’re just in the mix or they’re going through three years of university and then they go. We had a guy that came in, he was a business guy. He came in with his suitcase and his briefcase like that. He’s got his tie up like that. So he decides he’s going to come in and he gets changed and he’s in his lunch hour, he’s in his lunch hour, so it’s got to be quick. So he comes in and he goes through, he’s working his way through the whole of the British team. We’re all lined up. So he’s just working his way through the whole of the British team. And I knew it was my turn next."
  },
  {
    "start": 666,
    "end": 667,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:01)",
    "text": "In his lunch hour."
  },
  {
    "start": 668,
    "end": 669,
    "speaker": "Neil Adams",
    "timestamp": "(01:38:01)",
    "text": "So I get hold of him and I throw him immediately. And then it was what we were talking about when it happens in the first few seconds of the practice. So then I had four minutes of him coming at me and I’m going up into the air and I’m twisting off. And then everybody’s laughing at the side of the mat or the whole British team. He’s gone through the whole British team and then 10 minutes later he’s tying his tie up like that. And back to work like that. Imagine him sitting behind his desk at his computer."
  },
  {
    "start": 670,
    "end": 671,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:37)",
    "text": "Yeah. Yeah."
  },
  {
    "start": 672,
    "end": 673,
    "speaker": "Neil Adams",
    "timestamp": "(01:38:40)",
    "text": "I’m glad he didn’t get out."
  },
  {
    "start": 674,
    "end": 675,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:44)",
    "text": "Hopefully he listens to this."
  },
  {
    "start": 676,
    "end": 677,
    "speaker": "Neil Adams",
    "timestamp": "(01:38:46)",
    "text": "Hopefully."
  },
  {
    "start": 678,
    "end": 679,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:48)",
    "text": "Anybody else I didn’t mention as part of the greats that just kind of jumped-"
  },
  {
    "start": 680,
    "end": 681,
    "speaker": "Neil Adams",
    "timestamp": "(01:38:51)",
    "text": "Kashiwazaki Sensei is my favorite of all favorites. He is what I would call a judo genius. I don’t know if you can get him up here. Can we get him up?"
  },
  {
    "start": 682,
    "end": 683,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:52)",
    "text": "Yeah."
  },
  {
    "start": 684,
    "end": 685,
    "speaker": "Neil Adams",
    "timestamp": "(01:39:06)",
    "text": "So go into 1981 World Championships and I’ll talk you through the great Kashiwazaki. He was one year in Great Britain and he was a guy that was so much a genius… So you want the final of the under 60, 65 kilograms. There. The one at the top. This is him. He’s two weight categories below my weight category that I won the World championships. Same year I won it. So I’m not sure if this is going to show his final of-"
  },
  {
    "start": 686,
    "end": 687,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:45)",
    "text": "This is a highlight."
  },
  {
    "start": 688,
    "end": 689,
    "speaker": "Neil Adams",
    "timestamp": "(01:39:46)",
    "text": "Oh, watch this. This he did in the-"
  },
  {
    "start": 690,
    "end": 691,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:46)",
    "text": "What?"
  },
  {
    "start": 692,
    "end": 693,
    "speaker": "Neil Adams",
    "timestamp": "(01:39:50)",
    "text": "Final of the World-"
  },
  {
    "start": 694,
    "end": 695,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:52)",
    "text": "For people just listening, he did an incredible sacrifice throw."
  },
  {
    "start": 696,
    "end": 697,
    "speaker": "Neil Adams",
    "timestamp": "(01:39:56)",
    "text": "And then he was on top for the newaza, and renowned for his groundwork and he was on top of… Against a really strong Romanian guy, so his transition was just phenomenal."
  },
  {
    "start": 698,
    "end": 699,
    "speaker": "Lex Fridman",
    "timestamp": "(01:40:11)",
    "text": "Yeah, let me go back and look at that, what just happened?"
  },
  {
    "start": 700,
    "end": 701,
    "speaker": "Neil Adams",
    "timestamp": "(01:40:14)",
    "text": "So he’s just showing you… So he does this koji thing just to create space and it’s his follow through into groundwork that is best of all. And then the Romanian, really strong, like I say, he’d gone all the way through to the final of the world championships, winning most by ippon I think, the Romanian. And he’s defending really, really well here. And you can see how persistent, he knows exactly what he wants. He’s just got to get his leg out. Now watch, he tied the arm up and then he’ll pull the top leg towards him and then he’ll push the bottom one off-"
  },
  {
    "start": 702,
    "end": 703,
    "speaker": "Lex Fridman",
    "timestamp": "(01:40:56)",
    "text": "Always working."
  },
  {
    "start": 704,
    "end": 705,
    "speaker": "Neil Adams",
    "timestamp": "(01:40:56)",
    "text": "With both feet. Always working, always working. Readjust the balance. Still one leg trapped. Final of the World Championships. Good referee because he’s refereeing something here that’s happening that’s going to decide as to whether, so he doesn’t call it to stand it up at all. Watch him pull the top one now and he’ll push the bottom one."
  },
  {
    "start": 706,
    "end": 707,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:19)",
    "text": "There’s a calmness on his face, which is great to see."
  },
  {
    "start": 708,
    "end": 709,
    "speaker": "Neil Adams",
    "timestamp": "(01:41:22)",
    "text": "Calm. Pushes the bottom leg, leg out, job done. All finished. This is him again, watch this. This is another technique that he does."
  },
  {
    "start": 710,
    "end": 711,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:33)",
    "text": "The sacrifice."
  },
  {
    "start": 712,
    "end": 713,
    "speaker": "Neil Adams",
    "timestamp": "(01:41:34)",
    "text": "And then just again, sacrifice directly in, directly into the newaza."
  },
  {
    "start": 714,
    "end": 715,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:40)",
    "text": "Transition is everything, isn’t it?"
  },
  {
    "start": 716,
    "end": 717,
    "speaker": "Neil Adams",
    "timestamp": "(01:41:42)",
    "text": "In judo."
  },
  {
    "start": 718,
    "end": 719,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:43)",
    "text": "Yeah. Well, in anything really, but judo it especially pays off."
  },
  {
    "start": 720,
    "end": 721,
    "speaker": "Neil Adams",
    "timestamp": "(01:41:49)",
    "text": "Yeah, I mean because we haven’t got that long. I mean we had more time here, they’ve just brought more time back. So we’ve got more time to transition in and to get the situation that we want and to get the attacking situation that we want. Because I remember I was teaching in America to some jiu-jitsu guys, and they were saying, “Oh, we’d never give you our back.” And I said, “With judo rules, certain situations it happens that when we try and do throws where we’re facing away from our opponent.” So for example, seonages, if they fail, then the back is there and that’s how we get the back. And it’s a different situation than going on your back in the guard situation. Totally different."
  },
  {
    "start": 722,
    "end": 723,
    "speaker": "Lex Fridman",
    "timestamp": "(01:42:38)",
    "text": "Well, Travis Stevens, I don’t know how familiar you are with his judo, but he’s a really interesting example. He competed at the highest level in Jiu-Jitsu as well. And his idea, he’s a big seonage guy, and he basically threw all of that away."
  },
  {
    "start": 724,
    "end": 725,
    "speaker": "Neil Adams",
    "timestamp": "(01:42:38)",
    "text": "In the jiu-jitsu ?"
  },
  {
    "start": 726,
    "end": 727,
    "speaker": "Lex Fridman",
    "timestamp": "(01:42:55)",
    "text": "In the jiu-jitsu . He took the sport from scratch for what it is. So he almost never did a standing seonages at all in jiu-jitsu."
  },
  {
    "start": 728,
    "end": 729,
    "speaker": "Neil Adams",
    "timestamp": "(01:43:07)",
    "text": "No, because it would leave his back all the time if it failed. But he wouldn’t have the same kind of grip on the Judo gi or the jiu-jitsu gi. A little bit different."
  },
  {
    "start": 730,
    "end": 731,
    "speaker": "Lex Fridman",
    "timestamp": "(01:43:20)",
    "text": "And so you have to kind of consider the sport, the art of it, and also the competitors, the styles and the culture of the sport. If you want to win, if winning is the most important thing, then like, “All right, well, let’s-“"
  },
  {
    "start": 732,
    "end": 733,
    "speaker": "Neil Adams",
    "timestamp": "(01:43:31)",
    "text": "But you learn the game, don’t you? And that’s what he did. He learned the game. And I think that is credit to him. And that’s why I was saying about wrestling, the wrestlers, I mean, good to learn the judo and for what it is and the mechanics and how it works. And then learn the wrestling. I mean, I do the commentary as well for the freestyle, and I will be at the Olympics for the freestyle and the Greco-Roman. And I love the freestyle, absolutely love it. But freestyle is freestyle. Judo is judo. I like to see people doing judo."
  },
  {
    "start": 734,
    "end": 735,
    "speaker": "Lex Fridman",
    "timestamp": "(01:44:05)",
    "text": "Yeah, but there’s a rhyme to the whole combat thing. They’re all, I mean, the body mechanics, it’s all fascinating echoes of each other in interesting ways. The details are different, but there’s still two humans clashing."
  },
  {
    "start": 736,
    "end": 737,
    "speaker": "Neil Adams",
    "timestamp": "(01:44:24)",
    "text": "Yeah, we’ve got some amazing crossovers with people like the Mongolians that have come in, with the Georgians. The Georgians do massive pickups and different techniques. And if you ask the fighters whether grabbing the legs, a lot of them would say some of the wrestling styles, the Georgians and the Mongolians might say, “Yeah, I’d like to be able to take the legs.” But a lot of them just adapted. You get Iliadis, for example, he just adapted. So he thought, “Well, I’ll take my arm over the top and I’ll just rip them out the floor that way.” You know what I mean?"
  },
  {
    "start": 738,
    "end": 739,
    "speaker": "Lex Fridman",
    "timestamp": "(01:45:05)",
    "text": "They’re still doing the big lifts, they’re still doing the big gripping, but they just don’t grab below the legs. It’s weird. They figured it out."
  },
  {
    "start": 740,
    "end": 741,
    "speaker": "Neil Adams",
    "timestamp": "(01:45:14)",
    "text": "And they figured it out like that."
  },
  {
    "start": 742,
    "end": 743,
    "speaker": "Lex Fridman",
    "timestamp": "(01:45:16)",
    "text": "Yeah, you would think it’d take a long time. No, it was like a month."
  },
  {
    "start": 744,
    "end": 745,
    "speaker": "Neil Adams",
    "timestamp": "(01:45:20)",
    "text": "Yeah. No, exactly."
  },
  {
    "start": 746,
    "end": 747,
    "speaker": "Lex Fridman",
    "timestamp": "(01:45:23)",
    "text": "The highest level, which is crazy. So you mentioned jiu-jitsu a little bit. What to you is an interesting difference between jiu-jitsu and judo that you’ve observed? Because you’re one of the greatest ever on the ground in judo. And so jiu-jitsu is primarily focused on similar type of stuff on the ground. So what to you is an interesting difference there?"
  },
  {
    "start": 748,
    "end": 749,
    "speaker": "Neil Adams",
    "timestamp": "(01:45:49)",
    "text": "They’re a different approach, different timescale to them, and they have a different way in. So [inaudible 01:45:57] ours comes from a standing position directly in, we’ve got a timescale on it so we have to, like the catch, I always talk about the catch. Because in judo terms, if you don’t get the catch immediately, then the referee won’t see the transition in. And also the continuation from plan A, B, C, D if something builds. So we have to build it and we have to build it quickly. And I think in jiu-jitsu terms, you have more time to build."
  },
  {
    "start": 750,
    "end": 751,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:32)",
    "text": "Yeah, there’s a kind of patience like, “Oh, if this doesn’t work out, I can try a different thing.” With Judo, there’s an urgency."
  },
  {
    "start": 752,
    "end": 753,
    "speaker": "Neil Adams",
    "timestamp": "(01:46:39)",
    "text": "There’s an urgency."
  },
  {
    "start": 754,
    "end": 755,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:41)",
    "text": "And there’s a ref watching skeptically. So you better show that you’re making progress."
  },
  {
    "start": 756,
    "end": 757,
    "speaker": "Neil Adams",
    "timestamp": "(01:46:47)",
    "text": "You’ve got to show the progression. And that’s why I always had a plan A, B, C. You see there with… That was 1981 there, the great Kashiwazaki had a progression. Everything was, he knew exactly where he had to be. It was feel. That wasn’t by accident, it was trained. And I think that that transition there and taking control of somebody’s mistake, so somebody might have made a mistake or not hit properly, or your defense has caused them to make a mistake and then you take advantage of it. And that is the difference."
  },
  {
    "start": 758,
    "end": 759,
    "speaker": "Lex Fridman",
    "timestamp": "(01:47:25)",
    "text": "So one of the side effects of that, I don’t know with the chicken or the egg, but judo people on the ground are much more aggressive. So probably because of the urgency, but there’s an intention behind the progress you’re making. I think jiu-jitsu is more relaxed. There’s more a culture of just finding places to relax and think of different control and positions and take your time. And as a result, it’s much, much less exhausting. So you can go for much longer. It feels like judo is exhausting."
  },
  {
    "start": 760,
    "end": 761,
    "speaker": "Neil Adams",
    "timestamp": "(01:48:02)",
    "text": "It’s that ten second blast, isn’t it? It’s like doing sprints all the time. And that is really hard. And that’s a special kind of condition you need and you need to be able to catch it and know when to go and when not to go. And I think also, I was going to ask you, you think it’d make a difference, I mean, certain jiu-jitsu, you can’t just throw yourself on your back into the guard. You have to throw into the situation. You have got, I mean, I know Roger Gracie, he decided that he was going to learn judo. He saw the importance of being able to throw for the transition in, and so he came to the budokai and he was learning off Ray Stevens, and they were doing really a lot-"
  },
  {
    "start": 762,
    "end": 763,
    "speaker": "Lex Fridman",
    "timestamp": "(01:48:50)",
    "text": "Well, he’s a fascinating study because he does the most basic stuff and he does-"
  },
  {
    "start": 764,
    "end": 765,
    "speaker": "Neil Adams",
    "timestamp": "(01:48:55)",
    "text": "Does it well."
  },
  {
    "start": 766,
    "end": 767,
    "speaker": "Lex Fridman",
    "timestamp": "(01:48:56)",
    "text": "He did another level of wow, it’s like Yamashita, everyone knows what’s coming with Roger Gracie, but he just does it anyway. I guess the best people in the world. It’s crazy. He’s like, everybody in jiu-jitsu at White Belt learns the techniques he’s using, and he just does it."
  },
  {
    "start": 768,
    "end": 769,
    "speaker": "Neil Adams",
    "timestamp": "(01:49:14)",
    "text": "Amazing, isn’t it? But he has about a thousand ways in."
  },
  {
    "start": 770,
    "end": 771,
    "speaker": "Lex Fridman",
    "timestamp": "(01:49:17)",
    "text": "Yeah, yeah. I mean, and the thousand ways there’s in the details, so it kind of might even look the same to people. But he finds a way to choke people. So he’s on top of them, mounted in a sort of judo pin position, and everyone knows what’s coming next against the best people in the world, and you should be able to defend it, but nobody can, it’s crazy."
  },
  {
    "start": 772,
    "end": 773,
    "speaker": "Neil Adams",
    "timestamp": "(01:49:40)",
    "text": "I think there’s the power element as well, that you don’t realize how when somebody’s directed in a particular way, then you have that kind of element of absolute power that you can only feel, like when Roger’s doing a technique, I think that you would only feel it if he did it on you, then you can feel it. It’s not something that happens… So tricks is one thing, but actually being able to do something really well from a power point of view. Like you say, he only does those few things, but he does them really, really, really well."
  },
  {
    "start": 774,
    "end": 775,
    "speaker": "Lex Fridman",
    "timestamp": "(01:50:20)",
    "text": "Yeah, I don’t know what that is about. Actually, judo pins is a very interesting case study as well, because people are able to feel so heavy. One of the things judoka are able to do is pin extremely well, and it makes you realize that it’s not about the weight, it’s about some kind of technique that makes people feel like they weigh a thousand pounds."
  },
  {
    "start": 776,
    "end": 777,
    "speaker": "Neil Adams",
    "timestamp": "(01:50:43)",
    "text": "It’s about weight distribution and change of balance. A lot of people don’t realize that there’s huge changes of balance on the ground. Massive. You know what it’s like. I mean, you’re a jiu-jitsu man. And the detail of the techniques is what really interests me. I mean, I’m always looking, small ideas. I’m always looking at the jiu-jitsu and it fascinates me. I would’ve done jiu-jitsu for sure, but I wouldn’t have forgotten the judo way in to the techniques. I mean, I think you’ve got to differentiate the two, but I would’ve loved the jiu-jitsu. I would’ve absolutely loved it, but it wasn’t as prominent then. Where the newaza came from, it came from a mistake, me getting beaten in a particular contest and I went, “I’m not going to be beaten again on the ground.” That’s how it happened."
  },
  {
    "start": 778,
    "end": 779,
    "speaker": "Lex Fridman",
    "timestamp": "(01:51:44)",
    "text": "Yeah. Well, yeah, the story of your life is like a loss creates, the phoenix rises."
  },
  {
    "start": 780,
    "end": 781,
    "speaker": "Neil Adams",
    "timestamp": "(01:51:52)",
    "text": "It was 1978, and it wasn’t a mistake. It was a particular movement. And I was fighting weight up from my normal weight, but I stayed in the same position for one second too long, got caught and-"
  },
  {
    "start": 782,
    "end": 783,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:10)",
    "text": "Choked?"
  },
  {
    "start": 784,
    "end": 785,
    "speaker": "Neil Adams",
    "timestamp": "(01:52:11)",
    "text": "Sangaku, yeah. Triangle. Triangle, triangle."
  },
  {
    "start": 786,
    "end": 787,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:13)",
    "text": "Wow."
  },
  {
    "start": 788,
    "end": 789,
    "speaker": "Neil Adams",
    "timestamp": "(01:52:14)",
    "text": "And I said, I literally just the same as I said to you, when I said, “I’m not going to drink anymore,” I came off and I said, “I’m never going to get caught on the ground again.”"
  },
  {
    "start": 790,
    "end": 791,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:27)",
    "text": "Never lose on the ground ever."
  },
  {
    "start": 792,
    "end": 793,
    "speaker": "Neil Adams",
    "timestamp": "(01:52:27)",
    "text": "And I never lost in my whole competitive career again."
  },
  {
    "start": 794,
    "end": 795,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:32)",
    "text": "But yeah, I shouldn’t mention that there’s nothing like a pin from a judo person. And I don’t actually know if people in jiu-jitsu have made sense of that, loaded that in."
  },
  {
    "start": 796,
    "end": 797,
    "speaker": "Neil Adams",
    "timestamp": "(01:52:44)",
    "text": "But it’s not part of the game, is it? The pin? It’s submission."
  },
  {
    "start": 798,
    "end": 799,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:50)",
    "text": "Yeah, but control is part of the game, and nobody controls a human body the way judo people do on the ground. They have understood the science of control. And I think that control is extremely useful in jiu-jitsu as well, it’s just that people don’t… There’s so many other domains of exploration."
  },
  {
    "start": 800,
    "end": 801,
    "speaker": "Neil Adams",
    "timestamp": "(01:53:13)",
    "text": "That’s interesting."
  },
  {
    "start": 802,
    "end": 803,
    "speaker": "Lex Fridman",
    "timestamp": "(01:53:14)",
    "text": "I mean, just especially when you apply jiu-jitsu to the fighting setting of mixed martial arts, that control, that side control, that pin control, is really, really, really important. But then you add punching to the thing and it becomes-"
  },
  {
    "start": 804,
    "end": 805,
    "speaker": "Neil Adams",
    "timestamp": "(01:53:30)",
    "text": "Puts a whole different thing on it, doesn’t it?"
  },
  {
    "start": 806,
    "end": 807,
    "speaker": "Lex Fridman",
    "timestamp": "(01:53:32)",
    "text": "I mean, there’s an alternate history where you would’ve been part of the early UFCs if time was a little different maybe a few years later, because your style of judo and jiu-jitsu and the transitions and the aggression, all of that would’ve worked really well in the early UFCs."
  },
  {
    "start": 808,
    "end": 809,
    "speaker": "Neil Adams",
    "timestamp": "(01:53:53)",
    "text": "I’m sure I was being set up at one stage by one of the Graces, and that was when he was winning all the matches. But he came in with a couple of the cousins to one of my seminars, and he was one of the first ones, wasn’t he, that… That’s how I love to see the kind of UFC, because it was different martial arts, different skills. And he’d get close and he’d just choke them out or arm lock them or arm bar them. And that was brilliant for me. That was a revelation. That was how I saw it."
  },
  {
    "start": 810,
    "end": 811,
    "speaker": "Lex Fridman",
    "timestamp": "(01:54:34)",
    "text": "It’s a fascinating science experiment, which aspects of different martial arts work well and not, when they clash together. And it did turn out that Newaza worked-"
  },
  {
    "start": 812,
    "end": 813,
    "speaker": "Neil Adams",
    "timestamp": "(01:54:45)",
    "text": "Was the key. Yeah, it was the key, wasn’t it?"
  },
  {
    "start": 814,
    "end": 815,
    "speaker": "Lex Fridman",
    "timestamp": "(01:54:46)",
    "text": "Yeah, it was a big missing link in our conception of fighting. It’s the neutralizer of size, and a lot of other components. It just blew people’s mind. “Oh, okay. It’s not just about size. It’s not just about big guys swinging hands. It’s a lot of other components, and the groundwork is really, really important.” And of course, there’s a few judoka that succeeded in the UFC since then, which is always interesting how they adapt. When you take off the gi, how can you still throw people? How can you still do control? How can you still take advantage of the transition on the ground? Ronda Rousey is a good example of somebody that took advantage of that."
  },
  {
    "start": 816,
    "end": 817,
    "speaker": "Neil Adams",
    "timestamp": "(01:55:29)",
    "text": "Yeah, I think one of the biggest things for the judoka is we’ve never… There’s no strikes, and I think that’s the biggest shock, if you wish, when you get one-"
  },
  {
    "start": 818,
    "end": 819,
    "speaker": "Lex Fridman",
    "timestamp": "(01:55:29)",
    "text": "Yeah, punched in the face."
  },
  {
    "start": 820,
    "end": 821,
    "speaker": "Neil Adams",
    "timestamp": "(01:55:44)",
    "text": "You get punched in the face and you’re not used to that. That’s not what we’re used to."
  },
  {
    "start": 822,
    "end": 823,
    "speaker": "Lex Fridman",
    "timestamp": "(01:55:52)",
    "text": "Some people are able to get punched in the face better than others, for sure. Then again, there’s Ronda Rousey who doesn’t need to get punched in the face. She just gets in close, throws a person, arm bar right there."
  },
  {
    "start": 824,
    "end": 825,
    "speaker": "Neil Adams",
    "timestamp": "(01:56:03)",
    "text": "And Kayla-"
  },
  {
    "start": 826,
    "end": 827,
    "speaker": "Lex Fridman",
    "timestamp": "(01:56:06)",
    "text": "Kayla Harrison, that’s another incredible person. She could have probably been just winning Olympic gold medal after Olympic gold medal, but chose to-"
  },
  {
    "start": 828,
    "end": 829,
    "speaker": "Neil Adams",
    "timestamp": "(01:56:13)",
    "text": "Whatever she decides. I mean, Ronda as well, whatever they decided to do they’re great athletes. They hate losing. I don’t know anybody that hates losing more than those two. They don’t like it."
  },
  {
    "start": 830,
    "end": 831,
    "speaker": "Lex Fridman",
    "timestamp": "(01:56:27)",
    "text": "And Kayla Harrison, I don’t know anybody that works as hard as her. That’s a crazy, crazy, crazy work ethic. Well, let me ask you about training again, Jimmy Pedro said he learned a lot from you. He learned how to do a tight ocean, the arm bar Jujigatame, but he also learned from you training methodology. So what’s he talking about? He told me about this. What’s your approach to training throughout your career and as it developed?"
  },
  {
    "start": 832,
    "end": 833,
    "speaker": "Neil Adams",
    "timestamp": "(01:56:57)",
    "text": "I always wanted to train harder than anybody else. I still train now every day. If I don’t train, do something, I do an hour of my physical work, and I still go on the mat a little bit. I’m 65 now. And so I’m not doing really heavy stuff on the mat, but I still like to train. And when I was 21, 20 up to 30, I was one of the best trainers. But Jimmy Pedro was one of the best trainers as well. He’s one of your dream athletes. When Jimmy Pedro steps through your door, and he was just a kid. He was just young when he stepped through my door, and I had a lot of full-time trainers, so I had up to 20 really good athletes that were training hard. And I only wanted hard trainers. Give me 10 that train hard rather than your one pre-Madonna that you’re skillful, the one that could do it. I wanted 10 or 20 really hard trainers because you can do so much with them. You can make champions, you can make them world champions. If you’ve got somebody that was a special talent and they wanted to work hard, then you had a special athlete."
  },
  {
    "start": 834,
    "end": 835,
    "speaker": "Lex Fridman",
    "timestamp": "(01:58:14)",
    "text": "When you say hard trainers, what do you mean? Are these people that just every single day are able to just grind it out, do [inaudible 01:58:21], do the training, do the boring things, just keep coming back-"
  },
  {
    "start": 836,
    "end": 837,
    "speaker": "Neil Adams",
    "timestamp": "(01:58:24)",
    "text": "Yeah, when the going gets tough. And I think that was him. He had a special mentality. And the thing is, you see when you’ve got him in your dojo, even when you’re tired, when somebody’s tired, what an example to the others. So he’d pull the other ones in as well. So I had somebody that when everybody was tired and everybody was sick of it, and everybody just wanted… And he’d still be there, so they had to do it. So that was for me, a win-win. So I had all the Americans, actually, I had Bobby Berland, and I had Michael Swain, and I had Ed Liddie, and I had them all coming to visit me at different times. Jimmy was there, they wanted to be the best. In the end we had such a great club atmosphere. They wanted to come for the hard work, and they knew that if they came, they were going to be dragged out and we were going to do physical training. And it was physical training like they hadn’t done before. But it wasn’t just the physical training, it was the judo and the skill side of it as well. And so I always had a great empathy with the U.S. team. Olympic team. So a lot of your Olympic medalists have been through with me. And so I’m proud of that because we had some great times and they’re still great mates now. And so in New York, in a couple of weeks time, I’m going to have, everybody is going to be there. They’re all coming in."
  },
  {
    "start": 838,
    "end": 839,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:00)",
    "text": "All old friends."
  },
  {
    "start": 840,
    "end": 841,
    "speaker": "Neil Adams",
    "timestamp": "(02:00:01)",
    "text": "All old friends."
  },
  {
    "start": 842,
    "end": 843,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:01)",
    "text": "And new friends. So what’s."
  },
  {
    "start": 844,
    "end": 845,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:00)",
    "text": "Old friends."
  },
  {
    "start": 846,
    "end": 847,
    "speaker": "Neil Adams",
    "timestamp": "(02:00:01)",
    "text": "All old friends."
  },
  {
    "start": 848,
    "end": 849,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:01)",
    "text": "And new friends. So what’s a tough week look like at your peak physical training, Randori? Is there days off? Are you training twice a day?"
  },
  {
    "start": 850,
    "end": 851,
    "speaker": "Neil Adams",
    "timestamp": "(02:00:14)",
    "text": "Twice a day. So we do the preparation training, we do the running, we do the weight training, we do the skills in the morning as well. The skills is, for me, one of the biggest advantages that any full-time trainers can have, because what happens is that with most clubs, you’re trying to fit everything into that hour and a half or two hours. You fit your skills, you fit your physical training and your sparring and everything’s in there, all grouped in. So the biggest advantages of having a full-time group is that you can split your skills and your skills lay your foundation. So the biggest advantage is being able to work specifically on things without having to worry about getting to do your Randori or your sparring, then you’ve got to go out for… You just do the skills."
  },
  {
    "start": 852,
    "end": 853,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:11)",
    "text": "Well, when you talk about skills, say your specialty is a Tai otoshi, are we talking about Uchikomi, working with bands? Are you doing throws? Are you actually just having conversations about specific tiny details of throws? What does skills mean?"
  },
  {
    "start": 854,
    "end": 855,
    "speaker": "Neil Adams",
    "timestamp": "(02:01:27)",
    "text": "All those things about doing your repetition practice, making sure the repetition is correct, there’s good repetition."
  },
  {
    "start": 856,
    "end": 857,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:34)",
    "text": "So when we say good repetition, Uchikomi when you’re just fitting the throw versus doing the throw? Where do you land on the value of both?"
  },
  {
    "start": 858,
    "end": 859,
    "speaker": "Neil Adams",
    "timestamp": "(02:01:41)",
    "text": "I’m getting it moving. So one of the biggest, most important things is getting it moving. If we do something static, again, it’s that static target. You need to get it moving. So you need to do a repetition and also you need to do a correct repetition because if you’re doing 100 repetitions that are not correct and repetitions under pressure, too much pressure, without somebody overseeing those skills to make sure that you correct the skills. Because if you’re doing a skill, if you’re doing it 99 times incorrectly, then repetition doesn’t make perfect. Repetition makes permanent, so you’re going to make it as perfect as you possibly can. So actually that skills group there is the most important thing. And what I used to do is oversee it. So I’d oversee it to make sure that it was done properly."
  },
  {
    "start": 860,
    "end": 861,
    "speaker": "Lex Fridman",
    "timestamp": "(02:02:33)",
    "text": "So you’re watching the footwork, you’re watching the gripping-"
  },
  {
    "start": 862,
    "end": 863,
    "speaker": "Neil Adams",
    "timestamp": "(02:02:37)",
    "text": "Everything."
  },
  {
    "start": 864,
    "end": 865,
    "speaker": "Lex Fridman",
    "timestamp": "(02:02:37)",
    "text": "…and then just constantly adjusting the people."
  },
  {
    "start": 866,
    "end": 867,
    "speaker": "Neil Adams",
    "timestamp": "(02:02:40)",
    "text": "I’ll give you an example, Jimmy Pedro. Jimmy was one of the hardest when he was 19 years of age, he’s always asking me to practice always. So he’s always on me all the time. So I do groundwork with him could I put him on his back? No, I was all on him and he’ll tell you, but he just wouldn’t go. He was going to be great, without a doubt. So I wanted everybody on with him, everybody. So everybody went on with him. And so it only improved their game and it improved him. And then small technical things that have stayed with him that we were doing with the Juji Gatame that was passed on to Kayla and then gone on to Ronda and it’s all small things that I can see sometimes that it’s passed on."
  },
  {
    "start": 868,
    "end": 869,
    "speaker": "Lex Fridman",
    "timestamp": "(02:03:30)",
    "text": "What about the Tai Otoshi? He said he learned a lot from you from that."
  },
  {
    "start": 870,
    "end": 871,
    "speaker": "Neil Adams",
    "timestamp": "(02:03:34)",
    "text": "And he does it differently."
  },
  {
    "start": 872,
    "end": 873,
    "speaker": "Lex Fridman",
    "timestamp": "(02:03:35)",
    "text": "And so I should mention that’s one of the trickier throw… I mean, I still don’t understand."
  },
  {
    "start": 874,
    "end": 875,
    "speaker": "Neil Adams",
    "timestamp": "(02:03:42)",
    "text": "It is a tricky throw."
  },
  {
    "start": 876,
    "end": 877,
    "speaker": "Lex Fridman",
    "timestamp": "(02:03:43)",
    "text": "I don’t understand. So for people who don’t know, boy, how would you even explain it? It doesn’t make any sense. When you just look solo, the movement you make is quite simple, but how you get a person to be off balance, how you actually get them to be thrown. And when you do throw it successfully, it looks like a whipping motion that’s effortless. It makes no sense."
  },
  {
    "start": 878,
    "end": 879,
    "speaker": "Neil Adams",
    "timestamp": "(02:04:11)",
    "text": "It makes no sense other than every technique starts with the hands. So it’s what we call Kazushi and you’re pulling somebody off balance, getting them moving, pulling them off balance. Tai otoshi means body drop. So it’s basically two legs across your partner’s body. I’ve got my back to you and I’ve already pulled you off balance with my hands, and then I’m going to just flex my legs up just as you are coming onto my back. And then you’re going to go over if I coordinated all right. If it doesn’t get coordinated right, then you’re going to come right on my back and try to rip my arm off. So got get it right."
  },
  {
    "start": 880,
    "end": 881,
    "speaker": "Lex Fridman",
    "timestamp": "(02:04:51)",
    "text": "If you can convert it into words, some secret ingredients that allowed you to pull it off at the highest levels, the Tai otoshi?"
  },
  {
    "start": 882,
    "end": 883,
    "speaker": "Neil Adams",
    "timestamp": "(02:05:01)",
    "text": "The hands start every technique. So getting the repetition right, first of all. So to get the repetition right, you need a good partner. Actually training your partner to react in the right way is just as important as learning the throw. Actually what happens is we could get a lesson of beginners, we teach the throw and then go, “Right, off you go.” And 90% of them will get it wrong because their partner’s not reacting in the right way. So half of it is to get the person to react as they should. So if I was doing it with you, you and I, first thing I’d teach you to do is to react the way I want you to react. And then I’d react the way that you want me to react. So then we’d have success with it rather than you leaning back in the wrong way or resisting or frightened going over. So actually, that’s why nine times out of 10, people get the technique wrong."
  },
  {
    "start": 884,
    "end": 885,
    "speaker": "Lex Fridman",
    "timestamp": "(02:06:02)",
    "text": "It’s actually fascinating to me because in the United States where I came up, I mean, the level of judo is not comparable to the level of judo in the rest of the world. Of course the Pedro Center is an exception to that."
  },
  {
    "start": 886,
    "end": 887,
    "speaker": "Neil Adams",
    "timestamp": "(02:06:16)",
    "text": "Certain athletes, yeah."
  },
  {
    "start": 888,
    "end": 889,
    "speaker": "Lex Fridman",
    "timestamp": "(02:06:17)",
    "text": "It’s just certain athletes. When I trained recently with Jimmy Pedro, even the 16 year old kids are just all deadly, so it was terrifying. But I remember the Russian national team came through Philadelphia and one of the things that really impressed me is just how much easier judo was, training judo with them. They moved correctly. As the people getting thrown, every aspect of their body movement was correct in terms of it felt right to be throwing them, to be training with them. Everything about the gripping, about the position of their hips, about the shoulder, everything. It was fun. It was easy. And I always felt like I was learning. So I think all of that is loaded in, I guess, into proper training. So you’re developing through the throws, you’re developing the right technique."
  },
  {
    "start": 890,
    "end": 891,
    "speaker": "Neil Adams",
    "timestamp": "(02:07:11)",
    "text": "You got to develop. You have to develop between… I always had training partners that I trained with up to each Olympic games, we did the skills together and then we worked together in order to make techniques work. And we got it moving as quickly as we could. And one of the worst things that I see is, and I see a lot of YouTube stuff with them, coaches-"
  },
  {
    "start": 892,
    "end": 893,
    "speaker": "Lex Fridman",
    "timestamp": "(02:07:37)",
    "text": "Here we go, got Neil Adams upset."
  },
  {
    "start": 894,
    "end": 895,
    "speaker": "Neil Adams",
    "timestamp": "(02:07:40)",
    "text": "Don’t even start me on that. Don’t even start me on that."
  },
  {
    "start": 896,
    "end": 897,
    "speaker": "Lex Fridman",
    "timestamp": "(02:07:45)",
    "text": "What you-"
  },
  {
    "start": 898,
    "end": 899,
    "speaker": "Neil Adams",
    "timestamp": "(02:07:46)",
    "text": "You’re laughing because you know what I’m talking about, right?"
  },
  {
    "start": 900,
    "end": 901,
    "speaker": "Lex Fridman",
    "timestamp": "(02:07:47)",
    "text": "Yeah, yeah, yeah, yeah. No, I’m actually laughing because I’m enjoying you talking trash. But you’re talking about technique."
  },
  {
    "start": 902,
    "end": 903,
    "speaker": "Neil Adams",
    "timestamp": "(02:07:57)",
    "text": "Yeah, well then the coaches and their clipboard guys with the clipboards and the stopwatches and they’ve got these kids running up and down the mat and then doing Uchikomi of something that’s technically incorrect 10 times and then running up and doing another 10 at the other side and actually mixing everything together. And it’s just a mess."
  },
  {
    "start": 904,
    "end": 905,
    "speaker": "Lex Fridman",
    "timestamp": "(02:08:22)",
    "text": "Technique is important."
  },
  {
    "start": 906,
    "end": 907,
    "speaker": "Neil Adams",
    "timestamp": "(02:08:23)",
    "text": "Technical mess."
  },
  {
    "start": 908,
    "end": 909,
    "speaker": "Lex Fridman",
    "timestamp": "(02:08:24)",
    "text": "That said, some of it is conditioning type stuff that you were doing. So what is the hardest type of physical conditioning you were doing?"
  },
  {
    "start": 910,
    "end": 911,
    "speaker": "Neil Adams",
    "timestamp": "(02:08:32)",
    "text": "Probably ran too much when I was a kid. If I could go back now, I wouldn’t run as much. And I ran hard and I ran strong. And I remember doing London Marathon one time and I said, “I’m never going to do it again.” I said, “Never.” But I ran and the problem was when I did the London Marathon is I was trying to beat three hours."
  },
  {
    "start": 912,
    "end": 913,
    "speaker": "Lex Fridman",
    "timestamp": "(02:08:57)",
    "text": "It’s that desire to win again."
  },
  {
    "start": 914,
    "end": 915,
    "speaker": "Neil Adams",
    "timestamp": "(02:08:58)",
    "text": "It’s totally insane. It was insane. And I went out through half marathon in what I thought was a good time. Anyway, I got to 16-17 miles and totally blew it."
  },
  {
    "start": 916,
    "end": 917,
    "speaker": "Lex Fridman",
    "timestamp": "(02:09:10)",
    "text": "So you went out too fast."
  },
  {
    "start": 918,
    "end": 919,
    "speaker": "Neil Adams",
    "timestamp": "(02:09:11)",
    "text": "Yeah, I went out too fast."
  },
  {
    "start": 920,
    "end": 921,
    "speaker": "Lex Fridman",
    "timestamp": "(02:09:12)",
    "text": "And then you just-"
  },
  {
    "start": 922,
    "end": 923,
    "speaker": "Neil Adams",
    "timestamp": "(02:09:13)",
    "text": "I died."
  },
  {
    "start": 924,
    "end": 925,
    "speaker": "Lex Fridman",
    "timestamp": "(02:09:14)",
    "text": "…wanted to keep going."
  },
  {
    "start": 926,
    "end": 927,
    "speaker": "Neil Adams",
    "timestamp": "(02:09:16)",
    "text": "Absolutely. I died. I crossed the line. I remember seeing this bridge over there and the bridge, it was the finishing line over the bridge and I had to get there. It was the longest bridge I’ve ever, ever walked over and I walk, run. So I got over the bridge and I took one step over the line like that, and there was a guy over there and he was trying to rush everybody through. And he was going, “Come on, come on, come on. There’s people behind you?” “Get your hands off of me.” I said, “Get your hands off me now,” like that because we’re going to fall out. And I couldn’t move. I couldn’t move. I was white."
  },
  {
    "start": 928,
    "end": 929,
    "speaker": "Lex Fridman",
    "timestamp": "(02:09:58)",
    "text": "It’s amazing that you made it to the finish line though."
  },
  {
    "start": 930,
    "end": 931,
    "speaker": "Neil Adams",
    "timestamp": "(02:10:01)",
    "text": "I did. I got over there and Donald Duck passing me was a tell."
  },
  {
    "start": 932,
    "end": 933,
    "speaker": "Lex Fridman",
    "timestamp": "(02:10:08)",
    "text": "Oh, there’s a person dressed as Donald Duck?"
  },
  {
    "start": 934,
    "end": 935,
    "speaker": "Neil Adams",
    "timestamp": "(02:10:10)",
    "text": "Donald Duck, yeah. But the thing was, I still crossed over 338. I crossed over 338, but I lost 38 minutes in the last four miles."
  },
  {
    "start": 936,
    "end": 937,
    "speaker": "Lex Fridman",
    "timestamp": "(02:10:21)",
    "text": "So that bridge, longest bridge ever."
  },
  {
    "start": 938,
    "end": 939,
    "speaker": "Neil Adams",
    "timestamp": "(02:10:23)",
    "text": "The longest."
  },
  {
    "start": 940,
    "end": 941,
    "speaker": "Lex Fridman",
    "timestamp": "(02:10:23)",
    "text": "So you regret the running, huh?"
  },
  {
    "start": 942,
    "end": 943,
    "speaker": "Neil Adams",
    "timestamp": "(02:10:24)",
    "text": "So anyway, I would do the running a little bit differently, but we ran hard. We did the weight training, we did good weight training. It was all conditioned. So I mean, it was never the same training all the time. So it was always, we’d have certain phases building up. It was scientifically done. It wasn’t just out there, run, weight training, judo, same judo all the time. It was always pretty scientific."
  },
  {
    "start": 944,
    "end": 945,
    "speaker": "Lex Fridman",
    "timestamp": "(02:10:50)",
    "text": "Good variety."
  },
  {
    "start": 946,
    "end": 947,
    "speaker": "Neil Adams",
    "timestamp": "(02:10:51)",
    "text": "It was a good variety. And it had build up and it had a speed phase and it had a power phase and it had a base condition."
  },
  {
    "start": 948,
    "end": 949,
    "speaker": "Lex Fridman",
    "timestamp": "(02:10:58)",
    "text": "What about the Randori? Was there a method to the madness there? How much Randori did you do?"
  },
  {
    "start": 950,
    "end": 951,
    "speaker": "Neil Adams",
    "timestamp": "(02:11:05)",
    "text": "A lot. So the most important thing for me, I mean, I see now that there’s a lot of people out there that are not getting enough Randori. They’re not Randori-ing enough. And there’s a lot of sports science people and they’re running and they’re weight training and they’re doing it all to death. And there’s not enough judo. You have a look at some of the eastern block countries that are getting together, they’re having these mass camps and the Japanese, they have just massive people that they can do there. They’re doing probably 50-60 Randori’s a week."
  },
  {
    "start": 952,
    "end": 953,
    "speaker": "Lex Fridman",
    "timestamp": "(02:11:44)",
    "text": "Wait, what?"
  },
  {
    "start": 954,
    "end": 955,
    "speaker": "Neil Adams",
    "timestamp": "(02:11:45)",
    "text": "50 or 60 a week."
  },
  {
    "start": 956,
    "end": 957,
    "speaker": "Lex Fridman",
    "timestamp": "(02:11:47)",
    "text": "Wow."
  },
  {
    "start": 958,
    "end": 959,
    "speaker": "Neil Adams",
    "timestamp": "(02:11:48)",
    "text": "The average person is getting together… I mean, when I was doing Randori’s, when I went to Japan, it was just purely for 60 Randori’s a week."
  },
  {
    "start": 960,
    "end": 961,
    "speaker": "Lex Fridman",
    "timestamp": "(02:11:59)",
    "text": "How much is each one? How long is it?"
  },
  {
    "start": 962,
    "end": 963,
    "speaker": "Neil Adams",
    "timestamp": "(02:12:00)",
    "text": "So they were five minutes then, they’re four minutes now."
  },
  {
    "start": 964,
    "end": 965,
    "speaker": "Lex Fridman",
    "timestamp": "(02:12:04)",
    "text": "That’s a lot, especially given the level of the competition there."
  },
  {
    "start": 966,
    "end": 967,
    "speaker": "Neil Adams",
    "timestamp": "(02:12:07)",
    "text": "But you can do it in Japan because it’s fairly light. If they throw you, they throw you, you throw them."
  },
  {
    "start": 968,
    "end": 969,
    "speaker": "Lex Fridman",
    "timestamp": "(02:12:12)",
    "text": "So there’s a level of you’re moving at a close to 100%, but the actual power in the force is not quite there."
  },
  {
    "start": 970,
    "end": 971,
    "speaker": "Neil Adams",
    "timestamp": "(02:12:20)",
    "text": "Different in Korea. Korea was harder, it was more physical. So you couldn’t do 50 Randori’s in Korea. You’d die. So you’d do 30."
  },
  {
    "start": 972,
    "end": 973,
    "speaker": "Lex Fridman",
    "timestamp": "(02:12:31)",
    "text": "50 Randori’s, wow."
  },
  {
    "start": 974,
    "end": 975,
    "speaker": "Neil Adams",
    "timestamp": "(02:12:32)",
    "text": "But you need the Randori. And so I chased the Randorers, so I chased them into training camps, I chased them all over my country. So I was getting 40 to 50 a week in my club. And then I would go to training camps and add more. And I honestly don’t think that they do enough now, a lot of countries."
  },
  {
    "start": 976,
    "end": 977,
    "speaker": "Lex Fridman",
    "timestamp": "(02:12:55)",
    "text": "Somebody who doesn’t know Randori’s live training."
  },
  {
    "start": 978,
    "end": 979,
    "speaker": "Neil Adams",
    "timestamp": "(02:12:57)",
    "text": "Yeah, sparring."
  },
  {
    "start": 980,
    "end": 981,
    "speaker": "Lex Fridman",
    "timestamp": "(02:12:59)",
    "text": "Was there a few people you remember that were just really tough to go against? You mentioned Goldtooth, is there others like it?"
  },
  {
    "start": 982,
    "end": 983,
    "speaker": "Neil Adams",
    "timestamp": "(02:13:06)",
    "text": "Goldtooth was pretty horrific."
  },
  {
    "start": 984,
    "end": 985,
    "speaker": "Lex Fridman",
    "timestamp": "(02:13:10)",
    "text": "Well, you got him in the end."
  },
  {
    "start": 986,
    "end": 987,
    "speaker": "Neil Adams",
    "timestamp": "(02:13:12)",
    "text": "I got him in the end."
  },
  {
    "start": 988,
    "end": 989,
    "speaker": "Lex Fridman",
    "timestamp": "(02:13:18)",
    "text": "I suppose I should say not just tough, but just good training partners that you like."
  },
  {
    "start": 990,
    "end": 991,
    "speaker": "Neil Adams",
    "timestamp": "(02:13:21)",
    "text": "Great training partners. I remember Nishida and Nishida, I mentioned him earlier, said he was one of the best, I mean, he was just such a great technician. So I would go there to his dojo and he’d ask me to practice and he’d finish the practice and you know that he would always say, “Another one, we’ll do another one.” So you’d go, “Oh yeah,” because you had to make out that you weren’t that bothered that you had to do another one, so you’d do another one back to back. And then he’d go sometimes, “Let’s do another one.” So we’d end up doing 15 minutes with the same guy who could possibly throw you at any time. And that was hard. But I remember those particular guys and there were plenty of those."
  },
  {
    "start": 992,
    "end": 993,
    "speaker": "Lex Fridman",
    "timestamp": "(02:14:06)",
    "text": "What do you do with the exhaustion that you’re feeling in those? How deep did you go in terms of-"
  },
  {
    "start": 994,
    "end": 995,
    "speaker": "Neil Adams",
    "timestamp": "(02:14:11)",
    "text": "You have to dig deep. And I think that that was the great thing about having certain European training camps were more physical. So I remember that we would have European training camps where you’d fight Germans and then the Dutch and then the French and then the Russian. You’d have all sorts different styles and people to fight and that was something then you’d have to dig in at a different place, come out of there."
  },
  {
    "start": 996,
    "end": 997,
    "speaker": "Lex Fridman",
    "timestamp": "(02:14:43)",
    "text": "Where do you go mentally? How many times have you gone there where you’re really in deep waters exhaustion wise in competition, actually?"
  },
  {
    "start": 998,
    "end": 999,
    "speaker": "Neil Adams",
    "timestamp": "(02:14:53)",
    "text": "Competition, it’s happened. So sometimes you go past where your forearms are absolutely blown. I remember the final of Czech tournament that we had and fought a Frenchman in the final. And my forearms were so blown I couldn’t shake his hand. And then I remember they were solid, absolutely solid and they had lactic acid in them. And I remember I stood on the rostrum and they were giving me things and I couldn’t grip them properly. So I was saying, “Put it under my armpit or chin,” like that, trying to hold this and I couldn’t hold anything. So there are times when I really had to go really deep. I remember fighting two East Germans the same day, one of the competitions and the number one and the number two East Germans, and that was another day where I had to really dig deep."
  },
  {
    "start": 1000,
    "end": 1001,
    "speaker": "Lex Fridman",
    "timestamp": "(02:15:53)",
    "text": "That’s the fascinating thing about some of these tournaments is if you go full distance on several matches in a row, what you’re seeing in the finals are two people that have fought a lot that day."
  },
  {
    "start": 1002,
    "end": 1003,
    "speaker": "Neil Adams",
    "timestamp": "(02:16:08)",
    "text": "And we have golden score now. So we see a lot of guys that are going into golden score and they’ve done one contest in four minutes and then they go another four minutes. And then we’ve had some go into a third four minutes, this is all back to back. It might be in the first round, it might be in the final. And we’ve got some now that are coming out and you can see the stats and the ones that win in golden score. So we got Japanese, Hashimoto, he’s the Japanese representative now instead of Ono, because Ono’s finished. So Hashimoto’s coming out. He was in a tournament last week."
  },
  {
    "start": 1004,
    "end": 1005,
    "speaker": "Lex Fridman",
    "timestamp": "(02:16:42)",
    "text": "Is he a good one to look up?"
  },
  {
    "start": 1006,
    "end": 1007,
    "speaker": "Neil Adams",
    "timestamp": "(02:16:44)",
    "text": "Yeah, just have a look at him. So Hashimoto’s in white here and there’s a great example there. Well, I’m glad we got onto that. So I mean, he has got great technique, Hashimoto."
  },
  {
    "start": 1008,
    "end": 1009,
    "speaker": "Lex Fridman",
    "timestamp": "(02:16:57)",
    "text": "Effortless, effortless. Pay attention as we’re talking. Wow."
  },
  {
    "start": 1010,
    "end": 1011,
    "speaker": "Neil Adams",
    "timestamp": "(02:16:58)",
    "text": "Right, so you can see exactly what we’re talking about there, great timing. And again, sometimes he backs them up to the edge and then he’ll wait for them to come back in towards, they don’t want to step out to get a penalty."
  },
  {
    "start": 1012,
    "end": 1013,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:14)",
    "text": "I guess that’s a cross grip Tai otoshi or did I see that wrong?"
  },
  {
    "start": 1014,
    "end": 1015,
    "speaker": "Neil Adams",
    "timestamp": "(02:17:17)",
    "text": "Yeah, cross grip, different grips. Oh, great examples there. Just what we were talking about."
  },
  {
    "start": 1016,
    "end": 1017,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:23)",
    "text": "Making it look so easy. Wow."
  },
  {
    "start": 1018,
    "end": 1019,
    "speaker": "Neil Adams",
    "timestamp": "(02:17:26)",
    "text": "So he’s going to be their representative at 73 kilograms. Look at him, back him up again and again, just catching him as he pushes back."
  },
  {
    "start": 1020,
    "end": 1021,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:35)",
    "text": "So push, push, push, and then-"
  },
  {
    "start": 1022,
    "end": 1023,
    "speaker": "Neil Adams",
    "timestamp": "(02:17:37)",
    "text": "Yeah, action, reaction at it’s best there. And slight change of direction. He sometimes goes down onto his knee there, which is seoi otoshi. It turns from Tai otoshi, which is springing up, to seoi otoshi that’s going down."
  },
  {
    "start": 1024,
    "end": 1025,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:52)",
    "text": "Oh, the title of the video is, Tai Otoshi is a Work of Art."
  },
  {
    "start": 1026,
    "end": 1027,
    "speaker": "Neil Adams",
    "timestamp": "(02:17:57)",
    "text": "This is him at his best, showing him doing what he does best. But he had to go three times into golden score last week and dig deep and lost one of them, I think."
  },
  {
    "start": 1028,
    "end": 1029,
    "speaker": "Lex Fridman",
    "timestamp": "(02:18:09)",
    "text": "But you’re still going at it. You’re talking about all those training sessions. Niki, your wonderful wife, told me that you were going all over from Target to Target looking for workout clothes because your luggage got lost because you had to get a workout in."
  },
  {
    "start": 1030,
    "end": 1031,
    "speaker": "Neil Adams",
    "timestamp": "(02:18:24)",
    "text": "You know what? I realized that if I’m a miserable git, then she’ll get me into the gym. And the thing is that I’m better if I get in there for an hour and I just do something, at least 35-40 minutes cardio. And then I do some weights and more high repetitions. It’s not so much heavy weights now, but more functional stuff."
  },
  {
    "start": 1032,
    "end": 1033,
    "speaker": "Lex Fridman",
    "timestamp": "(02:18:48)",
    "text": "I mean, you travel all over the world for the commentary of these competitions. So is it sometimes a challenge to figure out how-"
  },
  {
    "start": 1034,
    "end": 1035,
    "speaker": "Neil Adams",
    "timestamp": "(02:18:56)",
    "text": "Well during Covid then they closed all the gyms, but we were still going out. We were one of the first ones out. The judo were some of the first out, the competitions were behind closed doors, so we were in the hotel, the gym was closed, so we couldn’t use the gyms, so we had to look for other ways that we could work out. So most of the hotels that we were in were high-rise hotels. So we were in the steps, we were doing the steps right the way up. So I started it, and so I started off with me going up and then one or two of the others and the referees started to go up with me. So in the end, we’d have this trail of people going up the steps and down. And every place we went to, we had the steps. So that was an interesting situation. So we were sick of steps in the end."
  },
  {
    "start": 1036,
    "end": 1037,
    "speaker": "Lex Fridman",
    "timestamp": "(02:19:52)",
    "text": "What advice would you give to beginners, people starting out in judo, how to develop their game, how to find the beauty in the sport and the art of judo?"
  },
  {
    "start": 1038,
    "end": 1039,
    "speaker": "Neil Adams",
    "timestamp": "(02:20:08)",
    "text": "If you put 10 people in a room and said, “Right, get on with it,” you’d have mayhem. And I think that whatever sport you’re doing, you need good instruction, good teaching, and a good club atmosphere, somewhere that’s not so intense that winning is the only thing. And I think that if you look at 90% of the people that practice martial arts are doing it for pleasure. So they want to get pleasure. So you need a club that’s got a bit of a mixture. They’ve got a direction to go into competition if they want, and then the rest, it’s for fun and to enjoy it, but with really good instruction because with really good instruction and a good foundation and a good base, you get more enjoyment because you have more success. Let’s be honest, the more success we have with something, the more we like it."
  },
  {
    "start": 1040,
    "end": 1041,
    "speaker": "Lex Fridman",
    "timestamp": "(02:21:07)",
    "text": "Yeah, and great technique is a way to really discover the beauty of the art. And so great teaching is really important there."
  },
  {
    "start": 1042,
    "end": 1043,
    "speaker": "Neil Adams",
    "timestamp": "(02:21:14)",
    "text": "Great teaching is so important."
  },
  {
    "start": 1044,
    "end": 1045,
    "speaker": "Lex Fridman",
    "timestamp": "(02:21:18)",
    "text": "What does it take to get from the early days when you started judo to world-class level?"
  },
  {
    "start": 1046,
    "end": 1047,
    "speaker": "Neil Adams",
    "timestamp": "(02:21:26)",
    "text": "I think that with most, I mean, you do hear, don’t you? If somebody’s been doing judo for eight years and then they’re in… And I think it happened, one of the French, she went to the Olympic games in 2012 and she’d been doing judo for eight years, but then she started to lose. So she had a relative success early on. The Olympics was one of them. She got a silver medal, but then she went off the boil and then she came back and now she’s still competing and she’s been there for well over 13 years at the very top. So I think that any foundation, it’s like anything, if you lay a really solid foundation, it generally lasts longer."
  },
  {
    "start": 1048,
    "end": 1049,
    "speaker": "Lex Fridman",
    "timestamp": "(02:22:12)",
    "text": "Yeah, but that foundation again, is that technique or what does it take to build that foundation?"
  },
  {
    "start": 1050,
    "end": 1051,
    "speaker": "Neil Adams",
    "timestamp": "(02:22:19)",
    "text": "I think technique, you get away with murder. With technique, you can get away with having bad condition, but I mean, you get found out in the end. But you can go out and you can win certain things by doing really nice technique. But I think if you’ve got the mixture, if you’ve got the whole package, then you can go the whole way."
  },
  {
    "start": 1052,
    "end": 1053,
    "speaker": "Lex Fridman",
    "timestamp": "(02:22:42)",
    "text": "So for people who somehow don’t know some of the greatest judo matches ever. You’ve done Grand Prix’s, you’ve done all of these events, Olympics, championship, everything. Just looking at the history of judo, what stands out to you? What events stand out to you? What are some good memories that pop to your head?"
  },
  {
    "start": 1054,
    "end": 1055,
    "speaker": "Neil Adams",
    "timestamp": "(02:23:03)",
    "text": "I think some of the Paris tournaments are amazing because the crowd, they’re there, they’re on the mat, they’re all judoka, they’re well-educated to the sport. Every time somebody twitches, they’re very biased towards their own, which you expect, but sometimes I haven’t been able to hear myself speak, and that’s very unusual. You’ve got the headphones on and you’re blocked out. Sometimes Teddy Riner’s been walking out there and the crowd are going crazy and they’re on their feet when somebody twitches and then you get the crowd silences. We had one of those last week. Everybody’s cheering their man and then bang, their man goes over."
  },
  {
    "start": 1056,
    "end": 1057,
    "speaker": "Lex Fridman",
    "timestamp": "(02:23:47)",
    "text": "And then it’s silence."
  },
  {
    "start": 1058,
    "end": 1059,
    "speaker": "Neil Adams",
    "timestamp": "(02:23:48)",
    "text": "Silence, nothing like that. And then of course, we were commentating, we would go, “That was a bit of a crowd silencer.” But that happens."
  },
  {
    "start": 1060,
    "end": 1061,
    "speaker": "Lex Fridman",
    "timestamp": "(02:23:57)",
    "text": "Yeah, that is a surprising thing, at least it was to me, that Paris and France is really big on judo."
  },
  {
    "start": 1062,
    "end": 1063,
    "speaker": "Neil Adams",
    "timestamp": "(02:24:04)",
    "text": "Massive. And there’s always surprises. Paris is great. In Japan for the Olympic games, the biggest surprise was Ono getting beaten in the team event. Now Ono is the greatest Judo man. Pound for pound, probably one of the best. And he won the Olympic title and then they went into the team event against France and Ono lost to a, He’s not run of the mill German, but the German, he wasn’t certainly Olympic title-esque and beat Ono, managed to throw him."
  },
  {
    "start": 1064,
    "end": 1065,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:41)",
    "text": "Yeah. Well, the team stuff is fascinating, right?"
  },
  {
    "start": 1066,
    "end": 1067,
    "speaker": "Neil Adams",
    "timestamp": "(02:24:43)",
    "text": "Yeah, it’s fascinating."
  },
  {
    "start": 1068,
    "end": 1069,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:44)",
    "text": "It changes the dynamics of the whole thing. And I mean, it’s funny you say Paris, it really makes it really big deal that this Olympics is being held in Paris."
  },
  {
    "start": 1070,
    "end": 1071,
    "speaker": "Neil Adams",
    "timestamp": "(02:24:55)",
    "text": "And they’ll be the team to beat, French team because they have the best balance of the weight categories. They have the best balance with their people that are world and Olympic champions and qualified men and women. So it’s three men, three women. They have the best balance out of anybody."
  },
  {
    "start": 1072,
    "end": 1073,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:13)",
    "text": "And an educated audience."
  },
  {
    "start": 1074,
    "end": 1075,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:15)",
    "text": "Educated audience, home grounds."
  },
  {
    "start": 1076,
    "end": 1077,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:16)",
    "text": "It’s going to be awesome."
  },
  {
    "start": 1078,
    "end": 1079,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:16)",
    "text": "It’s going to be mad."
  },
  {
    "start": 1080,
    "end": 1081,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:18)",
    "text": "It’s going to be super fun."
  },
  {
    "start": 1082,
    "end": 1083,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:20)",
    "text": "It will be super fun."
  },
  {
    "start": 1084,
    "end": 1085,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:21)",
    "text": "Are you nervous?"
  },
  {
    "start": 1086,
    "end": 1087,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:22)",
    "text": "Yeah."
  },
  {
    "start": 1088,
    "end": 1089,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:23)",
    "text": "All right."
  },
  {
    "start": 1090,
    "end": 1091,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:23)",
    "text": "Do you get nervous?"
  },
  {
    "start": 1092,
    "end": 1093,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:25)",
    "text": "I get nervous. I get nervous."
  },
  {
    "start": 1094,
    "end": 1095,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:26)",
    "text": "I do as well. I get really nervous."
  },
  {
    "start": 1096,
    "end": 1097,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:28)",
    "text": "I’m nervous right now. But given, especially because it’s the Olympics and you want to celebrate people properly and it’s everything for them. And a lot of people, especially the finals matches, it’ll be watched millions of times, the highest of stakes, all of this."
  },
  {
    "start": 1098,
    "end": 1099,
    "speaker": "Neil Adams",
    "timestamp": "(02:25:51)",
    "text": "Played over and over. And I find that with mine, I’m now a little bit more careful, so I’ll celebrate a massive throw and then have empathy to the one that’s been thrown because it’s not the best feeling in the world, especially in Olympic finals. Can you imagine that?"
  },
  {
    "start": 1100,
    "end": 1101,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:10)",
    "text": "Yeah."
  },
  {
    "start": 1102,
    "end": 1103,
    "speaker": "Neil Adams",
    "timestamp": "(02:26:11)",
    "text": "Must be terrible."
  },
  {
    "start": 1104,
    "end": 1105,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:12)",
    "text": "Must be terrible."
  },
  {
    "start": 1106,
    "end": 1107,
    "speaker": "Neil Adams",
    "timestamp": "(02:26:15)",
    "text": "Just reflecting. So no, I have a bit of empathy there, and I try and say the right things because they always do come up to me and say, “You commentated my fights.”"
  },
  {
    "start": 1108,
    "end": 1109,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:27)",
    "text": "Yeah, you’re the voice of the biggest triumphs and the biggest tragedies for these athletes, for the world that watches and admires these athletes."
  },
  {
    "start": 1110,
    "end": 1111,
    "speaker": "Neil Adams",
    "timestamp": "(02:26:35)",
    "text": "No pressure."
  },
  {
    "start": 1112,
    "end": 1113,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:35)",
    "text": "You’re the voice. Don’t screw it up."
  },
  {
    "start": 1114,
    "end": 1115,
    "speaker": "Neil Adams",
    "timestamp": "(02:26:37)",
    "text": "Don’t screw it up."
  },
  {
    "start": 1116,
    "end": 1117,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:39)",
    "text": "Your voice is in my head when I watch these. It’s just fascinating, it’s fascinating, but you’re a master of it. It’s a huge honor that you would talk with me. Thank you for everything you’ve done for the sport of judo, for the Olympics, for just sports in general, just celebrating greatness in all of its forms. Thank you for talking today. Keep going. I can’t wait to listen to you in Paris."
  },
  {
    "start": 1118,
    "end": 1119,
    "speaker": "Neil Adams",
    "timestamp": "(02:27:07)",
    "text": "Thank you for having me, and it’s just been an honor to be here with you."
  },
  {
    "start": 1120,
    "end": 1121,
    "speaker": "Lex Fridman",
    "timestamp": "(02:27:13)",
    "text": "Thanks for listening to this conversation with Neil Adams. To support this podcast, please check out our sponsors in the description. And now let me leave you with some words from Miyamoto Musashi. There’s nothing outside of yourself that can ever enable you to get better, stronger, richer, quicker, or smarter. Everything is within, everything exists. Seek nothing outside of yourself. Thank you for listening and hope to see you next time."
  }
]