[
  {
    "start": 0,
    "end": 1,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:00:00)",
    "text": "If I hate you, that’s great, but if I have a story to support that hate, that’s even better."
  },
  {
    "start": 2,
    "end": 3,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:04)",
    "text": "One of your favorite words, “Jihad.”"
  },
  {
    "start": 4,
    "end": 5,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:00:09)",
    "text": "That’s my favorite hobbies. It doesn’t matter now, who do you vote into power; they will not listen to you, they would listen to the people who paid them to be there. When the military came in, people were walking to me, pointing their fingers like, “Don’t speak about [inaudible 00:00:24], don’t speak about the army. We love you now, but don’t you…” They would, like that. So I called John Stewart, I was like, “I don’t know what to do.” And he said the most interesting thing ever. And say, “If you’re afraid of something, make fun about the fact that you’re afraid of it.”"
  },
  {
    "start": 6,
    "end": 7,
    "speaker": "Lex Fridman",
    "timestamp": "(00:00:43)",
    "text": "The following is a conversation with Bassem Youssef, a legendary Egyptian-American comedian, the so-called John Stewart of the Middle East, who fearlessly satirized those in power even when his job and life were on the line. Bassem is a beautiful human being. It was truly a pleasure for me to get to know him and to have this fun, fascinating, and challenging conversation. This is the Lex Fridman podcast. To support it, please check out our sponsors in the description. And now, dear friends, here’s Bassem Youssef."
  },
  {
    "start": 8,
    "end": 9,
    "speaker": "",
    "timestamp": "(00:01:21)",
    "text": "Your wife is half Palestinian, and I’ve heard you say that you’ve been trying to kill her, but she keeps using the kids as human shields. So have you considered negotiating a ceasefire?"
  },
  {
    "start": 10,
    "end": 11,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:01:31)",
    "text": "Well, the thing is, every day, every minute of the day in a married life is a negotiation. Everything can blow up into a full-scale war. Starting from a simple sentence like, “Good morning, what should we do with the kids today? What should we do with that piece of furniture?” Any sentence can lead you to heaven or to hell in the same time."
  },
  {
    "start": 12,
    "end": 13,
    "speaker": "Lex Fridman",
    "timestamp": "(00:01:54)",
    "text": "So, you do negotiate with terrorists."
  },
  {
    "start": 14,
    "end": 15,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:01:56)",
    "text": "Oh yeah. Yeah, 100%. You must. Yeah. And for her, I’m her terrorist too. So it’s equal."
  },
  {
    "start": 16,
    "end": 17,
    "speaker": "Lex Fridman",
    "timestamp": "(00:02:01)",
    "text": "Terrorists on both sides. On a more serious note, when you found out about the attacks of October 7th, what went through your mind?"
  },
  {
    "start": 18,
    "end": 19,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:02:08)",
    "text": "If I’m allowed to use a curse word, I was like-"
  },
  {
    "start": 20,
    "end": 21,
    "speaker": "Lex Fridman",
    "timestamp": "(00:02:11)",
    "text": "As many as possible."
  },
  {
    "start": 22,
    "end": 23,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:02:12)",
    "text": "I was like, “Oh shit.” Part of my stand-up comedy is I describe a situation where I was in a restaurant with producers and there was a bombing two blocks away in Chelsea, New York in 2016. And of course, this is the like, “Damn, what’s going to happen to us now?” And there’s two different reactions, the white reaction, which is like, “Oh my God, I hope nobody is hurt. This is terrible. I hope everybody’s okay.” And there’s the Arab reaction. “What’s his name? What’s his name? What is the name?” Because you know what’s going to come. I was scared what’s going to really happened in that area, and I said like, “Oh my God, it’s going to be horrible.” And the way that it was reported, I didn’t know how to handle this. So I went into hiding for a few days, three or four days, and I talked about Piers Morgan team talking to me two times, three times. I was like, “No, I can’t. How can you defend that? How can you defend the rape, the decapitated babies and whatever?”"
  },
  {
    "start": 24,
    "end": 25,
    "speaker": "",
    "timestamp": "(00:03:12)",
    "text": "And then I started kind of looking in the news a little bit, and then I started seeing people coming on the shows and saying things that I know as an Arab, as a Muslim, as someone from that region, that it’s not true. But I didn’t know what to say, how to say it. So by the third time when they asked me, I said, “Fine, put me on.” And I went there, it was [inaudible 00:03:36], figuratively speaking, a suicide mission because it’s a lose-lose situation. I can lose stuff in Hollywood. I remember my managers like, “Bessem, be careful. I mean, are you sure you want to do it?” My managers was like, “Please don’t do it. Please don’t do it.” And on the other side, if I don’t perform well, whatever, “Well” means, I’m going to be rejected by my own people. So it was a lose-lose situation because whatever I say, it’ll never be enough, and whatever I say will not be good enough. And I was going into there, and I felt that I was going into a trance for the 33 minutes that I was on that interview for the first time."
  },
  {
    "start": 26,
    "end": 27,
    "speaker": "Lex Fridman",
    "timestamp": "(00:04:20)",
    "text": "You blacked out?"
  },
  {
    "start": 28,
    "end": 29,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:04:21)",
    "text": "I blacked out. I blacked out. And a lot of people ask me, “Was that a bit when the earpiece kept falling?” It’s like, “No, it was really falling off and it disconnected and I had to save it because I cannot see them, I can just hear them and I could expecting at any time, “Okay, Bessem, thank you.”” I was fighting for every second, to say words, to put stuff in there."
  },
  {
    "start": 30,
    "end": 31,
    "speaker": "Lex Fridman",
    "timestamp": "(00:04:45)",
    "text": "For people who don’t know, this is your conversation, interview with Piers Morgan and you couldn’t see."
  },
  {
    "start": 32,
    "end": 33,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:04:51)",
    "text": "I couldn’t see. I was just like, the lens of the camera and-"
  },
  {
    "start": 34,
    "end": 35,
    "speaker": "Lex Fridman",
    "timestamp": "(00:04:54)",
    "text": "It was like a surreal dream or nightmare."
  },
  {
    "start": 36,
    "end": 37,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:04:56)",
    "text": "Yeah. “Hello, Bessem.” It was like, “Hello, Bessem,” I was like, “Hi.”"
  },
  {
    "start": 38,
    "end": 39,
    "speaker": "Lex Fridman",
    "timestamp": "(00:04:59)",
    "text": "And it could end at any moment, your career and everything."
  },
  {
    "start": 40,
    "end": 41,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:05:02)",
    "text": "Everything. Yeah. Yeah."
  },
  {
    "start": 42,
    "end": 43,
    "speaker": "Lex Fridman",
    "timestamp": "(00:05:04)",
    "text": "So what was the drive that got you to actually do it, to overcome that fear?"
  },
  {
    "start": 44,
    "end": 45,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:05:10)",
    "text": "Multiple things. First of all, I don’t want to say it’s just my wife’s family because my wife’s family has always been there, but this time was different. The bombing, the attack, they’re usually one of those people that they’re aware of everything. When whatever happened in Gaza, they are always in safe places. But this time, it seems that there was no place safe. And already we heard about two, three of the cousins, and the uncles already lost their home. So this was too much. So I wanted to say something for those people, because I know that… One of the jokes that I made about like, “Oh, it’s Hasan, her cousin, he’s a loser, he’s a doctor. He’s a doctor.” And every time a hospital was bombed, we were worried about him. So I wanted to say that because I felt that this is a family that I have never seen in my life. She actually hardly saw an uncle or two, because they cannot leave. But I said, “I need to speak, at least I do something for those extended family that I have never known.”"
  },
  {
    "start": 46,
    "end": 47,
    "speaker": "",
    "timestamp": "(00:06:17)",
    "text": "But also because when Piers Morgan team called me a couple of times and said, “Okay, let’s see what’s going on in the show,” and I just watched the stuff, and the lies, and the one-sided reporting that made my blood boil. And then I thought, “What am I afraid of? I’m afraid of if I say something, I can lose my career. Wait a minute, but that was the reason why I left Egypt.” I said, “Wait, I left Egypt, I came to United States, I came to the Land of the Free where I can say anything I want. And yet I have limitation of what to say. I mean, I thought we left that shit behind. I mean, what’s happening?”"
  },
  {
    "start": 48,
    "end": 49,
    "speaker": "",
    "timestamp": "(00:06:57)",
    "text": "And I understand the connection of how sensitive it is when you speak about Israel and all of the ready-made accusations. But as an Arab, as a Muslim, I don’t react the same when you talk about Saudi Arabia, or Iran, or Egypt or any of them, it’s like, “Hey, you want to dis some of these countries, I’ll do that with you because I have strong opinions about what happened and I already been expressing them.” But that’s why, and there’s a lot of Jewish people who come to my show and they understand that. They understand the separation, but that kind of a grouping of blackmailing people and saying, and not saying what they have in their mind, it is that one of the things that kind of pushed me to go on the show."
  },
  {
    "start": 50,
    "end": 51,
    "speaker": "Lex Fridman",
    "timestamp": "(00:07:40)",
    "text": "The thing that was bothering you, was that what was being said or how it was being said?"
  },
  {
    "start": 52,
    "end": 53,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:07:46)",
    "text": "Both. Because there are lies, which is usually in the media, but there was the total disregard of humanity. You talk a lot on your show about human suffering, and I felt that here the human suffering was not equal. I felt that’s why I came up with this like, “What’s the exchange rate today? What’s the exchange rate today?” Of course, it’s terrible to see anybody die, but I feel that like, isn’t our life not worth anything?"
  },
  {
    "start": 54,
    "end": 55,
    "speaker": "Lex Fridman",
    "timestamp": "(00:08:20)",
    "text": "Yeah. You had a chart akin to crypto, you analyzed it from an investing perspective, of course, in a dark human economy-"
  },
  {
    "start": 56,
    "end": 57,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:08:27)",
    "text": "The ROI on-"
  },
  {
    "start": 58,
    "end": 59,
    "speaker": "Lex Fridman",
    "timestamp": "(00:08:30)",
    "text": "The ROI. And you were saying that a certain year was a good year."
  },
  {
    "start": 60,
    "end": 61,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:08:34)",
    "text": "Yeah, 2014."
  },
  {
    "start": 62,
    "end": 63,
    "speaker": "Lex Fridman",
    "timestamp": "(00:08:34)",
    "text": "2014 was a good year for investment purposes and also to refer to family member that you called a loser, you were saying that you called him, had a conversation with him, and he keeps saying that he’s not using anybody for human shields, and you called him a loser. What do you do? He can’t even keep a job."
  },
  {
    "start": 64,
    "end": 65,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:08:51)",
    "text": "Liar. He lied to us because I have to believe. It’s also one of the things, like how it was said, it was stuff that I’ve been hearing. I don’t know what turned on in my head, but it’s stuff that I’ve been hearing all my life from the media, “Israel warns civilians before bombing them, and that’s okay,” but that’s not okay. Israel is trying to minimize the civilians, but killing them anyway. And that’s okay, but that’s not okay. So it is kind of like the indoctrination that we’ve been hearing, as if it is okay, and then suddenly it’s not."
  },
  {
    "start": 66,
    "end": 67,
    "speaker": "Lex Fridman",
    "timestamp": "(00:09:27)",
    "text": "Yeah, there’s a kind of several layers of bullshit, almost sometimes hiding the obvious horror of the situation with kind of politeness and all this kind of stuff. Just the basic value of human life. That said, it’s a difficult situation."
  },
  {
    "start": 68,
    "end": 69,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:09:44)",
    "text": "It is."
  },
  {
    "start": 70,
    "end": 71,
    "speaker": "Lex Fridman",
    "timestamp": "(00:09:45)",
    "text": "What would you do if you were Israel? Bibi called you, awesome, big fan, big fan of your comedy. First of all, would you hang up right away? Would you hear him out?"
  },
  {
    "start": 72,
    "end": 73,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:09:54)",
    "text": "Oh, I’ll definitely hear him out. That was like, “Wait a minute. That’s material. That’s material, man.” It was like, “So Netanyahu called me. I was sitting with my family. Just like, I’m on my phone, and it was like, “Oh, Netanyahu.”"
  },
  {
    "start": 74,
    "end": 75,
    "speaker": "Lex Fridman",
    "timestamp": "(00:10:05)",
    "text": "Yeah, it just shows up that way. I mean, what would you do? What would you do in this situation?"
  },
  {
    "start": 76,
    "end": 77,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:10:13)",
    "text": "To answer this question, we need to understand how Israel thinks. There is an incredible speech given by Gideon Levy, the famous Israeli reporter [inaudible 00:10:23]. He describes a situation where he was in the West Bank and there was a checkpoint. And in that checkpoint there was an ambulance with a Palestinian patient and it was there, sitting for an hour and a half, not moving. And then he went to talk to the soldiers, like, “Guys, why are you not letting them go?” It’s like, “Ah, let them go.” And then he told them, “Imagine if he was your father.” And the soldiers stood up, it was like, “What? These are pigs. These are not humans.”"
  },
  {
    "start": 78,
    "end": 79,
    "speaker": "",
    "timestamp": "(00:10:58)",
    "text": "So when you tell me what would you do if Israel would do, we need to ask how does Israel look at the Palestinian and view the Palestinians? Because they do look at them less than human. And there is an incredible talk by [inaudible 00:11:12] Meyer. He was a Holocaust survivor, and he said, “I learned in Auschwitz when I was there in the Concentration Camp that in order for a dominant group of people to dehumanize another group, they need first, to dehumanize themselves. And Israel looks at Palestinians as lesser people, as lesser beings, as some people who are dispensable. And the way that they treat them is that, they don’t really care about… That’s why that the exchange rate thing."
  },
  {
    "start": 80,
    "end": 81,
    "speaker": "",
    "timestamp": "(00:11:42)",
    "text": "So for me, if I am Israel, it’ll be like, “What would you do if you’re the United States in the time of the Native Americans? They were killing people with the millions.” When you dehumanize a group of people, you really don’t care. So if I was Israel, I would do exactly what Israel is doing right now, because there’s no one is holding me accountable. There is no one stopping me, and I can get whatever I want, throughout my history, through violence."
  },
  {
    "start": 82,
    "end": 83,
    "speaker": "Lex Fridman",
    "timestamp": "(00:12:08)",
    "text": "I think a lot of the things you just said are a tiny bit slightly exaggerated. So let me try."
  },
  {
    "start": 84,
    "end": 85,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:12:14)",
    "text": "Please, please."
  },
  {
    "start": 86,
    "end": 87,
    "speaker": "Lex Fridman",
    "timestamp": "(00:12:14)",
    "text": "Let’s try. So not everybody in Israel."
  },
  {
    "start": 88,
    "end": 89,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:12:17)",
    "text": "Of course."
  },
  {
    "start": 90,
    "end": 91,
    "speaker": "Lex Fridman",
    "timestamp": "(00:12:17)",
    "text": "So let’s look at several groups. So people in government, IDF soldiers and citizens that are neither of those. And not everybody of any of those sees Palestinians as less than human, just some percentage. So what percentage is that in your sense?"
  },
  {
    "start": 92,
    "end": 93,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:12:39)",
    "text": "It’s the people who have the power."
  },
  {
    "start": 94,
    "end": 95,
    "speaker": "Lex Fridman",
    "timestamp": "(00:12:41)",
    "text": "So it’s mostly the focus of your commentary, when you say, “People in Israel,” you really mean the people in power."
  },
  {
    "start": 96,
    "end": 97,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:12:47)",
    "text": "The people who have the power, but as much as, of course, I mean the people in power, because even when I speak about America, I speak about people in power. When I speak about Egypt, I speak the people about power, because you can’t really talk about the 100 million people in Egypt, or the 11 million people in Israel. Of course not. There are people who go in, and they demonstrate against Netanyahu and they want him out of the government. But we have to admit that the Israeli society at a whole have moved quite bit to the right and has been many extreme. And you know what happens when you go to the right or you go to the most extreme, the other person go to the most extreme, and extremism breeds extremism. So thank you for the clarification, but I really meant, with the people of power. When people criticize the United States for going in Iraq, of course I’m not criticizing citizens."
  },
  {
    "start": 98,
    "end": 99,
    "speaker": "Lex Fridman",
    "timestamp": "(00:13:32)",
    "text": "But you made another point, which is an interesting point and it’s very difficult to see in the heart of people. But I wonder if you look at the average Palestinian and the average Israeli, and when they look at the other, do they have some hate in their heart? Well, everybody probably has some. What is that amount? When you look at a person that looks different than you, how much hate is there?"
  },
  {
    "start": 100,
    "end": 101,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:13:57)",
    "text": "It depends on what is the living situation of each person. So in the Berlin Film Festival, just like a few couple of weeks ago, there was an Israeli and a Palestinian receiving an award together. And the Israeli director said, “We are going to go back to Israel. He’s going to go to the West Bank, he will have no rights, and I’ll have full living rights.” These people managed to work together and be friends, and they have empathy to each other. Now, the average Palestinian, it’s a very difficult question because is it the Palestinian in the diaspora or the Palestinian in Gaza? Or the diaspora in the West Bank or the one as a citizen of Israel, who still have less right than a normal citizen of Israel, a Jew?” And it really depends. There are Arabs in Israel who are having a great life, and there are people, Arabs, who are having a miserable life, but definitely people that living in Gaza or in the West Bank is kind of like on the lower tier of the living conditions. Now, let’s talk about the hate. What does that Palestinian see from an Israeli? The Palestinian see oppression, limitation of movement, limitation of freedom. And then when there’s something happens, you see the full force coming in, destroying their home, taking away members of his family. There would be absolutely no reason for him to love the other. The Israeli, because he doesn’t have the power, but he lives under his government, all he sees is the rockets or whatever, but he sees the reaction and he doesn’t see what happened to those humans. And as humans, we are selfish. We see what really affects us as humans. And I cannot even imagine what it would be like to live as a Palestinian, and I’m not even talk about Gaza because everybody talks about Gaza. But let me give you an example, and I’m not going to talk about the 12,000 kids killed in Gaza, let’s talk about just the four weeks in the West Bank."
  },
  {
    "start": 102,
    "end": 103,
    "speaker": "",
    "timestamp": "(00:15:57)",
    "text": "March 4th, Amir al-Najjar, age 10, sitting next to his father, shot in while he’s sitting in the car next to his father by the IDF soldiers. Mohammed Ziyad, 13 years old, March 3rd, shot in front of a UN school while sitting with his friends. Mohammed Ghanem, age 15, March 2nd, he shot while standing in front of a storefront during a night raid. February 23rd, Saeed Jardal, he was killed by a drone fire. February 22nd, Fadi Suleiman killed while standing in front of a top of a red cross building. Nihil Ziyad, February 14th, Valentine’s Day, killed and shot in the head while leaving school. February 11th, Mohammed Khattour, US citizens killed while being in a parked car. And [inaudible 00:16:54], February 9th, killed right in front of his home because a military car came reversing back to him, and then somebody opened the door, shot him and leave. This is a daily life of people in the West Bank."
  },
  {
    "start": 104,
    "end": 105,
    "speaker": "Lex Fridman",
    "timestamp": "(00:17:07)",
    "text": "What is the justification the IDF provides?"
  },
  {
    "start": 106,
    "end": 107,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:17:11)",
    "text": "Terrorism."
  },
  {
    "start": 108,
    "end": 109,
    "speaker": "Lex Fridman",
    "timestamp": "(00:17:13)",
    "text": "Terrorism?"
  },
  {
    "start": 110,
    "end": 111,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:17:14)",
    "text": "Or I don’t know. I mean you cannot really say, “Human shields,” but they would say they were throwing rocks. There was a guy who went on Chris Rock and he said his son, a US citizen was killed, and they were throwing rocks, so we killed him. Even when they were throwing rocks, you killed him? But the thing is, you see, this is how easy for them to get rid of Palestinians. I mean, I had to say, I prepared a little bit for the podcast because you are in tech and I am ignorant in tech. There is a movie called The Lab. It is directed by an Israeli director called Yotam Feldman. And he talks about how the military industry in Israel is very advanced. And what is really mind-boggling is in that movie, he shows how the military tests its weapons in the field, in urban areas, on Palestinians."
  },
  {
    "start": 112,
    "end": 113,
    "speaker": "",
    "timestamp": "(00:18:08)",
    "text": "It is heartbreaking, as a doctor, there’s five stages of trials. There is discovery, pre-clinical, clinical, and then market, and then post-market evaluation by the FDA, the FDA approve, and then the FDA post-market. Five just to take a pill. And you go in and he interviews people as like, “Where did you test this?” They tested in the field."
  },
  {
    "start": 114,
    "end": 115,
    "speaker": "",
    "timestamp": "(00:18:35)",
    "text": "So when human life is so cheap, and it is so indispensable, it gave me a visceral reaction because this has been actually the state of humanity. Humanity lived, and survived and thrive by actually killing each other. But there was kind of a, we were remotely, we are removed from it. People in Greece didn’t know what the Alexander the Great was doing. He was killing and pillaging. We call him, “The Great,” but he was killing. He was conquering, he was invading. Julius Caesar, all of the greats, he would do it, but killing was difficult. Killing had to have some sort of… You have to be with your enemy. Then you go back, catapults, then cannons, then a little bit back, and then you are kind of starting remotely. Now you’re killing people behind the screen with a push of a button. A lot of people say, “Terrorism, they killed you with a knife, killed one person with a knife, shot you. That’s terrorism.” But if you fly a $64 million F-16 and you drop up in an A-84 bomb that costs $16,000, that’s not terrorism because it’s remote. You’re behind the screen."
  },
  {
    "start": 116,
    "end": 117,
    "speaker": "",
    "timestamp": "(00:19:49)",
    "text": "So what happened, what Israel is doing, it is removing itself, like America too, drones [inaudible 00:19:55]. And then when you push someone to be, they always brag about bombing them to the Stone Ages. What happens when the screens, and all of the obstacles that you have been put between you and those people, that you have treated them this way, when this is a breach and you come face to face, you will come face to face with what you have created."
  },
  {
    "start": 118,
    "end": 119,
    "speaker": "Lex Fridman",
    "timestamp": "(00:20:17)",
    "text": "Yeah, there’s a lot of interesting things you just said. So one is the methodology of killing. If you want to look at some horrific, hard-scaled killing, people often talk about the Holocaust, but that’s visceral. You can look at Holodomor by Stalin, where the murders through starvation."
  },
  {
    "start": 120,
    "end": 121,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:20:37)",
    "text": "By Churchill in India."
  },
  {
    "start": 122,
    "end": 123,
    "speaker": "Lex Fridman",
    "timestamp": "(00:20:39)",
    "text": "Churchill, in India, and the Great Leap Forward by Mao. So starvation is a thing we don’t often think of it as murder because it’s quiet, it’s slow. And the interesting thing about starvation is that the people don’t complain as they’re dying because they’re exhausted. That’s one. And the other is the value of human life, it does seem that every culture has an unequal valuation of human life. So those two things combined create a complicated military landscape of the world."
  },
  {
    "start": 124,
    "end": 125,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:21:22)",
    "text": "Yes, but the thing is that how we would look at technology as the savior, as if we talk about how, “AI will disrupt, will disrupt, will disrupt.” And now if you talk about going to the West Bank, the people in the West Bank walk, and they don’t see humans, they see people shouting them from towers or behind the screens and they have biometrics that is developed by Basel System, that’s done by HP or Google and Amazon who are part of Project Nimbus. And you see indivision developing all of this metric, and surveillance and all of that stuff. And then, you have something like the gospel that people have actually said that the gospel can actually create a target list using AI and give you a green, yellow, or a red to go ahead. And now AI is not just disrupting the market, it’s disrupting our humanity. And we became so comfortable killing people from afar, killing people with a push of the button. And now it is like dating apps when you swipe left and right, it’s like, “Oh, right,” it becomes so cheap. It’s not meeting someone. It’s like, “Oh, [inaudible 00:22:36],” it’s like a lot of fish in the sea. Same with AI. Boom, 500 people killed. Boom, get killed. It’s so easy, it’s so easy, it’s so easy. And then it’s so far removed from you."
  },
  {
    "start": 126,
    "end": 127,
    "speaker": "",
    "timestamp": "(00:22:46)",
    "text": "So when you put these people in this condition, you have literally put them in a different universe than yours. You are behind in your air conditioned screens, pushing them, blowing up a university. It’s amazing. But then you meet what you have done, you meet the Frankenstein that you have created, and then people are like, “Oh, look what they did to us.”"
  },
  {
    "start": 128,
    "end": 129,
    "speaker": "Lex Fridman",
    "timestamp": "(00:23:07)",
    "text": "You just gave me this image of a dating app from hell. Where leaders are just sitting there and swiping left, right."
  },
  {
    "start": 130,
    "end": 131,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:23:15)",
    "text": "Like, “Invade,” “Destroy.” “Puppet government.”"
  },
  {
    "start": 132,
    "end": 133,
    "speaker": "Lex Fridman",
    "timestamp": "(00:23:21)",
    "text": "Yeah. And then, turn off the phone and go to sleep. So I traveled to the West Bank and I mentioned to you offline that I really loved the people there. I’ve met a bunch of people like that in Eastern Europe where I grew up. Yeah, like the flamboyant, the big personalities, all of that. I also met a person who’s in charge of a refugee camp who was shot by an IDF soldier. And I’m not sure the words he said are important as the consequences of the thing that you mentioned, which is the deep hate in his eyes. That didn’t feel repairable at all. It was pain, it was like a foundation of pain, and on top of that, a hatred. And I was like, “Wow, you kill one person. This is what you create.”"
  },
  {
    "start": 134,
    "end": 135,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:24:19)",
    "text": "Mm-hmm. Because we have kind of like a front row seat to what’s happening. We think we are in it, but we can’t really grasp it. I mean people’s like, ” Oh, we’re just going to go in, get Hamas out and we are going to get them back in.” And what about the people get back in? How do you think they would look at you? What have you created? What have you done?"
  },
  {
    "start": 136,
    "end": 137,
    "speaker": "",
    "timestamp": "(00:24:44)",
    "text": "My show in Egypt was all about propaganda. It’s all about the use of words. Words are very important. The decapitated babies were not chosen randomly. Because you see, it plants a certain image in your brain. Imagine if you’re going in what a baby can do; it can smile, cry and poop, that’s it. It is absolutely no threat. So when you tell people, “40 decapitated babies, they’re so animalistic, they didn’t see the babies. Women raped. Of course, he’s an animal to do that.” And they would go through that and what was very frustrating about the conversation is the Gish galloping. The gish galloping. You see the distractions? You see what happens? ” What’s the proportionate response?” “Can Israel defend itself?” “Do you condemn Hamas?” “Does Israel have the right to exist?” “Decapitated babies.” “Raped women.” “Why don’t the Arab countries take them?” “Muslims kill Muslims.” “Look what happened in Yemen, in Syria, in Iraq.” See how they kind of distract you? They throw little things at you so you don’t know what to do. Or the honor war, “The UNN,” “Anti-Semitic.” “October 7th,” “October 7th,” “October 7th,” and then suddenly you are distracted and pulled into discussing all of these little things and you’re not discussing what’s happening right now. It is basically stalling, giving them time to do what they do."
  },
  {
    "start": 138,
    "end": 139,
    "speaker": "Lex Fridman",
    "timestamp": "(00:26:06)",
    "text": "So there’s some degree to the propaganda though. So the beheaded babies and all this kind of stuff that is so over the top that it shuts down actual conversation about actual wrongs, war crimes on both sides. So it’s overstating it to where everyone on social media and everywhere in the press and everywhere is arguing, almost become desensitized to actual horrors of death, which are more mundane. They’re not so dramatic as beheaded babies."
  },
  {
    "start": 140,
    "end": 141,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:26:35)",
    "text": "Yeah, because may be shot, but decapitated babies, there’s like a knife blade that goes into the skin, the trachea, the flesh, the spine. Decapitated. You can just, like, “He’s dead.” No, you go in. This is the hate. So much hate. And that’s why you-"
  },
  {
    "start": 142,
    "end": 143,
    "speaker": "Lex Fridman",
    "timestamp": "(00:26:51)",
    "text": "You have made me laugh at the darkest shit. You’re such a beautiful person. Your dark humor is just wonderful."
  },
  {
    "start": 144,
    "end": 145,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:27:01)",
    "text": "But you see this happened to Jews before. Remember blood libel? Where did the blood libel come from? It come from these rumors that Jews suck baby’s blood. This is what they did to them."
  },
  {
    "start": 146,
    "end": 147,
    "speaker": "Lex Fridman",
    "timestamp": "(00:27:11)",
    "text": "Yeah, it’s in the cup."
  },
  {
    "start": 148,
    "end": 149,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:27:12)",
    "text": "Exactly. That’s a very delicious baby cup."
  },
  {
    "start": 150,
    "end": 151,
    "speaker": "Lex Fridman",
    "timestamp": "(00:27:15)",
    "text": "Delicious baby blood."
  },
  {
    "start": 152,
    "end": 153,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:27:16)",
    "text": "But this is what you do. You tell people something. And it happened with the Native Americans when they were here, when they went in and they wipe a whole tribe. And Jewish people, one of the minorities that were persecuted and had this used against them for a very long time, and it is terrible, and it’s terrifying that’ it’s been used again."
  },
  {
    "start": 154,
    "end": 155,
    "speaker": "Lex Fridman",
    "timestamp": "(00:27:35)",
    "text": "So I just did a very lengthy debate on Israel and Palestine and the really painful thing from that, those two historians, and it was deep, it was thorough, it was fascinating. But in constantly asking about sources of hope or solutions, there was none. There was a really dark sense of, it’s hopeless, from both sides. It’s hopeless. So I look to you for a source hope. For a source of hope. Is there any hope here? Solutions? Short term, long term?"
  },
  {
    "start": 156,
    "end": 157,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:28:22)",
    "text": "Obama have kind of summarized this beautifully in his book. He said, the reason why the Israeli-Palestinian conflict is so chronic is one side have so much power and the other side have absolutely no power. And that’s what Obama said, he said, you have Israel, that basically don’t listen to us because they’re supported by people who are bigger than the president, bigger than administration. They know that they can. I mean, Netanyahu was quoted on tape many times saying like, he’s basically belittling Americans like, “We control 80% of the population. We don’t care.” This has nonchalant, kind of like, “We have them.” And there’s nothing really that compels Israel to give up anything because at the end of the day, what is compromise? Compromise is like, “I give something, you give something.” Israel’s giving anything, and they project that on you."
  },
  {
    "start": 158,
    "end": 159,
    "speaker": "",
    "timestamp": "(00:29:15)",
    "text": "So for example, how many times have we heard, “Oh, Palestinians were giving four, five, six, seven, 15 chances and they said no to them.” And yet when you read the history, that’s not the case at all. For example, in the whole idea about Arafat walked away from Oslo, that didn’t happen. And there is an incredible video by, what’s his name? Joe Scarborough with Misha. And they were hosting her father Brzezinski. He was the national security advisor. And Joe Scarborough was like, “Well, Arafat left the Oslo Accord and the Palestinians left.” And then Brzezinski said, “This is like embarrassingly shallow.” It’s like, “Listen, what happened was there was a lot of catches on the Oslo Accord. It was very unfair to the Palestinians. So Arafat said, “I agree, but I need to take it to the Arab capitals.”” And they went to Sharm el-Sheikh, they came to Egypt, and he and Ehud Barak went to there. And then Ehud Barak left because there was election and he lost the Ariel Sharon game and it was destroyed. This is one of the reason why people… It’s kind of like facts don’t matter as much as what is the narrative that has been controlled."
  },
  {
    "start": 160,
    "end": 161,
    "speaker": "Lex Fridman",
    "timestamp": "(00:30:32)",
    "text": "But what were the biggest barriers to peace there? Do you think it’s, fundamentally leaders don’t want a two-state solution? Or was there nuanced small differences that, if solved, could lead to a two-state solution?"
  },
  {
    "start": 162,
    "end": 163,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:30:46)",
    "text": "I mean, maybe there was a certain point when the Israeli leaders were more open to compromise. But I can’t say that because each time Israel gives back land, it has to be after some use of force. The 1973 war, the first and second, the casualties in Gaza, they never give up land willingly and because of peace. Because if I have that much military, I can do whatever I want, why would I give up anything? I have that much power. Why would America or China give everything if they’re so powerful? And especially if they have this kind of open check from the United States. So it is really about what can push Israel to give up something? Because you are so much stronger than me, what could compel you to give up something? And this is why the whole thing about trying to equalize Palestinians and the Israeli state and government, it doesn’t make any sense."
  },
  {
    "start": 164,
    "end": 165,
    "speaker": "Lex Fridman",
    "timestamp": "(00:31:49)",
    "text": "So what is the source of hope? John Stewart, who will talk about it from many angles, somebody you admire, a friend, he proposed a two-state solution."
  },
  {
    "start": 166,
    "end": 167,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:32:03)",
    "text": "Of course."
  },
  {
    "start": 168,
    "end": 169,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:07)",
    "text": "Look to the comedians for hope."
  },
  {
    "start": 170,
    "end": 171,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:32:09)",
    "text": "Yes. Well, everybody’s talking about the two-state solution, but Israel has said many times, or Netanyahu and [inaudible 00:32:15], “There’s going to be no state solutions.” In the past, it’s like even Naftali Bennett, he came in on [inaudible 00:32:23] like, “Yeah, maybe in the past we wanted two-state solutions, but look, every time we give them land, they kill us. So no state solutions.” And they are openly saying it."
  },
  {
    "start": 172,
    "end": 173,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:29)",
    "text": "But that’s, perhaps rhetoric?"
  },
  {
    "start": 174,
    "end": 175,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:32:31)",
    "text": "The rhetoric that is supported by action. Because look at what they’re doing in the West Bank, as you said. They are cutting it, illegal settlement, piecemealing it. So if you have an intention at all to give them anything, why do you keep doing this?"
  },
  {
    "start": 176,
    "end": 177,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:48)",
    "text": "And you’ve called it, “A bunch of little Gazas.”"
  },
  {
    "start": 178,
    "end": 179,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:32:51)",
    "text": "Yeah."
  },
  {
    "start": 180,
    "end": 181,
    "speaker": "Lex Fridman",
    "timestamp": "(00:32:51)",
    "text": "It’s a nice little picture of what’s happening."
  },
  {
    "start": 182,
    "end": 183,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:32:56)",
    "text": "Piecemealing it. Because what happened in the past four months, the Palestinians have been micro-dosing on it for a very long time."
  },
  {
    "start": 184,
    "end": 185,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:33:00)",
    "text": "The Palestinians have been micro-dosing on it for a very long time. Little by little, little by little. And we would shout every time when it gets too much and then we’ll shut down, and then little by little. But this time it was hard. It was hard to see the blatant oppression. And the world said, “Maybe the Hamas Ministry of Health are giving us the bad numbers. Maybe these are human shields.” And I laughed. There’s 13,000 babies killed. Does that mean that there are 13,000 military target hiding in their diapers? Because it doesn’t make any sense to kill that many babies it’s just like, “Oops, it’s out of our hands.”"
  },
  {
    "start": 186,
    "end": 187,
    "speaker": "Lex Fridman",
    "timestamp": "(00:33:45)",
    "text": "It’s hard to know what to do with those numbers. Just one baby is enough."
  },
  {
    "start": 188,
    "end": 189,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:33:51)",
    "text": "But you know what happens when you hear so many numbers? Numbers become numbers and you become so desensitized. And this is why there’s a difference between saying, “13,000 Palestinian kids dead.” It’s like, “Mila Cohen an Israeli baby, 10 month old, she was killed in her crib.” And this is what we hear from CNN. We never hear a story about the Palestinian kid. That’s why thank you for giving me the space for saying the names of the Palestinian children that were killed just in four weeks. Because humans needs context. They need depth. They need a 3D look at what they can look at. But if you just tell numbers, “Oh.” They don’t mean anything."
  },
  {
    "start": 190,
    "end": 191,
    "speaker": "Lex Fridman",
    "timestamp": "(00:34:34)",
    "text": "Is there some degree to where both leaderships, Hamas, PA, Palestinian Authority, Israel, all want war, like perpetual war to remain in power?"
  },
  {
    "start": 192,
    "end": 193,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:34:49)",
    "text": "That’s an interesting question. But let’s admit something. The Arab regimes in the area have actually used the problem of Palestine in order to stay in power, in order to take, get excuses, have this enemy. And Israel, the Israeli government has used that too. And maybe the Palestinians. But my problem with when going into discussion this is that the two sides are not equal. They’re not equal in power, they’re not equal in influence, and they’re not equal in international support, especially with the United States. People who have made changes in history were the people with power, the people who would have the ability to change things and the Palestinians cannot really change it. What can they change?"
  },
  {
    "start": 194,
    "end": 195,
    "speaker": "Lex Fridman",
    "timestamp": "(00:35:39)",
    "text": "Well, is that true though, with how much support the Palestinian people have? So just like you said, there’s a lot of Arab states that will voice their pro-Palestinian position in order to distract from their own corruption and abuses of power in their own countries. But I don’t think, if you look globally, there’s a complete asymmetry of power and public opinion here, maybe in the press in the West. But if you look globally…"
  },
  {
    "start": 196,
    "end": 197,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:36:12)",
    "text": "But do they have the same kind of weapons that the Israeli have?"
  },
  {
    "start": 198,
    "end": 199,
    "speaker": "Lex Fridman",
    "timestamp": "(00:36:14)",
    "text": "Literally power? No, there’s a major asymmetry of literal power."
  },
  {
    "start": 200,
    "end": 201,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:36:20)",
    "text": "Some money to their leaders. Does that make any difference? And also when you say Palestinian Authority, which authority are you talking about? Hamas or the Palestinian Authority who has been kind of a domesticated, kind of like a puppy for the Palestinians who basically have been an informant on their own people. And this is the thing also that kind of really pissed me off when I was hearing the thing about these things like, “Hamas, Hamas, Hamas, Hamas.” We have Netanyahu on tape confessing that he supported Hamas giving money in order to cause factions between the Palestinians. So it’s just like it doesn’t make… You just told me this. You just told me this, you just told me they didn’t have any support Hamas, but Hamas is like “What?”"
  },
  {
    "start": 202,
    "end": 203,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:01)",
    "text": "To which degree does Netanyahu represent the Israeli people? Is a real question."
  },
  {
    "start": 204,
    "end": 205,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:37:08)",
    "text": "To which point does Trump or Biden represent the American people?"
  },
  {
    "start": 206,
    "end": 207,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:12)",
    "text": "And to which degree does Hamas represent the Palestinian people?"
  },
  {
    "start": 208,
    "end": 209,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:37:16)",
    "text": "None of these represent it, but who have the power in order to make the decisions? It really comes down to that."
  },
  {
    "start": 210,
    "end": 211,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:23)",
    "text": "Well, who does have the power? You’re giving a lot of power to Israel."
  },
  {
    "start": 212,
    "end": 213,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:37:28)",
    "text": "Yeah."
  },
  {
    "start": 214,
    "end": 215,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:28)",
    "text": "But the Arab League-"
  },
  {
    "start": 216,
    "end": 217,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:37:31)",
    "text": "What should Hamas do? What do you think? What should Hamas do?"
  },
  {
    "start": 218,
    "end": 219,
    "speaker": "Lex Fridman",
    "timestamp": "(00:37:33)",
    "text": "Continue doing what the charter says which is trying to destroy Israel. And the role of the Palestinian people is to overthrow Hamas and get a more moderate leadership probably. And the role of the Israeli people is to vote out this right-wing government and elect a more moderate leader so that there’s a chance at peace with two moderate leaders."
  },
  {
    "start": 220,
    "end": 221,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:37:56)",
    "text": "So before Hamas even got to control 2006 Gaza there was a real sure one in 2000, and we all know what happened, and I really sure one kind of had make the came up with this amazing policy of breaking kids’ bones in the into father. So even Barrack he was also, I mean which one is moderate I think is Hamas is a product of what happened. I mean, if there was no apartheid in South Africa, there will be no NFC. There will be no Nelson Mandela though if there was no Nazis in Paris will be no French resistance. And I’m not saying, and again, I don’t want to be put in a position to defend Hamas or anybody because you know what that entails. But those are Hamas, again, not defending them."
  },
  {
    "start": 222,
    "end": 223,
    "speaker": "",
    "timestamp": "(00:38:50)",
    "text": "They went into October 7th. Why did they did that release our hostages, the people in prison? Because if you’re talk about people who are kidnapped, Israel kidnaps people every single day and when they had the first exchange in November 4th, Israel leaves 400 people. Three quarters of them were women and children. Why are those people in prison? There’s one in four kids that are in prison that stay in solitary confinement, which is by international law, a form of torture and you’re putting kids through that."
  },
  {
    "start": 224,
    "end": 225,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:22)",
    "text": "Is it possible, so first of all, ceasefire and longer term, is it possible for Arab states and the United States to get together and with power through diplomacy enforce a solution?"
  },
  {
    "start": 226,
    "end": 227,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:39:41)",
    "text": "It’s a very, very ideal solution, but you know and I know that Arab states don’t really have the power. All of the powers are in the hands of America."
  },
  {
    "start": 228,
    "end": 229,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:51)",
    "text": "I think they have the power. See, I think they have the power."
  },
  {
    "start": 230,
    "end": 231,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:39:54)",
    "text": "Maybe they Don’t want to use it. Maybe they don’t want to."
  },
  {
    "start": 232,
    "end": 233,
    "speaker": "Lex Fridman",
    "timestamp": "(00:39:58)",
    "text": "Because there is a benefit. The dark sense I have is that a lot of people win from the suffering that Palestinians are going through because they can point to that and distract from"
  },
  {
    "start": 234,
    "end": 235,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:40:14)",
    "text": "Definitely"
  },
  {
    "start": 236,
    "end": 237,
    "speaker": "Lex Fridman",
    "timestamp": "(00:40:15)",
    "text": "Corruption in their own states. And then obviously Iran can benefit also from the same kind of dynamic distracting from the authoritarian nature of their regime."
  },
  {
    "start": 238,
    "end": 239,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:40:27)",
    "text": "Definitely. But what is the core of the problem here? Is it the Arab states using the suffering or actually the suffering itself and the suffering comes from people being displaced. Their homes were taken away. There are 7 million Palestinians in diaspora, seven millions, 7 million went out there and now they’re living in Canada and America and Europe. They had homes there. They cannot go back to 1.7 million people. Of the people in Gaza don’t belong in Gaza. They were pushed from other places. The piecemeal thing of people are being in Germany, I’m going to shift gear a little bit. It’s going to be a little bit of fun. There is a book that I bought the rights to and I want to turn it into a movie, and I optioned the right for two years in March of last year, before October 7th, after October 7th, I bought the permanent, right,"
  },
  {
    "start": 240,
    "end": 241,
    "speaker": "",
    "timestamp": "(00:41:26)",
    "text": "That book, it’s called the Muslim and the Jew, and it is written by an author called Ronen Steinke. I read an article about this book in 2016 and I chased that book for rights for seven years. I didn’t have that much money, but I wanted that book and that book was translated into English called Anna and Dr. Hanmi, and that book tells the incredible story under Nazi Germany where Arabs went in droves to Berlin in 1920s after the first World War in the Weimar Republic, and they became doctors and engineers and journalists for two reasons. Number one, they’re cheap, very cheap because of the inflation. And two, a lot of the Arab nationalists didn’t want to send their kids to England or France because they were the occupiers and Dr. Hanmi was the hero of that. He’s an Egyptian doctor and that’s why I personally connected with him and he went to medical school, didn’t find a place to live, so he lived in the Jewish ghetto."
  },
  {
    "start": 242,
    "end": 243,
    "speaker": "",
    "timestamp": "(00:42:34)",
    "text": "Like many Arabs, he didn’t find a school to work at, a hospital to work in, so he worked in a Jewish hospital. So there was a lot of Arabs who lived with the ghetto and actually the first director of the Berlin mosque with a Jewish convert who converted to Islam, and he was a gay activist. I’m telling you, this is a crazy story, and this is not a fiction story. This is actually like a nonfiction. It’s written actually based on the statement, the documents of the Nazis and Gustavo, Dr. Hemi, he was in this hospital and the Nazis came in and they killed and tortured and beat up the Jewish doctor and they made him the head of his department. Then now he’s surrounded by Nazi doctor. They didn’t touch him because he was an Arab. There was kind of like a thing between Germany and the Arabs because they wanted to appease to them in order to have kind of a grassroots base in the Arab world where he want to go next."
  },
  {
    "start": 244,
    "end": 245,
    "speaker": "",
    "timestamp": "(00:43:38)",
    "text": "And this is why 19 34, 19 35, the racial laws of Nuremberg, they had a name change. First they were called anti-Semitic. Then they changed into anti-Jewish because also Arabs were Semitic, so they wanted to appease the Arabs. Now what happened to Dr. Hanmi when that happened to him, he would go back to the ghetto and he would see the apartments next to him. The Jewish apartments become more and more and more flooded with people because they were moving Jews and pushing them and putting them together, pushing them to the side and each flat, each apartment instead of one family, it would have 3, 4, 6, 7 families. And he was there when at home and he looked, he was there."
  },
  {
    "start": 246,
    "end": 247,
    "speaker": "",
    "timestamp": "(00:44:29)",
    "text": "This is where the people he grew up with, he lived with, and now he’s seeing that kind of discrimination just because he was an Arab. And then he started to kind of atone for, because he felt responsible because he wasn’t treated the same way. And he started to go and treat Jewish people in their homes because they couldn’t go to hospitals. And then one family gave them his daughter. It’s like, this is Anna. Save her. He took her pretended that she’s his niece, put a hijab around her, taught her Arabic, called her Nadia, my daughter’s name by the way."
  },
  {
    "start": 248,
    "end": 249,
    "speaker": "",
    "timestamp": "(00:45:05)",
    "text": "And he hid her in plain sight for seven years in front of the Nazis as his nurse. It’s an incredible story. And then not just that, he went to prison and then he went out and he formed with the Arab people that was imprisoned with him, a network that saves 300 Jews. You see that kind of story. This is the Jews that were living in the airport. I’m not saying that the Jews living in the airport was living like an incredible life. Of course, as LA kind of minority, they did not have the full power of their full advantages of the rule. That’s normal. But we had this kind of a relationship"
  },
  {
    "start": 250,
    "end": 251,
    "speaker": "",
    "timestamp": "(00:45:42)",
    "text": "Before Israel was erected in 1948. And then of course, everybody looked at Jews at time as fifth column. And of course the nationalistic regimes used that. And this is why what Biden said was very dangerous when he said, if there’s no Israel, no Israel, you are the leader of the free world. You are the President of the United States. Do you mean that you are telling me that Jews in your country, in the United States of America are not safe? That is wrong on two levels. Number one, America historically and right now is more safe to Jews in the world than anybody. They’re safer than the Jews in Israel."
  },
  {
    "start": 252,
    "end": 253,
    "speaker": "",
    "timestamp": "(00:46:23)",
    "text": "They never had pogroms or the Holocaust like Europe. They live here a good life, not perfect life, but they’re better. Second of all, if you are the president and you’re telling that a group of people will not feel safe unless there is a different one, you are already feeding into their fifth column. They’re like, you’re Russian. You come from there. And there is a group of laws in the Russian constitution that says that Russia will protect its citizens everywhere in the world. What happens if the president says like, oh, you’re Russians. You’re protected by your own country. Don’t belong here. This"
  },
  {
    "start": 254,
    "end": 255,
    "speaker": "Lex Fridman",
    "timestamp": "(00:46:51)",
    "text": "Is terrible. Yeah, you’re right. That’s actually an indirect threat. Even saying Muslims cannot feel safe in America or something like this. That means that’s a threat."
  },
  {
    "start": 256,
    "end": 257,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:47:03)",
    "text": "But what would a Jewish person in Beverly Hills or in Brooklyn feel if he hears that you are already telling people you need to be loyal to Israel? I mean, Israel is a foreign country. I am sorry, but Israel is a foreign country. Israel is a client country that we sponsor, and it should actually be responsible and held accountable for what they do."
  },
  {
    "start": 258,
    "end": 259,
    "speaker": "Lex Fridman",
    "timestamp": "(00:47:28)",
    "text": "You mentioned 1948, the Nakba, but before that, 41, 39, 41 to 45, the Holocaust. What do you do? What do do with the Holocaust? How do you incorporate into the calculus of what’s,"
  },
  {
    "start": 260,
    "end": 261,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:47:46)",
    "text": "Oh, it’s terrible"
  },
  {
    "start": 262,
    "end": 263,
    "speaker": "Lex Fridman",
    "timestamp": "(00:47:46)",
    "text": "Of morality. That leads up to the displacement of 700,000 Palestinians from the land. How do you work that"
  },
  {
    "start": 264,
    "end": 265,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:47:56)",
    "text": "Out? It is terrible, but I mean the systemic annihilation of Jewish people under the Nazi, that is a carefully engineered thoughtful plan. It was terrible. It was kind of like the human ingenuity put into something that is very evil, but also it is not just that happened. We need to remember that Otto Frank, the father of Anna, Frank has his visa, refugee visa rejected by the United States. There’s a lot of people that were rejected by the United States, rejected by other European countries, and then they were pushed into Palestine."
  },
  {
    "start": 266,
    "end": 267,
    "speaker": "",
    "timestamp": "(00:48:31)",
    "text": "So you have to put yourself between and the Arabs, okay, we’re sitting here, okay, come and then, all right, you don’t have a home or a country anymore that kills you. I mean, you see, if I’m not an Arab and you give me that kind of piece of terrible human tragedy, like oh my God, that is terrible. But then I’m an Arab like, yes, I’m so sorry, but what do I have to do with that? Why is that my fault? The persecution of the Jewish people have started since then the eighth and ninth century because they were like they first anti-Christians, they were with criminal immigrants. They were conspirators. This is the anti people as if Europe kind of throw anti-Semitism on us. You understand that like Henry Ford, Henry Ford is one of the biggest anti, he was the inspiration for Adolf Hitler."
  },
  {
    "start": 268,
    "end": 269,
    "speaker": "",
    "timestamp": "(00:49:28)",
    "text": "This is how anti-Semitic Henry Ford was. And you kind of gloss over that and then suddenly we as Arabs have to pay the price. Why?"
  },
  {
    "start": 270,
    "end": 271,
    "speaker": "Lex Fridman",
    "timestamp": "(00:49:44)",
    "text": "Several questions I want to ask there, but one just zooming out, why do you think hatred of Jews has been such a viral kind of idea throughout human history? Oh,"
  },
  {
    "start": 272,
    "end": 273,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:49:56)",
    "text": "It’s very easy. It all started from Christ. They killed Christ. They kill Christ. They killed Christ. They’re the killer of Christ. That’s a very sexy story. And that stayed for years. That stayed for centuries. I’m sorry, centuries. They’re the killer of Christ. And then the Catholic Church did not allow usury, but they would work in usury, so they become rich. Now, the people that we hate, that we accuse them of feeling Christ are becoming rich. So that’s envy now and that’s hatred. I mean, when you talk about ghettos, ghettos were not just as secluded parts in cities. Sometimes those ghettos or outside the cities, Jews were not even allowed to work a lot of professions."
  },
  {
    "start": 274,
    "end": 275,
    "speaker": "",
    "timestamp": "(00:50:42)",
    "text": "They were not allowed to get into the syndicates of certain professions. So they had to work usually and they got rich, so the people hated them more. The first crusade didn’t kill a single Muslim. All the killed were Jews. And when they finally arrived to Jerusalem, all the killed were Jews. They almost annihilated the Jews. So it was all this, and of course you have the dark ages. Who do you need as an enemy? The Jews. They’re the killer of Christ. There’s nothing bigger than this."
  },
  {
    "start": 276,
    "end": 277,
    "speaker": "",
    "timestamp": "(00:51:15)",
    "text": "And then you fast-forward. I mean, one of the things that I found out that was very, very, very, very crazy when Henry Ford imported the protocols of the elders of Zion, by the way, in the Arab world, protocols of the elders of Zion is so popular and for the obvious years and for the people who don’t know it’s kind of a bunch of stories. And basically it’s like the Jews saying, we got to control the war and we’re going to do this and we’re going to do that and whatever. What people don’t know that that is a work of plagiarism. It was plagiarized from a satirical play called Conversation in Hell between Machiavelli and Montesquieu, and it is kind of based on one chapter or one scene or something. It’s crazy, but it’s crazy"
  },
  {
    "start": 278,
    "end": 279,
    "speaker": "Lex Fridman",
    "timestamp": "(00:52:12)",
    "text": "How sticky it is. Yes, that’s weird"
  },
  {
    "start": 280,
    "end": 281,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:52:15)",
    "text": "Because if I hate you, that’s great, but if I have a story to support that hate, that’s even better."
  },
  {
    "start": 282,
    "end": 283,
    "speaker": "Lex Fridman",
    "timestamp": "(00:52:20)",
    "text": "But it’s one of the best stories, one of the stickiest stories about hate. Of course, it’s probably the most effective. A lot of peoples hate other groups of peoples, but that’s just the sexiest story of them"
  },
  {
    "start": 284,
    "end": 285,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:52:36)",
    "text": "All. Because humans need to concentrate their hate, their insecurities and their shortcomings into one thing that they can practice that hate on. If it’s a person, great, if it’s a group, even better."
  },
  {
    "start": 286,
    "end": 287,
    "speaker": "Lex Fridman",
    "timestamp": "(00:52:55)",
    "text": "How do you into this calculus incorporate That group is pretty small. There’s 16 million Jews worldwide, and you mentioned how is that the responsibility of the Arab peoples? Everybody should be to blame for not taking in Jews after the Holocaust, but the reality of the situation, if we look at the religious slice of this, there’s 16, let’s say million Jews, and there’s, I don’t know how many Muslims, but 1.8 billion. That difference, that a hundred x difference. Do you incorporate that into the sense that Jews in Israel might feel for the existential dread that this small group might be destroyed? Jews"
  },
  {
    "start": 288,
    "end": 289,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:53:48)",
    "text": "In Israel have every right to feel afraid because of everything that they see and everything they’ve been told everything. But I would say that the calculus or the numbers doesn’t, of course being small,"
  },
  {
    "start": 290,
    "end": 291,
    "speaker": "Lex Fridman",
    "timestamp": "(00:54:02)",
    "text": "It"
  },
  {
    "start": 292,
    "end": 293,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:54:03)",
    "text": "Is of course a factor, but it is never an excuse in order to take something that’s not yours. It’s saying like, Hey, you have 300 million Americans and we have 52, 52 give one state for, there’s too many of them, too many of you just give them something. It’s like the fact that I have something and you don’t, and I have, there’s too many of me, and there is little of you. And then you come in and it’s not really Israel against the Arab word or the Muslim or because we have to say we up big time."
  },
  {
    "start": 294,
    "end": 295,
    "speaker": "",
    "timestamp": "(00:54:34)",
    "text": "But it is the Palestinians that are in and they are being subjected to that. So it’s not really like the 1.8 billion and the 16 million Jews and the 1.8 billion. If you look at them, some of them don’t care. Some of them live into regimes that being oppressed and those regimes are supported by the United States in order. It’s easier for me as an empire to take what I want from this country if I control the dictator. And I tell them that his power is linked to my desire to keep him in power. So that’s why you have a total disconnect between people in power in the Arab and the Muslim countries and the people themselves."
  },
  {
    "start": 296,
    "end": 297,
    "speaker": "Lex Fridman",
    "timestamp": "(00:55:15)",
    "text": "Can you speak to the 1948, because you mentioned taking land that’s not yours, maybe parallels with Native Americans. There was a war, the Jewish minority fought that war against several Arab states and won that war. How do we incorporate that into the catalyst?"
  },
  {
    "start": 298,
    "end": 299,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:55:41)",
    "text": "Yeah, well, that’s also a misconception, like a misinterpretation of the event because it seems that it was the small, it’s kind of like a David and Goliath kind of story. And I was always like, how did we not do that? But in reality with numbers, I can’t pull it up right now, but if you look at the numbers, the number of tanks, the planes, the trained officer, because many of those Jewish fighters came from World War Two, they were seasoned fighters and they actually had more planes, more tanks, more artillery, more pieces of weapon, more of all of other combined, because the people that really was Egypt and 1948, many of those Arab countries didn’t even have their independence. So they would kind of send a cavalry or a people in horses. But in fact, the whole idea was like we won against seven nations. The numbers totally in Israel’s favor. They were better equipped, they were better trained. They had more tanks and artillery and airplanes, and they planned better. So yes, they deserved the win because they planned and we did it. So"
  },
  {
    "start": 300,
    "end": 301,
    "speaker": "Lex Fridman",
    "timestamp": "(00:57:00)",
    "text": "To you, there was an asymmetry of military power even then. But what do you do with the fact that the war was won? So if you look at the history of the world, there is wars fought over land."
  },
  {
    "start": 302,
    "end": 303,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:57:15)",
    "text": "I agree with you. This has been the history of humanity. Humanity was not living peacefully. It’s all about people taking people and equaling people taking their land. But there’s two difference here, mostly usually the conquering power. For example, England, they had England and they conquered you in India and after the occupation finished, they go back to England,"
  },
  {
    "start": 304,
    "end": 305,
    "speaker": "",
    "timestamp": "(00:57:39)",
    "text": "France, Greece, Persia, Egypt. They will go in, expand and shrink, expand and shrink. It’s always been there. What is different here is exactly what happened in Australia and the United States. A group of people came in not just to conquer and take the land, but to completely change, to replace them and get them out or kill them. It was very easy with the Indians because they had smallpox. There was no social media. They did it over 400 years. They had time. The problem is what is happening right now, I agree with you. It might not be that new, but we are there and we are watching it happen."
  },
  {
    "start": 306,
    "end": 307,
    "speaker": "Lex Fridman",
    "timestamp": "(00:58:16)",
    "text": "And so now we have to confront the realities of war and empire and conquering,"
  },
  {
    "start": 308,
    "end": 309,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:58:22)",
    "text": "Because what’s the problem? We told ourselves we can be better. After 1948, there was the Universal Declaration of Human Rights. It means that we are going to be better humans. We are not going to kill and take land. We’re not going to displace people. We’re not going to take people for what they’re, there’s now laws, there’s international laws, there’s International Court of Justice, and now Israel is giving the middle finger to all of them."
  },
  {
    "start": 310,
    "end": 311,
    "speaker": "Lex Fridman",
    "timestamp": "(00:58:45)",
    "text": "So isn’t in some fundamental way. This whole thing that we’re talking about is us as a civilization on social media in articles and books, in newspapers. We’re just trying to figure out who are we as a"
  },
  {
    "start": 312,
    "end": 313,
    "speaker": "Bassem Youssef",
    "timestamp": "(00:59:01)",
    "text": "People. I think that the shock came from the fact that we thought that we as humanity have evolved and now we are. What have actually changed is that we became more advanced in effectively eradicating a group of people because of the technology that we have and the fact that we can do that under the eyes and ears of all the world. And we are watching it under our phone. We have a window. We have a window to the war. 1945, people didn’t know what was happening in Japan. Well, we heard about it on the radio like, oh, today our forces came in and they launched. We don’t know. We heard it. Maybe we saw pictures after that and it’s quite edited. But now we see it, we’re into it, and it’s so much for our psyche and we can get it. The Arabs say like, guys, you told us we came to the West because we were told that we were equal."
  },
  {
    "start": 314,
    "end": 315,
    "speaker": "",
    "timestamp": "(00:59:55)",
    "text": "The university declaration of right, one of the co-authors, his name is Stephane Hessel. He’s a Jew. He’s a survivor of the Holocaust. And what happened to him, he died, by the way a couple of years ago, but before he died, he was canceled by so many people and he was called anti-Semitic because he joined the BDS movement and he spoke about truth Palestine, that is the author of the Universal Declaration of Human Rights that we value so much. And we think that that would define our humanity. But then we go in and we are shocked. It’s like maybe we were sold something. Maybe that was false advertisement."
  },
  {
    "start": 316,
    "end": 317,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:40)",
    "text": "You shared a tweet by an account called Awesome Jew. It reads Islamo-Nazi comedian Bassem Youssef comedian in quotes, by the way."
  },
  {
    "start": 318,
    "end": 319,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:00:53)",
    "text": "Yeah, yeah, of course, because I’m not funny."
  },
  {
    "start": 320,
    "end": 321,
    "speaker": "Lex Fridman",
    "timestamp": "(01:00:55)",
    "text": "So Islamo-Nazi comedian, Bassem Youssef is now denying the October. I love that you retweeted this twice, I guess suppose because it’s advertising some upcoming dates. He’s now denying October 7th massacre. The Muslim Radical Bassem Youssef is notorious for his radical radical set twice for his radical hatred of Jews in Israel. In a recent clip, he claims that the atrocities committed on October 7th, they’re fabricated or looking for all information regarding any of his upcoming shows, as well as the venues which host the scumbag. Would Jews feel safe around this Nazi Nazi?"
  },
  {
    "start": 322,
    "end": 323,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:01:34)",
    "text": "Yeah,"
  },
  {
    "start": 324,
    "end": 325,
    "speaker": "Lex Fridman",
    "timestamp": "(01:01:36)",
    "text": "This is my first time interviewing a Nazi"
  },
  {
    "start": 326,
    "end": 327,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:01:39)",
    "text": "Honor. It’s my first time I actually get called a Nazi."
  },
  {
    "start": 328,
    "end": 329,
    "speaker": "Lex Fridman",
    "timestamp": "(01:01:42)",
    "text": "First time. First time."
  },
  {
    "start": 330,
    "end": 331,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:01:43)",
    "text": "I have been called so many things in Egypt. So in Egypt, I was called a CIA operative, a Mossad spy, a secret Muslim brotherhood, a secret Jew. And there was also an article that was published about me in the state-Run Media saying in details how Bassem has been recruited by CIA agents using John Stewart in order to use satire to bring down the country. I was a Freemason, an infidel, a member of the Knights of the Temple, something like that. And there’s actually people, the Muslim Brotherhood on their show, they would say like, he’s action Israeli, and they have forged and Egyptian Id for him to come here. So it’s kind of like when I said I left all of that behind and I come here, it’s like, boom, anti-Semitic, Nazi. I mean, I really covered everything. I don’t know what else. I mean, think it’s kind of like I’m collecting PhDs. I’m just getting all of these credits."
  },
  {
    "start": 332,
    "end": 333,
    "speaker": "Lex Fridman",
    "timestamp": "(01:02:51)",
    "text": "How do you deal with that? How do you deal with the attacks? I mean, this goes back to the decision to do the interview with Piers Morgan. How do you psychologically do all of it?"
  },
  {
    "start": 334,
    "end": 335,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:03:03)",
    "text": "These kinds of attacks? At the beginning its fun, but when they evolve into something else, so for example, I was laughing of all of the stuff about calling me this, calling me that, but then when people would come and thread the theater, because it’s not the people who are making those accusations that would come to you. It’s the people that will hear and see those accusations and act on it. And there’s always the fear of, I mean, we have in the air board a lot of things that somebody would hear something about someone else and go kill him and whatever, anybody else. So there’s this, but somehow I want to make fun of it. And it is to be called an Islamo-Nazi. It must been the funniest thing ever"
  },
  {
    "start": 336,
    "end": 337,
    "speaker": "Speaker 1",
    "timestamp": "(01:03:49)",
    "text": "Does Islam Nazi. Wow. How did you An radical Muslim me. A lot of Islamist’s hate me. They don’t call me a secular infidel. So it’s kind of like, who am I? Maybe I have an identity"
  },
  {
    "start": 338,
    "end": 339,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:04:04)",
    "text": "Crisis and I need the people to tell me who I’m,"
  },
  {
    "start": 340,
    "end": 341,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:08)",
    "text": "Let’s go to the beginning. Let’s go to your childhood. You grew up in Egypt, Cairo, Egypt,"
  },
  {
    "start": 342,
    "end": 343,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:04:13)",
    "text": "Childhood."
  },
  {
    "start": 344,
    "end": 345,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:15)",
    "text": "Well, let’s figure out how you came to be who you are."
  },
  {
    "start": 346,
    "end": 347,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:04:18)",
    "text": "How did you become an Islamo-Nazi."
  },
  {
    "start": 348,
    "end": 349,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:20)",
    "text": "Yeah, exactly. It’s a long journey. I do like the swastika tattoo on your, which I didn’t."
  },
  {
    "start": 350,
    "end": 351,
    "speaker": "Speaker 1",
    "timestamp": "(01:04:28)",
    "text": "How did you see my?"
  },
  {
    "start": 352,
    "end": 353,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:28)",
    "text": "You know what you did. I know I did. It was very inappropriate. You’re also obviously a sexual harasser of me."
  },
  {
    "start": 354,
    "end": 355,
    "speaker": "Speaker 1",
    "timestamp": "(01:04:36)",
    "text": "This is"
  },
  {
    "start": 356,
    "end": 357,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:04:36)",
    "text": "Like a me too."
  },
  {
    "start": 358,
    "end": 359,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:37)",
    "text": "Yes."
  },
  {
    "start": 360,
    "end": 361,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:04:39)",
    "text": "This is like 2020. Someone will come up. It’s like, okay,"
  },
  {
    "start": 362,
    "end": 363,
    "speaker": "Lex Fridman",
    "timestamp": "(01:04:41)",
    "text": "We clip it. This is your me too moment. All right, Cairo, what’s, what’s a defining memory, positive or negative from your childhood?"
  },
  {
    "start": 364,
    "end": 365,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:04:54)",
    "text": "My memory in general was cool. It was cool. I went to a Catholic school for primary school, elementary, and by the time I’d done, there was kind of a start of a decline into the public education. And my parents, they’re middle-class working officials. My dad was a judge, my mom was a business professor and they were one of the people who’s like, they didn’t have that much luxury. My dad drove a regular car, a Fiat, which is the equivalent for the Lada in Russia."
  },
  {
    "start": 366,
    "end": 367,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:30)",
    "text": "Thank you for speaking to the audience."
  },
  {
    "start": 368,
    "end": 369,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:05:35)",
    "text": "Lada."
  },
  {
    "start": 370,
    "end": 371,
    "speaker": "Lex Fridman",
    "timestamp": "(01:05:35)",
    "text": "So would that be a good car"
  },
  {
    "start": 372,
    "end": 373,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:05:38)",
    "text": "Or bad car? No, it’s kind of like the minimum. And my dad was not a command of showing off whatever money they would do. They would put it for us. Education, give everything to their kids. This is kind of a very, very typical mentality, and I’m sure it’s in many cultures, but we grew up with this. Everything that we have is like for kids, so they will put us into education. So."
  },
  {
    "start": 374,
    "end": 375,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:06:00)",
    "text": "… everything that we have is left for kids, so they will put us into education. So middle school, that was… 1986 was the beginning of the explosion of international schools, private schools. And these schools were relatively expensive. Of course now with today’s currency, it’s ridiculous, but at that time it’s very expensive. So I went to that school, and from… There was this moment, it was like you feel less right away. I mean, of course there’s the regular bullying and stuff, but it’s not that. It’s kind like you always feel less. You don’t have that much of purchasing power that can allow you to go to the same outings or travel with them. And even how you dress, it will be modest compared to them."
  },
  {
    "start": 376,
    "end": 377,
    "speaker": "",
    "timestamp": "(01:06:43)",
    "text": "So I was always an outsider, and I compensated with that by two things, being good at school and being good at sports. So I was not like the typical nerd. It was just like, I was playing football, basketball, track and field, and I was one of the… People would like to have me on their team. So I wasn’t kind of like, “Ah, he’s a nerd, get him away.” But I never had a girlfriend. I never had any kind of… I was not boyfriend material. So that kind of leaves remnants in you, that you’re not good enough."
  },
  {
    "start": 378,
    "end": 379,
    "speaker": "Lex Fridman",
    "timestamp": "(01:07:15)",
    "text": "But psychologically you were always… Like when you were by yourself, you felt like an outsider."
  },
  {
    "start": 380,
    "end": 381,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:07:19)",
    "text": "Yes, all the time. And that’s why I’m more of a loner. I don’t have a lot of what you call friends. I have acquaintances, people that I do stuff with, but I don’t have the people that I tell them everything. When I went to medical school, now medical school is a different animal. Medical school is where all of the people from the public schools go. Public schools are very… They don’t have English language as a strong part, but they are brilliant people, because they would mostly study in Arabic. But they are brilliant and they are very, very, very smart, very sharp. But then I’ll go there. Now I am the sissy boy from the private school that comes into medical school. Now I’m an outsider again, and I go into residency and I pick up salsa. So now I’m a salsa teacher while being a cardiothoracic surgery resident. And I’m an outsider for the third time because in salsa, I’m kind of like the respectful doctor. And in resident, I’m the guy who is just dancing. And everything, of course, as a medical resident, you will mess up a lot."
  },
  {
    "start": 382,
    "end": 383,
    "speaker": "",
    "timestamp": "(01:08:25)",
    "text": "So they would always like, “Oh, because you’re a dancer. Oh, because you don’t care about medicine. You just want to go there and dance with women,” which is true. So all of my life, I felt that I’m an outsider. I’m not part of the team. I’m not part of the core group. And I have a story that you would love. Right before my residency, I was so much into salsa, so I had all of the money, and then you saved that. And I was working summers and I was doing extra jobs, and I took that money and I went to Miami in order to learn Rueda de Casino, which is the Cuban kind of circle salsa kind of thing. And I went there in the summer of 2001. My return ticket was 9/12/2001."
  },
  {
    "start": 384,
    "end": 385,
    "speaker": "Lex Fridman",
    "timestamp": "(01:09:22)",
    "text": "The universe has a sense of humor. I got to tell you that."
  },
  {
    "start": 386,
    "end": 387,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:09:26)",
    "text": "9/12, I was supposed to be on a plane coming back to Egypt. What happens? Thank God I ran out of money 10 days before that. It was like, “All right,” I changed my ticket and I came back. 9/11. I’m kind of like, ah, sleeping… My mom, “Wake up, wake up!” “What? What?” And I see the two tower falling, Mom was like, “Oh, you’re here, you’re here, you’re here, thank God you’re here.” And I was like, “I could have been in Guantanamo right now.”"
  },
  {
    "start": 388,
    "end": 389,
    "speaker": "Lex Fridman",
    "timestamp": "(01:09:54)",
    "text": "Yeah, flying on 9/12."
  },
  {
    "start": 390,
    "end": 391,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:09:58)",
    "text": "But by the way, I was in Miami when they went to the flying school, in Miami. So I mean, I had like 9/11 written all over my face."
  },
  {
    "start": 392,
    "end": 393,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:08)",
    "text": "You’d be all over the news."
  },
  {
    "start": 394,
    "end": 395,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:10:09)",
    "text": "All over… And my mom was like, “What? He went there to dance salsa. I didn’t know that salsa is like a name for terrorists.”"
  },
  {
    "start": 396,
    "end": 397,
    "speaker": "Lex Fridman",
    "timestamp": "(01:10:17)",
    "text": "Why salsa? Why did that attract you? Can you explain what salsa is? So I mentioned to you offline that I’ve been doing a little bit of tango, trying to learn it."
  },
  {
    "start": 398,
    "end": 399,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:10:25)",
    "text": "Yeah. Samba, salsa, bachata, merengue. It’s kind of like Latin dances and it’s like… I don’t know how you describe salsa. Couple dance and Latin beat. And I did it because I once… And I talk about that in my Arabic stand-up comedy, not the English. I talk about how I didn’t have really a great social life. And my friends went there one day, and I go into a place which it was called El Gato Negro. No, no, it was called Big Fat Black Pussycat. And then I think they thought it will be racist or something though, so to change it to El Gato Negro. Anyway, so-"
  },
  {
    "start": 400,
    "end": 401,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:14)",
    "text": "Great, great, great decision."
  },
  {
    "start": 402,
    "end": 403,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:11:18)",
    "text": "I know. So I went there. I was like, “Damn! Music and women and I’m a doctor, a doctor dancing salsa. That is a chick magnet.”"
  },
  {
    "start": 404,
    "end": 405,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:26)",
    "text": "Yeah, 100%."
  },
  {
    "start": 406,
    "end": 407,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:11:28)",
    "text": "We do everything for that."
  },
  {
    "start": 408,
    "end": 409,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:31)",
    "text": "All of human [inaudible 01:11:32]"
  },
  {
    "start": 410,
    "end": 411,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:11:32)",
    "text": "Even power, even money."
  },
  {
    "start": 412,
    "end": 413,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:33)",
    "text": "All the wars we’ve been talking about."
  },
  {
    "start": 414,
    "end": 415,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:11:35)",
    "text": "Women."
  },
  {
    "start": 416,
    "end": 417,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:37)",
    "text": "At the end of the day-"
  },
  {
    "start": 418,
    "end": 419,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:11:37)",
    "text": "The approval from the other sex. We are babies. We are terrible people. So of course that was great. But then, as a nerd, I went in so hard and now I became a salsa teacher. And I earned more money from salsa, more than I did as a doctor’s resident."
  },
  {
    "start": 420,
    "end": 421,
    "speaker": "Lex Fridman",
    "timestamp": "(01:11:58)",
    "text": "I didn’t know this part of you. That’s hilarious."
  },
  {
    "start": 422,
    "end": 423,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:12:02)",
    "text": "I know. I was making a killing amount of money, huge amount of money. And I would go finish my shift and I’d go to the salsa class, and sometimes I would have like 70 people in my salsa class."
  },
  {
    "start": 424,
    "end": 425,
    "speaker": "Lex Fridman",
    "timestamp": "(01:12:16)",
    "text": "Oh wow."
  },
  {
    "start": 426,
    "end": 427,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:12:16)",
    "text": "I had the biggest salsa class in Egypt, at the beginning of the 2000. And it was fantastic. And it was an outlet because you go there and there’s the shifts and people dying. Damn. And then you go salsa."
  },
  {
    "start": 428,
    "end": 429,
    "speaker": "Lex Fridman",
    "timestamp": "(01:12:28)",
    "text": "An escape. You must’ve been good."
  },
  {
    "start": 430,
    "end": 431,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:12:31)",
    "text": "I was okay. I was cool. I was fun. There were people better than me, but I have a thing about teaching. I like teaching people."
  },
  {
    "start": 432,
    "end": 433,
    "speaker": "Lex Fridman",
    "timestamp": "(01:12:39)",
    "text": "So you mentioned heart surgery. So what motivated you to become a doctor?"
  },
  {
    "start": 434,
    "end": 435,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:12:43)",
    "text": "It was a choice of exclusion. I mean, there’s nothing else you can do with these high grades other than doctor and engineering. I hate math, so go be a doctor. This is the Middle East. What do you expect? It’s either… In my joke in my show, I said you can be one of three things in the Middle East, a doctor, an engineer, or a disappointment. That is the choices that you have. So years after, I’m a disappointment."
  },
  {
    "start": 436,
    "end": 437,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:14)",
    "text": "You’re damn good at it though. That’s a hard path, though. And it’s a fascinating one for-"
  },
  {
    "start": 438,
    "end": 439,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:13:22)",
    "text": "Can I tell you something?"
  },
  {
    "start": 440,
    "end": 441,
    "speaker": "Lex Fridman",
    "timestamp": "(01:13:22)",
    "text": "Yes."
  },
  {
    "start": 442,
    "end": 443,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:13:23)",
    "text": "That actually I was thinking about why did I actually go into medicine and why did I always choose the hardest thing, although I didn’t love it? And I have to tell you, I had an epiphany only two weeks ago, and I don’t know if that’s actually related or not. Remember when I told you I went to this school, and I didn’t have that much money and I didn’t have the luxury of time or money to be with those people and do what they do? So by the time I finished school and everybody was going to university, everybody in my school went to the AUC, the American University in Cairo. Of course, private American education, party time."
  },
  {
    "start": 444,
    "end": 445,
    "speaker": "",
    "timestamp": "(01:14:03)",
    "text": "I mean, of course they’re brilliant and everything, but they have a different social life. And part of me now, I realize that just very, very recently, maybe I went to the hardest school ever so I don’t have space to use other than studying. Because if I have that much space, what I’m going to do with it? I don’t have that much freedom. I don’t have that much money. I can’t compete with those people going out, so maybe I need a solid excuse that I’m in a place where I don’t have that much of a spare time."
  },
  {
    "start": 446,
    "end": 447,
    "speaker": "Lex Fridman",
    "timestamp": "(01:14:41)",
    "text": "Is it also possible… I like how this is a therapy session where we’re psychoanalyzing you. Is it also possible that you always just pick the hardest thing you could possibly do?"
  },
  {
    "start": 448,
    "end": 449,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:14:50)",
    "text": "Maybe, but-"
  },
  {
    "start": 450,
    "end": 451,
    "speaker": "Lex Fridman",
    "timestamp": "(01:14:52)",
    "text": "Maybe that’s the Piers Morgan thing too."
  },
  {
    "start": 452,
    "end": 453,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:14:55)",
    "text": "Maybe. But when I left Egypt and I came here, I still had the choice to go back to medicine. But I hated it. Medicine traumatized me. The amount of… You give up… My brother in Egypt, he had a daughter. She’s a brilliant basketball player. She’s in the national team. Amazing. I used to play basketball also in the Egyptian League, but I never was… Kind of my favorite position in the court was the bench, and I was not as good as her. And then it was time for her to go into college, and he didn’t talk to me for six weeks. I said, “Tamer, what’s happening to Farida? Which college?” Like, “I didn’t want to tell you. She went into medicine.” I said, “What? Medicine? Why did he do?” Because he knows how I hated it. I was traumatized. And I said, “Dude, she’s a basketball player. Make her go to an easy school.” Said, “Nah…” So that’s kind of why-"
  },
  {
    "start": 454,
    "end": 455,
    "speaker": "Lex Fridman",
    "timestamp": "(01:15:49)",
    "text": "You still did it. You still did it."
  },
  {
    "start": 456,
    "end": 457,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:15:53)",
    "text": "I still did it, but I don’t know, is it because of the difficulty or because of what I told you? Maybe I needed something. Maybe because I was not very confident in my social life, so I needed a distraction not to have that much of a social life."
  },
  {
    "start": 458,
    "end": 459,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:07)",
    "text": "Oh wow, okay."
  },
  {
    "start": 460,
    "end": 461,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:16:09)",
    "text": "You understand?"
  },
  {
    "start": 462,
    "end": 463,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:09)",
    "text": "I see. Yeah."
  },
  {
    "start": 464,
    "end": 465,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:16:11)",
    "text": "It’s kind of… Because I will always have an excuse. I’m studying, I have something, I have exams. And I don’t know, I kind of self-sabotaged my own thing because I couldn’t compete with those people on the outing and the money and whatever, so I need an excuse to be… Like, “Oh, he’s a doctor. He’s studying.”"
  },
  {
    "start": 466,
    "end": 467,
    "speaker": "Lex Fridman",
    "timestamp": "(01:16:26)",
    "text": "At least in your own mind, you couldn’t compete."
  },
  {
    "start": 468,
    "end": 469,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:16:28)",
    "text": "Yeah, I always felt as less because, I mean, I didn’t have any girlfriends in school. I had very late in life, everything to me came to life, so I always felt… Even stand-up comedy, it came very late to me in life, so I always feel that I’m not good enough. I feel that I didn’t spend the time to fill the foundation that other comedians do, so I always feel that I am too lucky. I always feel that this is a fleeting thing. And when I had the height and the fall, the fall of… In Egypt, when I would like the top of everything, I was so famous, and then everything was taken away from me. That’s like, “Ah. You see? I told you. That happens when you don’t build foundation, you fall.” So I always feel that I am not good enough, or if I am in a position where people think I am, deep inside I’m not. You know that I have a speech impediment, that I was not meant to be a TV presenter? In Arabic, it’s very obvious. I cannot roll my Rs."
  },
  {
    "start": 470,
    "end": 471,
    "speaker": "",
    "timestamp": "(01:17:32)",
    "text": "I cannot say “rrr.” I cannot roll it. So in Arabic, like Spanish, it’s very obvious. So when I did my first video on the internet, that made me famous. And then I got my television deal back there in Egypt. My partner at the time, he took the video and he went to a producer, and said like, “Are you giving me a guy with a lisp?” That’s why when I came on television, I was the first ever guy with a lisp. I had two things going for me, the lisp and the big nose. And I was always bullied for these two all the time, so I always felt less."
  },
  {
    "start": 472,
    "end": 473,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:03)",
    "text": "See, but that’s a foundation of creating a great person."
  },
  {
    "start": 474,
    "end": 475,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:18:07)",
    "text": "Yeah. Because if you’re pretty, you don’t need to do much."
  },
  {
    "start": 476,
    "end": 477,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:14)",
    "text": "I probably wouldn’t recommend it, but it is true that-"
  },
  {
    "start": 478,
    "end": 479,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:18:18)",
    "text": "So if you are pretty, do some disfigurement that you’re-"
  },
  {
    "start": 480,
    "end": 481,
    "speaker": "Lex Fridman",
    "timestamp": "(01:18:23)",
    "text": "Find the flaws and be extremely self-critical about them. So you saw Jon Stewart on TV for the first time in 2003, I believe. How did that change your life?"
  },
  {
    "start": 482,
    "end": 483,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:18:37)",
    "text": "I was in a gym and I was running on the treadmill. And at that time, CNN was coming up on cable. And I was watching, and there is this studio, I don’t know what it is. So I put the earphones on and I started watching. And I was so taken by this that I stopped the treadmill and I just stood for the 20 minutes like this on the treadmill, just like standing there. I didn’t know what he was saying, I didn’t understand what is Democrats, what is Republicans? Those names that he’s saying… What is Fox News? I don’t understand. But I was fascinated. There was something… You know when you don’t understand the music, but you get the rhythm? It was that."
  },
  {
    "start": 484,
    "end": 485,
    "speaker": "Lex Fridman",
    "timestamp": "(01:19:23)",
    "text": "I wonder what that is that you saw. It’s like the timing of the humor. I mean, Jon Stewart is one of a kind. His biting criticism of power, I would say. And also ability to highlight the absurdity of it all."
  },
  {
    "start": 486,
    "end": 487,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:19:39)",
    "text": "But you understand, I didn’t understand any of that. I didn’t understand any of the references. But it is the rhythm. You know sometimes when you even see a comedy that’s the language you don’t understand, but there’s a rhythm? Da da da, da da da, boom boom. There’s something, there’s something in the music. So there’s something with the videos and the pictures and he and the face and people reacting. What is this? What is this? What is this? And we had the global edition. So I went to the YouTube and I just started to kind of watch every single episode that I can. I said, “Do you think we can have this in Egypt?” I said, “Ah, never.” And then 2011, I had a friend of mine who was also a YouTube partner, it was something new at the time, he said, “Let’s do something on internet. Let’s do something…” I said, “I want to do Jon Stewart.” It’s like, “Nah, do Ray William Johnson, Jon Stewart will not work.” It’s like, “Nah! I want to do Jon Stewart.”"
  },
  {
    "start": 488,
    "end": 489,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:35)",
    "text": "So that was in there."
  },
  {
    "start": 490,
    "end": 491,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:20:36)",
    "text": "Yeah, it was in there. And I did it. And it worked."
  },
  {
    "start": 492,
    "end": 493,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:42)",
    "text": "Can you talk about 2011? I mean, the Arab Spring, what is it? People here in America-"
  },
  {
    "start": 494,
    "end": 495,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:20:49)",
    "text": "It depends on which side-"
  },
  {
    "start": 496,
    "end": 497,
    "speaker": "Lex Fridman",
    "timestamp": "(01:20:52)",
    "text": "Did something happen or what?"
  },
  {
    "start": 498,
    "end": 499,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:20:55)",
    "text": "Depends which side of the equation you are. Because for a lot of people it’s a conspiracy. It’s American made. It is the Muslim Brotherhood, it’s the Islamists, it is Israel, it’s everything else other than people. But it’s a pure revolution. It’s a pure… I think we put too much weight on conspiracies. I think it is normal human behavior that then get maybe used or abused or taken advantage of by other powers, and then the conspiracy starts."
  },
  {
    "start": 500,
    "end": 501,
    "speaker": "",
    "timestamp": "(01:21:26)",
    "text": "But at the time, the Arab Spring didn’t start in Egypt. It started in Tunisia. Bouazizi, a fruit vendor, burned himself up like the American soldiers who did that a few days ago. And that kind of sparked protests in Tunisia. And Ben Ali was a dictator in Tunisia for about 20 years, and they removed him. So suddenly it was kind of like a domino effect. And then Egypt started and it just took 18 days. And people, hindsight is 20/20. Same said just Mubarak became a burden on the military because the military are the real rulers of the country. You might have a president that kind of have certain powers, but at the end of the day, when the military sees that a certain president is too much of a burden, too much of a… So they cut him off."
  },
  {
    "start": 502,
    "end": 503,
    "speaker": "Lex Fridman",
    "timestamp": "(01:22:17)",
    "text": "And Mubarak is the leader of Egypt at the time."
  },
  {
    "start": 504,
    "end": 505,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:22:18)",
    "text": "At that time. He was there for 30 years."
  },
  {
    "start": 506,
    "end": 507,
    "speaker": "Lex Fridman",
    "timestamp": "(01:22:20)",
    "text": "30 years. By the way, speaking of which, because it was a joke in your Mark Twain speech. I got teary-eyed just watching that. That was just great. You’re fucking great, what you did with Mark Twain Awards for Jon Stewart. It’s great. I mean, your comedy is great in general, and I wanted to go to your show. I definitely will. But that’s like a little stroll and a complete tangent of just a masterful introduction and celebration of Jon Stewart. Anyway, Mubarak. 30 years."
  },
  {
    "start": 508,
    "end": 509,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:22:48)",
    "text": "And it’s a joke that I say also, Mubarak was a president for 30 years. Like, “Oh my God, you had a president for 30 years?” It’s the Middle East. It’s a very short first term. It’s like we’re still warming up, baby."
  },
  {
    "start": 510,
    "end": 511,
    "speaker": "Lex Fridman",
    "timestamp": "(01:22:58)",
    "text": "Just warming up."
  },
  {
    "start": 512,
    "end": 513,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:22:58)",
    "text": "And I told them, we need to plan ahead. We need to plan our vacations, our careers, our jail time. It’s just like we need to-"
  },
  {
    "start": 514,
    "end": 515,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:05)",
    "text": "That’s great. It’s true."
  },
  {
    "start": 516,
    "end": 517,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:23:10)",
    "text": "So we had kind of the shortest, nicest revolution, 18 days. And we thought, “Oh, 18 days, we can change the country in 18 days.” But of course we were naive and we had this kind of hope. So Mubarak was removed. There was an interim period by the military, took it for one year, then they did elections. Muslim Brotherhood came to power. They stayed for one year, and then the military removed them. And in these three years, my show started, it started by kind of a YouTube video."
  },
  {
    "start": 518,
    "end": 519,
    "speaker": "Lex Fridman",
    "timestamp": "(01:23:41)",
    "text": "It became famous overnight."
  },
  {
    "start": 520,
    "end": 521,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:23:43)",
    "text": "Overnight, five to six videos, boom, went out. And at that time I was waiting to get my clearance to go to Cleveland. I was accepted in a fellowship as a pediatric heart surgery in a hospital in Cleveland. And I said, ” All right, I’m just going to do a couple of videos. Maybe I’m going to put it in internet, and maybe after a year or two, after I come back from the fellowship, somebody will come, ‘Hey, why don’t you write a show that looks like John Stewart?'” That was my mind. It took five weeks. I had my first contract of television, and overnight, the exposure. And over the next two, three years, I had 30 to 40 million people watch. 30 to 40 million people watching every episode. A lot of this like, “Wow, that’s too much.” That is terrifying because it means that there are 30 million people who have an opinion about you."
  },
  {
    "start": 522,
    "end": 523,
    "speaker": "Lex Fridman",
    "timestamp": "(01:24:32)",
    "text": "You said there’s a lot of aspects of that sudden fame that were just horrible."
  },
  {
    "start": 524,
    "end": 525,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:24:38)",
    "text": "It’s toxic. It’s unnatural. When people started to recognize me in the street and take pictures, I was awkward. It’s like, “Why do you want to have a picture of me? Why? Is it…” Because I didn’t feel that I’m worthy enough to be a reward for someone to have a picture. And I didn’t understand it. I was kind of an ass sometimes because… People thought it was arrogance. No, it was confusion. And I remember my director and my producers and people, they always saw me in a very bad mood. It’s like, “Why are you not enjoying this?” It’s like, “Because this is not natural. This is not natural, this adoration, this love, and this have to end somehow.” And it did. Because at a certain point you are a human, and people, kind of the adoration and the fun and the love comes because they see you saying stuff… because you do your job, basically."
  },
  {
    "start": 526,
    "end": 527,
    "speaker": "",
    "timestamp": "(01:25:31)",
    "text": "Political satire is basically us making fun of politicians in the media. And a lot of people have really strong opinions about politicians in the media. So we came that, we articulate that, and we give it to them and we make them laugh. So for them, we made a great job. So why don’t you do more? But you are limited. And at a certain time, you can’t. And at a certain time you’re afraid because we’re humans, because you’re afraid about if I continue speaking up… not something will happen to me. I’m kind of like maybe have some protection because people see me, but what the people around you? And I’ve seen that. So that’s why at a certain point, that’s it."
  },
  {
    "start": 528,
    "end": 529,
    "speaker": "Lex Fridman",
    "timestamp": "(01:26:13)",
    "text": "I mean, there’s a lot of things to say there, but one of the difficult things of fame in your situation is you’re not just having fun. You’re criticizing power."
  },
  {
    "start": 530,
    "end": 531,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:26:22)",
    "text": "Yeah. And it is loved by the people, but it comes with a price. Because at a certain… If the power is too strong and you are not into a situation or a system that allows that, that gives you that kind of safety-"
  },
  {
    "start": 532,
    "end": 533,
    "speaker": "Lex Fridman",
    "timestamp": "(01:26:37)",
    "text": "So what happened?"
  },
  {
    "start": 534,
    "end": 535,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:26:39)",
    "text": "What happened? So the height of my fame was when the Muslim Brotherhood was in power. And at that time they had their media, and I had one show. I had one hour per week, and they had five channels, 24/7. And they were like… Jon Stewart said it beautifully once. It’s like, “We say shit and you say shit, and we just say shit better than you.” This is exactly what Jon Stewart was like. “We’re just better at saying shit back at you.” So basically I had one hour and they had the five thing that they were like… They’re calling me all kinds of names, not just me, all their enemies. And then I just had one hour and I would kind of annihilate them in one hour a week. So at a certain point they would even kind of side with the army against the liberal seculars, whatever you call it. And at a certain point, the army kind of flipped everybody."
  },
  {
    "start": 536,
    "end": 537,
    "speaker": "Lex Fridman",
    "timestamp": "(01:27:38)",
    "text": "What do you mean flipped?"
  },
  {
    "start": 538,
    "end": 539,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:27:42)",
    "text": "Yeah, they removed the Muslim Brotherhood. They came to power. And I have to say, I admit it, I supported that in the beginning because I had daily threats. I was actually interrogated and arrested under the Muslim Brotherhood. I was in an interrogation for six hours, and they were asking me all my jokes. And I used that in my standup comedy describing exactly what happened in the six hours. And it is so funny."
  },
  {
    "start": 540,
    "end": 541,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:04)",
    "text": "Okay, well, it’s hilarious. But what… Slow down. You were interrogated by the Muslim Brotherhood?"
  },
  {
    "start": 542,
    "end": 543,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:28:13)",
    "text": "The general prosecutor. The general prosecutor. And it was basically because of complaints by the officials in the government. Because in order the general prosecutor to do it, it has to have a high up mandate to bring that person to questioning."
  },
  {
    "start": 544,
    "end": 545,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:25)",
    "text": "So they went through kind of official channels."
  },
  {
    "start": 546,
    "end": 547,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:28:27)",
    "text": "Oh yeah, yeah, absolutely."
  },
  {
    "start": 548,
    "end": 549,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:28)",
    "text": "So it’s all-"
  },
  {
    "start": 550,
    "end": 551,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:28:29)",
    "text": "Yeah, it was official. It was legal."
  },
  {
    "start": 552,
    "end": 553,
    "speaker": "Lex Fridman",
    "timestamp": "(01:28:30)",
    "text": "Yeah. Very legal."
  },
  {
    "start": 554,
    "end": 555,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:28:32)",
    "text": "So I went there, and I asked… And it’s kind of like a bunch of insulting Islam, insulting president, spreading false rumors. And I went there, and it was funny because I go into the building where there’s police officers and there’s judges, and all of them are big fans of the show. And some of them were taking pictures of me. And then I’m sitting there, and it was the most ridiculous interview ever because he was asking me about my jokes. It’s like, “What did you mean by this joke?” And it’s like, “Nothing.” And it was there for six hours."
  },
  {
    "start": 556,
    "end": 557,
    "speaker": "Lex Fridman",
    "timestamp": "(01:29:03)",
    "text": "He’s just reading your jokes back to you."
  },
  {
    "start": 558,
    "end": 559,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:29:05)",
    "text": "He was reading my joke, and he’s reading the jokes and the junior judge is sitting there cracking up. It’s like, “I remember that.” It’s like, “Guys, guys.”"
  },
  {
    "start": 560,
    "end": 561,
    "speaker": "Lex Fridman",
    "timestamp": "(01:29:15)",
    "text": "That’s dark."
  },
  {
    "start": 562,
    "end": 563,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:29:17)",
    "text": "It’s kind of like… And I’m laughing, but in the same time it’s like the whole situation is ridiculous. But then at the end, I was released on bail. So I went back to my show, and I make fun of that. And you have to be honest, the Muslim Brotherhood were in power, but Egypt was right out of the revolution, for there was kind of an equal spread of power between the people. There was not someone who would come in and just… The Muslim Brotherhood didn’t have that power yet, but people saw that they were moving towards that. And then the tension rose, and then there was a kind of a confrontation between them and the army. And then a lot of people were killed in the street. It was terrible massacre. And then suddenly, I am blamed for all of that. It’s like, “You made fun of us, so now it made it easier for people to kill us.” Like, “Dude, come on. You’re doing that to me too. I just did it better than you. And the fact that you sided with the same people that flipped against you, that’s not my fault.”"
  },
  {
    "start": 564,
    "end": 565,
    "speaker": "Lex Fridman",
    "timestamp": "(01:30:11)",
    "text": "Did you criticize the army at all?"
  },
  {
    "start": 566,
    "end": 567,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:30:13)",
    "text": "Yeah. So after that show, I did one episode against the army and I was canceled the next day. And then I went to another channel, did 16 episodes in a different season, and I was walking on eggshells. And then that was canceled again. And then the production company that was doing my show, that we severed ties, because we didn’t have the show, they had their offices raided, they have people having death threats. So I woke up one day, 11th of November 2014, and my lawyer said, “Leave the country right now. There is this legal case that they… They’re coming for you.” But they said, “You cannot…” It was an arbitration case, and I lost against the channel that basically canceled me. And I told them, “But there’s no jail time in arbitration.” It’s like, “Yeah, tell that to the judge. Just leave.” So I jumped on a plane. The verdict was 12:00 noon, 11 November. 5:00 afternoon I was on a plane, left Egypt, and I never came back since then."
  },
  {
    "start": 568,
    "end": 569,
    "speaker": "Lex Fridman",
    "timestamp": "(01:31:11)",
    "text": "Was there a worry of non-legal things like assassination?"
  },
  {
    "start": 570,
    "end": 571,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:31:19)",
    "text": "I can tell you something, I was so stressed because of the show and because of everything, sometimes I would wake up in the morning and I hope that a bullet will come and finish everything because I was so stressed. It’s like, “I would love…” Because I’m too much of a chicken to kill myself, so I would rather have someone else do it for me. So I was under so much pressure. And I remember the day that my show was canceled indefinitely, the second time, under the army. And I was like, “Ah. I don’t have to worry about what kind of script I have to write next week.” Because remember when you asked me about that tweet? About all those… Those accusation doesn’t bother me. Infidel, spy, secret Jew, Zionist, Islamonazi. That’s bullshit. What really leaves a mark is the criticism to your craft and your work. So, “You’re not funny,” goes deeper."
  },
  {
    "start": 572,
    "end": 573,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:19)",
    "text": "Yeah, certain things get to you better than others, especially if you have a secret suspicion that you are maybe not funny."
  },
  {
    "start": 574,
    "end": 575,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:32:29)",
    "text": "Maybe I’m not, because I was put into that, it’s like, because that touched your insecurities. Like, “I know, but you shouldn’t say it out loud.”"
  },
  {
    "start": 576,
    "end": 577,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:37)",
    "text": "You shouldn’t say the truth out loud."
  },
  {
    "start": 578,
    "end": 579,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:32:38)",
    "text": "You shouldn’t say it out loud [inaudible 01:32:42]"
  },
  {
    "start": 580,
    "end": 581,
    "speaker": "Lex Fridman",
    "timestamp": "(01:32:42)",
    "text": "But what about the weight of the responsibility of speaking truth to power, walking on eggshells, what did that feel like?"
  },
  {
    "start": 582,
    "end": 583,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:32:51)",
    "text": "Well, after the Muslim Brotherhood were removed… You have to understand, when the military coup happened, it was a very popular coup. People loved the army. In Egypt, the army is more sacred than the religion. People love the army. Popular army can go no wrong. So me going against the army was… I mean, the Muslim Brotherhood was not very popular. They were popular for their own basis, but people accepted the fact that we make fun of them. But Sisi, at that time, he was a God. And I used to go to this high class club called Gezira Club, and this is basically kind of the upper middle class, upper class kind of people. And during that year of the Muslim Brotherhood, I was the most popular ever. People come, “Yay!” When the military came in, people were walking to me, pointing their fingers like, “Don’t speak about Sisi, don’t speak about the army. We love you now, but don’t you…”"
  },
  {
    "start": 584,
    "end": 585,
    "speaker": "",
    "timestamp": "(01:33:47)",
    "text": "They were like that. So I called Jon Stewart, I was like, “I don’t know what to do. I don’t know what to do.” And at that time, all of the channels were closed down, all of… I was the only one left because it was difficult for them to get rid of me very quickly because I was too popular. It was kind of like piecemealing kind of like… And I remember I told him, “I don’t know what to do.” He said, “You don’t have to do anything, just, your safety comes first.” And said, “But I can’t. I mean, I’ve been doing that for two years and I cannot just say, ‘Bye-bye guys.’ I have a responsibility. I have a team, I have people working for me. And also, I cannot just disappear.” And he said the most interesting thing ever. And say, “If you’re afraid of something, make fun about the fact that you’re afraid of it, instead of talking about that something.”"
  },
  {
    "start": 586,
    "end": 587,
    "speaker": "Lex Fridman",
    "timestamp": "(01:34:42)",
    "text": "Brilliant."
  },
  {
    "start": 588,
    "end": 589,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:34:44)",
    "text": "So there was a whole episode that we did not even mention Sisi. We did not even mention it, but the videos did all the thing. And the whole episode was me trying to avoid talking about him. And that’s how the comedy was created, the fact that I don’t want to be here. And so he said, “You’ll be surprised how people can relate to that,” because there was a lot of kind of like, “Oh, we love him, but we feel we cannot speak.” So just by doing the simple thing about mirroring the society, that goes a long way."
  },
  {
    "start": 590,
    "end": 591,
    "speaker": "",
    "timestamp": "(01:35:19)",
    "text": "And I kind of try to do what I can under the military. I mean, they came up with a machine that treats AIDS and Hepatitis C virus and basically every single… And I went to town with that because people… It doesn’t really have to go in to go to the bigger post like, “You’re an asshole.” No, you talk about their propaganda. You talk about what they want people to perceive them at, and it’s a failure. And for that, that kind of hit them even more. Because what do authoritarian figures do? They work on two things, fear and propaganda. And from that, it gets the respect. So when you go into their propaganda and expose them, they have nothing else."
  },
  {
    "start": 592,
    "end": 593,
    "speaker": "Lex Fridman",
    "timestamp": "(01:36:11)",
    "text": "That’s brilliant. So you are walking on eggshells, but you’re doing it masterfully, that you’re revealing sort of the flaws in the propaganda, the absurdity of the propaganda and in so doing are criticizing them."
  },
  {
    "start": 594,
    "end": 595,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:36:21)",
    "text": "And this is why comedy is very specific, because people say, “You were not as hard on him as you were on the Muslim…” I was like, “Yeah, because on the Muslim Brotherhood we were just saying shit for each other,” but now the ceiling was like here. So it’s kind of like, how can you do something from here?"
  },
  {
    "start": 596,
    "end": 597,
    "speaker": "Lex Fridman",
    "timestamp": "(01:36:37)",
    "text": "Yeah, exactly. That’s the art form. Yeah. In the Soviet Union under Stalin, a lot of the criticism came from children stories and children’s cartoons."
  },
  {
    "start": 598,
    "end": 599,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:36:51)",
    "text": "Double meaning, double innuendos, stuff that means other stuff. That is-"
  },
  {
    "start": 600,
    "end": 601,
    "speaker": "Lex Fridman",
    "timestamp": "(01:36:51)",
    "text": "Real creative."
  },
  {
    "start": 602,
    "end": 603,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:36:55)",
    "text": "That’s the brilliance."
  },
  {
    "start": 604,
    "end": 605,
    "speaker": "Lex Fridman",
    "timestamp": "(01:36:57)",
    "text": "But everyone knows."
  },
  {
    "start": 606,
    "end": 607,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:36:59)",
    "text": "Everyone knows."
  },
  {
    "start": 608,
    "end": 609,
    "speaker": "Lex Fridman",
    "timestamp": "(01:37:00)",
    "text": "Because you are putting a mirror, you’re mirroring the society. It’s fascinating, actually."
  },
  {
    "start": 610,
    "end": 611,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:37:04)",
    "text": "And that’s why I was canceled twice."
  },
  {
    "start": 612,
    "end": 613,
    "speaker": "Lex Fridman",
    "timestamp": "(01:37:07)",
    "text": "And that is a scary one, the army. You see that in Ukraine, everybody supports the army. That’s why Zelensky getting rid of the head of the army was a big, big deal. It’s a really dangerous thing. And everyone was afraid to say anything negative about the army, especially during war, in that case. And in this case, maybe there’s civil war, that kind of thing."
  },
  {
    "start": 614,
    "end": 615,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:37:30)",
    "text": "But think about it. Actually, an army during peace is much more dangerous. Because think about it. I don’t really have an enemy to fight, but I have all of this power, all of this tank. Why does this actor have more money than me? I’m protecting him. Why does this businessman think that he can get onto his private plane and go to Paris? And why I’m here sitting, not having all of these things? And there’s a lot of time on your hand because your job is to go fight. When you don’t go fight, and when you have the lack of… That’s one of the things I love the United States about, is the fact that the army cannot really get power, but the power is actually in the military-industrial complex, which is a different issue. It’s kind a different kind of issue. But if you have all of that power, why am I sitting around just playing guard for you guys?"
  },
  {
    "start": 616,
    "end": 617,
    "speaker": "Lex Fridman",
    "timestamp": "(01:38:22)",
    "text": "That’s why Iran is terrifying because you have this military that just becomes a police force that turns against its own people. So you’re a famous guy talking shit in the middle of all that."
  },
  {
    "start": 618,
    "end": 619,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:38:36)",
    "text": "Yeah. And when I left, I went through a very dark side, dark, dark, dark. Because all of the insecurities, all of the stuff that had been working on my head now came to life. And now I’m in America and I’m a nobody. I’m a nobody. And now it’s like I have to do something. I have to earn some money. So I started to do stand-up comedy five years ago, and I sucked because it was my second language and it was new. And now I would go to these comedy clubs-"
  },
  {
    "start": 620,
    "end": 621,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:39:00)",
    "text": "It was my second language and it was new. And now I would go to these comedy clubs with kids and 21, 22 people. And then I’m there with a family to support that. I’m going there to do it for $15, $20. And I was bad. I was bad."
  },
  {
    "start": 622,
    "end": 623,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:14)",
    "text": "You’re bombing."
  },
  {
    "start": 624,
    "end": 625,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:39:14)",
    "text": "Bombing big time."
  },
  {
    "start": 626,
    "end": 627,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:15)",
    "text": "Eating shit."
  },
  {
    "start": 628,
    "end": 629,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:39:15)",
    "text": "Eating shit big time, dying up there big time. And I would go back home and I would cry. And then what made it worse is sometimes like a fan, not a fan, a bunch of fans from Egypt. It’s like, “Bassem Youssef…” They come and it’s like…."
  },
  {
    "start": 630,
    "end": 631,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:16)",
    "text": "Yeah, just-"
  },
  {
    "start": 632,
    "end": 633,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:39:35)",
    "text": "Their disappointment. That kind of face of adoration that goes into… And I could see it in their face. “I think he’s going to drive an Uber in a couple of weeks.”"
  },
  {
    "start": 634,
    "end": 635,
    "speaker": "Lex Fridman",
    "timestamp": "(01:39:50)",
    "text": "Oh, that’s so incredible."
  },
  {
    "start": 636,
    "end": 637,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:39:51)",
    "text": "That kind of pressure. And I would go and I would cry and I… And then the fans were like, “Oh, you left. You gave up. You were a sellout. You’re a coward. Why don’t you speak from abroad? You’re safe now.” It’s like, I already spoke. I don’t want to be an activist. I was doing that for comedy when it was good for everybody, but now they want me to go into YouTube and just like throw rocks from outside. I was like, “You don’t understand. I have family there.”"
  },
  {
    "start": 638,
    "end": 639,
    "speaker": "",
    "timestamp": "(01:40:20)",
    "text": "And it was this kind of thing, like I’m being attacked for not doing what I should do in their face and attacked for not being funny and not doing good… And now I feel like, maybe it was wrong and… It was so traumatic that I don’t know actually how I went through these years. And I blocked so many details from my brain, because I have been using this technique for a while now that I have been erasing a lot of my… There is a lot of memory gaps in my brain, and I’m trying to suppress it because it was very, very, very traumatic. And a lot of people told me, “You have to go to therapy.” But I’m worried to open the floodgates. And I’m thinking, if I’m functional and I’m not killing anybody, I’m okay."
  },
  {
    "start": 640,
    "end": 641,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:16)",
    "text": "I think Elon tweeted, “‘Never went to therapy,’ is going to be on my headstone.”"
  },
  {
    "start": 642,
    "end": 643,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:41:21)",
    "text": "Yeah…"
  },
  {
    "start": 644,
    "end": 645,
    "speaker": "Lex Fridman",
    "timestamp": "(01:41:25)",
    "text": "You’re best buds. Okay. I mean that is terrifyingly difficult to… After being a surgeon, after being a superstar, super famous, going to eat shit at local tiny clubs in the United States. I mean eating shit period. Like bombing is really, really, really difficult. Really difficult, for twenty-year-olds."
  },
  {
    "start": 646,
    "end": 647,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:41:52)",
    "text": "Imagine when you’re 45, 46. And then people’s like, “Is this his midlife crisis? What is this?” I went through a lot of pain and a lot of the doubts and it was terrible."
  },
  {
    "start": 648,
    "end": 649,
    "speaker": "Lex Fridman",
    "timestamp": "(01:42:08)",
    "text": "How did you survive? I know you [inaudible 01:42:11] most of it, but what gave you strength through all that?"
  },
  {
    "start": 650,
    "end": 651,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:42:14)",
    "text": "Because I didn’t have any other choice, because I started that and the only reason that I could… is continue. I don’t know what else to do. I don’t want to go back to medicine. I don’t want to do that. And I don’t know. And bit by bit, bit by bit, I started to kind of be better, be better, be better. And I was at a certain time, a year ago, a year ago, this is where I started to kind of hone the craft and kind of sell more tickets and sometimes even sell out some shows and sometimes sell a theater. So it was going and the money was flowing and it was good. And then I was like, I wanted faster, I wanted more. I want it now. I want Netflix deal and whatever. And then the Piers Morgan thing happened and then I blew up and then suddenly I’m selling out everywhere."
  },
  {
    "start": 652,
    "end": 653,
    "speaker": "",
    "timestamp": "(01:43:03)",
    "text": "And it’s like, “Ah, if the war happened two years ago, I will not be ready.” So now they come to the show, and by the way, my show had nothing to do with October 7th. My show is my thing that I’ve been crafting and working on. You know how difficult it’s to do the first hour, the hour that I’ve been working on for five years? And it’s all my personal story, all about what happened to me in Egypt, me as an immigrant, coming here to the United States, finding Trump as a president, finding myself in the middle of a guns rally, finding myself in the middle of a bombing, kind of talking about how I got my citizenship. It’s funny stories about my origin story."
  },
  {
    "start": 654,
    "end": 655,
    "speaker": "",
    "timestamp": "(01:43:41)",
    "text": "So they come in and they expect October 7th and all of a sudden my personal story, but it’s good and it kills and they love it. It’s like if that kind of blew up in America happened to me two, three years ago, I would not have… People would come and be disappointed."
  },
  {
    "start": 656,
    "end": 657,
    "speaker": "Lex Fridman",
    "timestamp": "(01:43:54)",
    "text": "I got to say the timing of October 7th is very suspicious."
  },
  {
    "start": 658,
    "end": 659,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:43:57)",
    "text": "Oh my God. Please don’t say that."
  },
  {
    "start": 660,
    "end": 661,
    "speaker": "Lex Fridman",
    "timestamp": "(01:43:58)",
    "text": "I don’t know. I’m just asking questions. I don’t know."
  },
  {
    "start": 662,
    "end": 663,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:44:01)",
    "text": "I’m telling you, one of the funniest thing, a guy… I was in Dubai and a TV anchor came to me. “Bassem Youssef, he flourishes during revolutions and wars.” Like, whoa, whoa. Wait, what? Dude. You’re making me sound like a bad omen. A very bad omen."
  },
  {
    "start": 664,
    "end": 665,
    "speaker": "Lex Fridman",
    "timestamp": "(01:44:19)",
    "text": "Yeah. You, Hamas and Bibi together orchestrated all of this."
  },
  {
    "start": 666,
    "end": 667,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:44:23)",
    "text": "Oh my god. That’s the trilogy."
  },
  {
    "start": 668,
    "end": 669,
    "speaker": "Lex Fridman",
    "timestamp": "(01:44:27)",
    "text": "You guys should go on the road together. I’m telling you that phone call is coming,"
  },
  {
    "start": 670,
    "end": 671,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:44:31)",
    "text": "Yeah, but Hamas has to open."
  },
  {
    "start": 672,
    "end": 673,
    "speaker": "Lex Fridman",
    "timestamp": "(01:44:34)",
    "text": "And that would really bomb, right? That"
  },
  {
    "start": 674,
    "end": 675,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:44:34)",
    "text": "They would really bomb."
  },
  {
    "start": 676,
    "end": 677,
    "speaker": "Lex Fridman",
    "timestamp": "(01:44:41)",
    "text": "I love dark humor. You do a show, like you were saying, in English and in Arabic, and the story is very different."
  },
  {
    "start": 678,
    "end": 679,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:44:50)",
    "text": "Totally different. Two different stories."
  },
  {
    "start": 680,
    "end": 681,
    "speaker": "Lex Fridman",
    "timestamp": "(01:44:52)",
    "text": "I would love to… just the language difference, because the music of the language is also different. So how can you convert it into words, but what’s the difference in the music of the languages?"
  },
  {
    "start": 682,
    "end": 683,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:45:03)",
    "text": "I’ll tell you, because I thought about that thought."
  },
  {
    "start": 684,
    "end": 685,
    "speaker": "Lex Fridman",
    "timestamp": "(01:45:08)",
    "text": "[inaudible 01:45:08]. All right, all right."
  },
  {
    "start": 686,
    "end": 687,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:45:10)",
    "text": "Okay, so when I was doing the English first, I actually had good jokes, but I was missing the delivery because the cadence and the music and the rhythm is different. The way that an English-speaking American member of audience will receive it’ll be different than how I receive it. The energy, everything’s different. So when I kind of got it, I didn’t know how to switch back to Arabic."
  },
  {
    "start": 688,
    "end": 689,
    "speaker": "Lex Fridman",
    "timestamp": "(01:45:40)",
    "text": "Oh wow. Yeah. Fascinating."
  },
  {
    "start": 690,
    "end": 691,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:45:43)",
    "text": "Because here’s the thing. With English stand-up comedy you have a huge library, you have a legacy. You have years and years and years and years of people doing comedy. But in Arabic it’s very new to us. And most of the Arabic stand-up comedy, especially in Egypt, is very tamed. This is kind of like, imagine the stand-up comedy scene in American 1960s before Lenny Bruce."
  },
  {
    "start": 692,
    "end": 693,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:05)",
    "text": "So no swearing, conservative, careful."
  },
  {
    "start": 694,
    "end": 695,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:46:07)",
    "text": "No swearing, nothing, conservative, everything."
  },
  {
    "start": 696,
    "end": 697,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:08)",
    "text": "No [inaudible 01:46:09]."
  },
  {
    "start": 698,
    "end": 699,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:46:09)",
    "text": "It’s kind of very… So I didn’t know what to do with Arabic, so I broke the barriers. I became Lenny Bruce, I became George Carlin. So I went in and I went and I changed the whole thing."
  },
  {
    "start": 700,
    "end": 701,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:21)",
    "text": "The seven words you’re not allowed to say."
  },
  {
    "start": 702,
    "end": 703,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:46:23)",
    "text": "Ah, for me, 15 words."
  },
  {
    "start": 704,
    "end": 705,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:26)",
    "text": "There’s a lot."
  },
  {
    "start": 706,
    "end": 707,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:46:28)",
    "text": "Arabic is a very rich language. So here’s the difference between the Arabic and the English show. The English show, surprise, surprise is a unifying language, even for a group of Arabs."
  },
  {
    "start": 708,
    "end": 709,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:28)",
    "text": "Interesting."
  },
  {
    "start": 710,
    "end": 711,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:46:43)",
    "text": "So if I give the same exact show to the same 1000 audience members in the same theater, and they’re the same people, same makeup of like Lebanese, Egyptian, Syrian, Saudis, English will be a unifying language. Arabic is a dividing language."
  },
  {
    "start": 712,
    "end": 713,
    "speaker": "Lex Fridman",
    "timestamp": "(01:46:43)",
    "text": "Why is that?"
  },
  {
    "start": 714,
    "end": 715,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:47:01)",
    "text": "Because you have 22 dialects, and the dialects are vastly different. And maybe Egyptians understand a little bit of Lebanese, but not that much. But the references, Algerian, Moroccan, Tunisian, totally different animal. That’s like a totally different language. Saudi, Emirati, Kuwaiti, totally different. People understand the Egyptian dialect because it’s the dialect of most of the artwork and the movies. But the reference in the everyday street talk might not be understood by them. So now I have to go in and talk to all of these dialects together."
  },
  {
    "start": 716,
    "end": 717,
    "speaker": "",
    "timestamp": "(01:47:32)",
    "text": "So a big part of my show is like, “What are you guys expecting of this?” When I do profanity and you’re going to like it. This is the problem with the show as a dialect, and I construct all of these sentences formed of so different words. For example, an iron in any Arabic dialect is an iron. In Saudi Arabia, it means ass. That’s one example. That’s one example. So imagine if you can actually construct sentences having all of these things in one… So I would construct a whole section of my show about that."
  },
  {
    "start": 718,
    "end": 719,
    "speaker": "Lex Fridman",
    "timestamp": "(01:48:13)",
    "text": "So it’s really very much about, like self-reflective on language and the limits of language that’s allowed."
  },
  {
    "start": 720,
    "end": 721,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:48:19)",
    "text": "And the limits of language. And I tell them part of the show is I know what’s the problem with me doing Arabic. It’s like if this was an English show and I was telling you fuck and shit and bitch, you’ll be, “Ha, ha, ha, ha…” But if I do one swear word, all of you will cringe. It’s like, why?"
  },
  {
    "start": 722,
    "end": 723,
    "speaker": "Lex Fridman",
    "timestamp": "(01:48:31)",
    "text": "That’s fascinating."
  },
  {
    "start": 724,
    "end": 725,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:48:32)",
    "text": "Is it because we are ashamed of our own… So it’s not just about swearing, it’s about… There’s a lot of philosophical pathways in this. Yeah, there’s profanity and people have fun, whatever. But it is about how do we treat our language? And I tell them, “We speak Arabic as Arabs, but it’s not the same Arabic.” It’s crazy, right?"
  },
  {
    "start": 726,
    "end": 727,
    "speaker": "Lex Fridman",
    "timestamp": "(01:48:54)",
    "text": "And you’re doing the show in America also, which is another level of [inaudible 01:48:58]."
  },
  {
    "start": 728,
    "end": 729,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:48:57)",
    "text": "Oh yeah. Actually the Arab diaspora in America is some of the best audiences I have. They are wonderful. And I did it also in the Middle East, and maybe I’ll do like an Arab tour in the Middle East in the fall."
  },
  {
    "start": 730,
    "end": 731,
    "speaker": "Lex Fridman",
    "timestamp": "(01:49:12)",
    "text": "Which countries would you go to or not?"
  },
  {
    "start": 732,
    "end": 733,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:49:14)",
    "text": "I already did Jordan, Lebanon. I’m doing UAE, I’m doing Kuwait."
  },
  {
    "start": 734,
    "end": 735,
    "speaker": "Lex Fridman",
    "timestamp": "(01:49:20)",
    "text": "Egypt?"
  },
  {
    "start": 736,
    "end": 737,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:49:20)",
    "text": "Bahrain. Egypt, I don’t think so. I don’t think so."
  },
  {
    "start": 738,
    "end": 739,
    "speaker": "Lex Fridman",
    "timestamp": "(01:49:23)",
    "text": "Is it personal? Is it worry about your safety?"
  },
  {
    "start": 740,
    "end": 741,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:49:29)",
    "text": "Well, I have the American citizenship right now, so I am relatively safe. There’s a block, honestly. There’s a block. There’s so much that happened. And I’ll never bad mouth Egypt. It is my country. It has all of my marriage. 40 years of my life I lived there. But when you get hurt so much, instead of trying to kind of… I don’t want to take revenge, I don’t want to like battle. I just want to avoid because Egypt gave me so much fame and so much love and so much hate and so much rejection. It was a very tumultuous relationship. Very, very difficult."
  },
  {
    "start": 742,
    "end": 743,
    "speaker": "",
    "timestamp": "(01:50:12)",
    "text": "And a lot of people tell me, “Well, don’t you miss Egypt?” And I tell them every time, “The Egypt that I miss is not there anymore. It’s not bad or good. It’s not worse or better. It’s just I’m different.” And the places are different and the people are different and their circumstances are different. Whatever image you had you have of what you love is not there anymore. That’s why a lot of immigrants, especially Arab immigrants, they live here, but they’re there. And then when they go back for a vacation, they get disappointed because they didn’t find what they want. And then they come back here and they’re disappointed because they want to come back, but it’s not there anymore."
  },
  {
    "start": 744,
    "end": 745,
    "speaker": "Lex Fridman",
    "timestamp": "(01:50:46)",
    "text": "Yeah. Their view of that place is from a different time. I have that… My parents, but everybody that left the Soviet Union, I mean it’s such a complicated relationship with that. It’s sometimes borders on hate, disappointment. In the case of the Soviet Union, perhaps similar to Egypt is the promise is sold when you were younger and the promise is broken by the possibility of what it was supposed to be. With the Soviet Union, I’m sure with Egypt it’s the same. Iran is the same. So they have a very complicated relationship with that."
  },
  {
    "start": 746,
    "end": 747,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:51:26)",
    "text": "Yeah. That’s why, for example, people from Iran, I remember quite well the World Cup that was done in the United States, and the Iranian team will play in America. And there were people in the audience all wearing Iranian shirts. They hate the regime, but they have this kind of connection with the country. And this is the whole thing. You can actually love the country and you not have to agree with the regime."
  },
  {
    "start": 748,
    "end": 749,
    "speaker": "Lex Fridman",
    "timestamp": "(01:51:54)",
    "text": "Would you ever perform in the West Bank?"
  },
  {
    "start": 750,
    "end": 751,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:51:56)",
    "text": "No."
  },
  {
    "start": 752,
    "end": 753,
    "speaker": "Lex Fridman",
    "timestamp": "(01:51:56)",
    "text": "Gaza?"
  },
  {
    "start": 754,
    "end": 755,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:51:57)",
    "text": "Because if I go there, I have to go through the Israeli checkpoints and I don’t want to go through the… I don’t want to have an Israeli soldier telling me what to do."
  },
  {
    "start": 756,
    "end": 757,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:04)",
    "text": "Yeah, there’s a demeaning aspect to that whole-"
  },
  {
    "start": 758,
    "end": 759,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:52:06)",
    "text": "Very."
  },
  {
    "start": 760,
    "end": 761,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:07)",
    "text": "Even in subtle ways, yeah."
  },
  {
    "start": 762,
    "end": 763,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:52:09)",
    "text": "Yeah, yeah. I mean I have so many Palestinian friends with an American passport, US passports, living here, they’re born here. And they talk about the humiliation and the intimidation and the harassment that they go in. It’s like, do you want me to try?"
  },
  {
    "start": 764,
    "end": 765,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:24)",
    "text": "Yeah, that little bit of a humiliation…"
  },
  {
    "start": 766,
    "end": 767,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:52:29)",
    "text": "A little bit."
  },
  {
    "start": 768,
    "end": 769,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:32)",
    "text": "Oh, sometimes it’s major, but-"
  },
  {
    "start": 770,
    "end": 771,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:52:32)",
    "text": "I know, I know."
  },
  {
    "start": 772,
    "end": 773,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:34)",
    "text": "… I noticed that even the little bit, after a lifetime of that, it can turn to hate towards the other."
  },
  {
    "start": 774,
    "end": 775,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:52:44)",
    "text": "Yeah, and resentment."
  },
  {
    "start": 776,
    "end": 777,
    "speaker": "Lex Fridman",
    "timestamp": "(01:52:45)",
    "text": "Resentment. And then how do you do anything with that resentment?"
  },
  {
    "start": 778,
    "end": 779,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:52:48)",
    "text": "I have a friend of mine, he is from Palestine from the West Bank. He’s American. He was born here. And we have of course all of this discussion of what happened. And he tells me on October 11th in the West Bank, and there was a village called Qusra. And on that village, the settlers went in around the village and they send a message on Facebook. It was like, “You rats, get out of your sewers and we’re going to be waiting for you.” Intimidation through technology. Qusra have another settlement next to it called Esh Kodesh. Esh Kodesh, they have people there who were training something called [inaudible 01:53:32], which is basically the guardians of [inaudible 01:53:36]. And it’s like a paramilitary group that trains other settlers on military compact, give them weapons and do military drills."
  },
  {
    "start": 780,
    "end": 781,
    "speaker": "",
    "timestamp": "(01:53:45)",
    "text": "And they went there militarized and went there, and it was actually co-founded a Jew from Brooklyn. Not even… and like an Israeli. And he’s like one of the disciples of Meir Kahane. I’m sure that you know who Meir Kahane is, who was the Jewish defense leader, the people who assassinated Alex Odeh here in the United States, and they were there with their weapons outside intimidating people. Now this story carries everything that is wrong with the situation. You have people from Brooklyn, from outside, just because they’re Jewish, they can’t come and they can claim the land from the people there. Anybody from… just because he’s Jewish, you can come and take the land from other people."
  },
  {
    "start": 782,
    "end": 783,
    "speaker": "",
    "timestamp": "(01:54:25)",
    "text": "They’re using technology to intimidate Palestinians. They have unchecked military power. These are not IDF soldiers, these are settlers and they have free reign in order to intimidate and to kill the people. And you understand, this is the daily life of Palestinians, not in Gaza. In the West Bank."
  },
  {
    "start": 784,
    "end": 785,
    "speaker": "Lex Fridman",
    "timestamp": "(01:54:45)",
    "text": "What do we do, what do people do to nudge this towards peace, towards flourishing?"
  },
  {
    "start": 786,
    "end": 787,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:54:55)",
    "text": "Here’s the thing, I want to talk to the people of Israel. What is Israel doing right now is not just unfair to the Palestinians, it’s unfair to the Jewish people in Israel. No, it is unfair to the Jewish people around the world, because the way that Israel links itself to Judaism, at a certain point… Remember ISIS and Al-Qaeda, and when everybody hated Muslims? Humans are simple. They cannot have the nuances to separate. So anybody with a Muslim name, with a Muslim face with a beard who looks Muslim, he would do it because of that actions of those atrocities, you have the power as a person to separate yourself from an abusive power, a horrible power, and be yourself."
  },
  {
    "start": 788,
    "end": 789,
    "speaker": "",
    "timestamp": "(01:55:43)",
    "text": "I am really worried because the rise of antisemitism and the rise of hate against Jews is not because of the Jews. It’s because of the actions of a government. Jews do not have to be on the side of apartheid. Ronnie Kasrils, he’s a Jewish South African, and he fought shoulder-to-shoulder next to Nelson Mandela. He was part of the African National Conference, ANC. And he had an article said like, “I know what apartheid is and I saw Israel and this is what they have.” And the thing is, Israel, the Israeli government should listen to other people. You cannot call anybody who criticizes you either an antisemite, or if they’re already Jewish, you call them like self-hating Jew. You cannot do that. You cannot continue doing that, because we did that."
  },
  {
    "start": 790,
    "end": 791,
    "speaker": "",
    "timestamp": "(01:56:28)",
    "text": "When I would go in and criticize the Islamists, it’s like, “Oh, you’re self-hating Muslim. You’re not really Muslim, you’re an infidel, you’re a secret, you’re secular,” whatever. We have the power in order to reform the course by holding people in power accountable. And the thing is, it is very stupid to actually call this antisemitism. My idol is Jon Stewart. I voted for Bernie Sanders. Sarah Taxler, the one who did this amazing documentary about me, Tickling Giants, she’s a Jew. She is married to an Israeli Jew. We have a good ratio because we know what the right is. They don’t have to associate themselves with the action of the Israeli government."
  },
  {
    "start": 792,
    "end": 793,
    "speaker": "Lex Fridman",
    "timestamp": "(01:57:09)",
    "text": "One of your favorite words, Jihad."
  },
  {
    "start": 794,
    "end": 795,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:57:13)",
    "text": "That’s my favorite hobbies."
  },
  {
    "start": 796,
    "end": 797,
    "speaker": "Lex Fridman",
    "timestamp": "(01:57:15)",
    "text": "Favorite hobby."
  },
  {
    "start": 798,
    "end": 799,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:57:15)",
    "text": "It’s in my shows. What’s your guys’ favorite… I talk about how when a white shooter does something, he talks about all of his family. And I was like, “What if we took this for Arab terrorists. What are his hobbies? Jihad.” You see? You could be a comedian."
  },
  {
    "start": 800,
    "end": 801,
    "speaker": "Lex Fridman",
    "timestamp": "(01:57:34)",
    "text": "Yeah. Wow. You’re making me feel good. Okay. Sam Harris has done several episodes on Jihad and people should go listen to it, even if you disagree with it. But the basic idea that he’s proposing is that this idea of Jihad in the negative connotation of it, of martyrdom, is counterproductive, is destructive to the possible future flourishing of Palestinian people. What do you think of that? There’s just the idea of martyrdom-"
  },
  {
    "start": 802,
    "end": 803,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:58:11)",
    "text": "Yeah, I totally agree. But people don’t wake up in the morning and say like, “I want to declare Jihad.” Think about it. Why would anybody choose to end his life by taking other people with him, and end that life? His life must be miserable. He must be pushed into that. Nobody chooses death over life willingly. One of the first suicide bombers in the Palestinian resistance were Christians. We don’t talk about that."
  },
  {
    "start": 804,
    "end": 805,
    "speaker": "Lex Fridman",
    "timestamp": "(01:58:40)",
    "text": "I think he would say that the presence of a story that you can tell yourself when you’re in a really shitty place, that you can go to a much better place by sacrificing your own life… just the fact the presence of that story is there is harmful."
  },
  {
    "start": 806,
    "end": 807,
    "speaker": "Bassem Youssef",
    "timestamp": "(01:58:57)",
    "text": "Of course. But here’s my problem with Sam Harris, and usually people, they have free range talking about the Islamic faith and nitpicking the stuff that makes it put in a bad light. I can go and nitpick every single religion. They are Jews there like Ben-Gvir who openly say spitting on Christians is not a hate speech. I mean, you can bring me all kinds of videos of Islamic Jihadists saying horrible things on YouTube, and I can bring you Jews who live there, they say like, “we are going to have the whole world enslaved for us. And everybody would love to be slaves for the Jews.” I can use the Talmudic argument that if you tie a man to a tree and he dies of thirst and hunger, you didn’t kill that man. And this is kind of the same arguments like, “Ah, we are not killing Palestinians. They’re dying by themselves.”"
  },
  {
    "start": 808,
    "end": 809,
    "speaker": "",
    "timestamp": "(01:59:52)",
    "text": "So the nitpicking of a certain narrative, religious narrative that is separate from the political context and what’s happening right now, it’s very unfair, because I can read… If you want to have a deep dive into religious texts, nobody will be happy. And I can bring stuff from the Talmud and the Torah and stuff that is horrible. But this is a way, again, of distraction."
  },
  {
    "start": 810,
    "end": 811,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:20)",
    "text": "I dare you to talk about Buddhism and Jainism though. Try."
  },
  {
    "start": 812,
    "end": 813,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:00:24)",
    "text": "Well, the people who killed the Muslims in Myanmar, weren’t they Buddhist?"
  },
  {
    "start": 814,
    "end": 815,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:29)",
    "text": "Yeah. Well, hey, let’s go Jainism. Okay, I’ll find the religion. I’ll get back to you. I’ll have to find one."
  },
  {
    "start": 816,
    "end": 817,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:00:35)",
    "text": "The Church of the Flying Monster-"
  },
  {
    "start": 818,
    "end": 819,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:36)",
    "text": "The spaghetti thing?"
  },
  {
    "start": 820,
    "end": 821,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:00:39)",
    "text": "Spaghetti."
  },
  {
    "start": 822,
    "end": 823,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:42)",
    "text": "As a person who tries not to eat carbs, I’m deeply offended by that."
  },
  {
    "start": 824,
    "end": 825,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:00:45)",
    "text": "I mean, there’s Scientologists, all they do is actually buy real estate."
  },
  {
    "start": 826,
    "end": 827,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:51)",
    "text": "I think there’s a few books written about the fact that they do other stuff as well. So even there…"
  },
  {
    "start": 828,
    "end": 829,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:00:57)",
    "text": "I know, I know."
  },
  {
    "start": 830,
    "end": 831,
    "speaker": "Lex Fridman",
    "timestamp": "(02:00:58)",
    "text": "Mormons sometimes… They’re some of the nicest people I’ve ever met, but I’m sure there’s also darkness there too. Oh boy, religion."
  },
  {
    "start": 832,
    "end": 833,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:08)",
    "text": "There’s soaking in Mormons."
  },
  {
    "start": 834,
    "end": 835,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:11)",
    "text": "There’s what?"
  },
  {
    "start": 836,
    "end": 837,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:12)",
    "text": "Soaking."
  },
  {
    "start": 838,
    "end": 839,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:12)",
    "text": "What’s soaking?"
  },
  {
    "start": 840,
    "end": 841,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:13)",
    "text": "Okay. Soaking, basically if you get into the woman and you don’t move, that’s not adultery. That’s not like-"
  },
  {
    "start": 842,
    "end": 843,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:25)",
    "text": "Oh, interesting. So there’s a loophole."
  },
  {
    "start": 844,
    "end": 845,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:25)",
    "text": "Yeah, you go in and you just stay…"
  },
  {
    "start": 846,
    "end": 847,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:29)",
    "text": "There’s a loophole."
  },
  {
    "start": 848,
    "end": 849,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:31)",
    "text": "A loophole. That’s the thing. Religion has loopholes."
  },
  {
    "start": 850,
    "end": 851,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:31)",
    "text": "Religion has a loophole."
  },
  {
    "start": 852,
    "end": 853,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:32)",
    "text": "Yes. And Muslims, we do that the whole time. We pick and choose our sins, the stuff that we enjoy. It’s just we’re humans."
  },
  {
    "start": 854,
    "end": 855,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:39)",
    "text": "There’s 72 virgins waiting for all of us."
  },
  {
    "start": 856,
    "end": 857,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:41)",
    "text": "Maybe if I converted you as a Jew, I’ll get you 80. I don’t know. We can negotiate."
  },
  {
    "start": 858,
    "end": 859,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:46)",
    "text": "But I also have questions about whether-"
  },
  {
    "start": 860,
    "end": 861,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:48)",
    "text": "I’ll give you a very good deal. And maybe I’ll throw there a Camry."
  },
  {
    "start": 862,
    "end": 863,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:51)",
    "text": "I have to be honest. A Camry? It’s pretty good. What year? I don’t know."
  },
  {
    "start": 864,
    "end": 865,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:01:57)",
    "text": "1998. Best year ever."
  },
  {
    "start": 866,
    "end": 867,
    "speaker": "Lex Fridman",
    "timestamp": "(02:01:59)",
    "text": "Well, they last a long time, so I’m not sure I want 72. I-"
  },
  {
    "start": 868,
    "end": 869,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:02:04)",
    "text": "Well, I’ll throw five in the mix and see how we feel."
  },
  {
    "start": 870,
    "end": 871,
    "speaker": "Lex Fridman",
    "timestamp": "(02:02:08)",
    "text": "Yeah, can we-"
  },
  {
    "start": 872,
    "end": 873,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:02:08)",
    "text": "If you want to upgrade…"
  },
  {
    "start": 874,
    "end": 875,
    "speaker": "Lex Fridman",
    "timestamp": "(02:02:09)",
    "text": "Yeah. Can we do a trial period? But in general, if you just zoom out, do you think religion is… In what way is it good for the world? In what way is it harmful?"
  },
  {
    "start": 876,
    "end": 877,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:02:22)",
    "text": "If there was no religion, humans would have invented religion, because think about it. Think of the early humanity. You’re a caveman or whatever, and then you see your family members killed and then you say, “What? I’m going to be the sheep or the gazelle that just ends and perish? I am more important.” I think with the development of consciousness, humans thought that they are much more precious and important than the other animals because they have now intelligence. So my life will not end like that. My death will be even more important. There’s consequences for that. There’s consequences for what I do."
  },
  {
    "start": 878,
    "end": 879,
    "speaker": "",
    "timestamp": "(02:03:01)",
    "text": "And then the early man was there in the desert and all of these natural phenomena. They didn’t know what to do. They were afraid. So they need to have refuge. They need to have something to take care of. They need to have a reason for everything, because if there’s no reason, it’s chaos. It’s chaos."
  },
  {
    "start": 880,
    "end": 881,
    "speaker": "Lex Fridman",
    "timestamp": "(02:03:19)",
    "text": "It’s terrifying."
  },
  {
    "start": 882,
    "end": 883,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:03:20)",
    "text": "It’s terrifying. There’s nothing. There has to be a reason. There has to be a reason, there has to be a purpose. There has to be a cause, something. I’m not just going to be die like a cockroach being stepped on. And that’s kind of part of it is ego."
  },
  {
    "start": 884,
    "end": 885,
    "speaker": "Lex Fridman",
    "timestamp": "(02:03:36)",
    "text": "The whole world rotates around you in a way."
  },
  {
    "start": 886,
    "end": 887,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:03:38)",
    "text": "It’s the ego. So religion actually got a lot of it from humanity itself. Like me, like us being humans. And many religion is a collection of stories, and those stories based on things that humans did themselves and they attributed it to gods."
  },
  {
    "start": 888,
    "end": 889,
    "speaker": "Lex Fridman",
    "timestamp": "(02:03:57)",
    "text": "And there’s an aspect of religion where you humble yourself before a thing that is much greater than you. So that has, I would say, a very positive effect of humbling."
  },
  {
    "start": 890,
    "end": 891,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:04:08)",
    "text": "It will be great if it stop there. But here’s the thing, if you humble, in order that your ego kicks in and feel that you are better than someone else who’s not humbled in front of the same God-"
  },
  {
    "start": 892,
    "end": 893,
    "speaker": "Lex Fridman",
    "timestamp": "(02:04:08)",
    "text": "You always go there."
  },
  {
    "start": 894,
    "end": 895,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:04:19)",
    "text": "… that means that I will have all of that [inaudible 02:04:22] that I can use that because now… What does mean, being humble? I’m divine. But I’m not-"
  },
  {
    "start": 896,
    "end": 897,
    "speaker": "Lex Fridman",
    "timestamp": "(02:04:28)",
    "text": "Yeah. Also, I’m way more humble than you."
  },
  {
    "start": 898,
    "end": 899,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:04:29)",
    "text": "Ah, but you’re not. So you see how they kind of like the oxymoron. I’m humble and I’m surrendering, but in the same time I am better than you and I’m more entitled. Isn’t it crazy?"
  },
  {
    "start": 900,
    "end": 901,
    "speaker": "Lex Fridman",
    "timestamp": "(02:04:38)",
    "text": "Yeah, it’s beautiful. It’s crazy. It’s absurd. It’s-"
  },
  {
    "start": 902,
    "end": 903,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:04:41)",
    "text": "I mean, look at the Muslim, Christians and Jews and everyone. Say, “All right, Muslims, we surrendered.” I’m talking about the extreme ones. I mean people… I surrender to God. Good. Keep it that way. If you go there. I surrender to God, that means that I am closer to God than you, then you should die. Okay, Christians. Christ is love and he loves me and we are going to be together. But you don’t get into his kingdom and you die. You see, it’s the same thing. If you-"
  },
  {
    "start": 904,
    "end": 905,
    "speaker": "Lex Fridman",
    "timestamp": "(02:04:41)",
    "text": "Just stop it and-"
  },
  {
    "start": 906,
    "end": 907,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:05:11)",
    "text": "Like stop there. Stop where you are humble and you feel that you’re a piece of shit and you are a worthless human being and you are there. Stop there. But once you says like, “Oh, that makes me a better person than you, and it makes me more with God than you, so that would give me the entitlement to kick your ass.”"
  },
  {
    "start": 908,
    "end": 909,
    "speaker": "Lex Fridman",
    "timestamp": "(02:05:30)",
    "text": "Yeah, we always ruin a good thing,"
  },
  {
    "start": 910,
    "end": 911,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:05:32)",
    "text": "Don’t we?"
  },
  {
    "start": 912,
    "end": 913,
    "speaker": "Lex Fridman",
    "timestamp": "(02:05:34)",
    "text": "That ego. You’ve been outspoken, with Piers Morgan, but just on this topic, and you talked about the Superman story, which I would love it if you were in a Superman movie. But have you lost job opportunities because of this, because of speaking out?"
  },
  {
    "start": 914,
    "end": 915,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:05:56)",
    "text": "There was a couple of things that were going on, but they stopped again. I don’t know if it’s October 7th."
  },
  {
    "start": 916,
    "end": 917,
    "speaker": "Lex Fridman",
    "timestamp": "(02:06:03)",
    "text": "Can you tell the Superman story just so-"
  },
  {
    "start": 918,
    "end": 919,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:06:03)",
    "text": "Yeah, yeah. So-"
  },
  {
    "start": 920,
    "end": 921,
    "speaker": "Lex Fridman",
    "timestamp": "(02:06:04)",
    "text": "What role were you?"
  },
  {
    "start": 922,
    "end": 923,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:06:06)",
    "text": "Oh, okay-"
  },
  {
    "start": 924,
    "end": 925,
    "speaker": "Lex Fridman",
    "timestamp": "(02:06:06)",
    "text": "What did you audition for?"
  },
  {
    "start": 926,
    "end": 927,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:06:08)",
    "text": "Yes. Okay, okay. So in June I was traveling to Dubai and an hour before I get into the car and go there, my manager is like, “Bass, I’m going to send you a script, read it. It’s for Superman.” It’s like, oh, Superman. I am not really good in auditions. I’m not a seasoned actor. So I was like, “Okay, I’m just going to do it, send the tape.” I do the tape, I send it. I go to the airport, and I read… and I think I can talk about it now because they said they changed the script. So basically what I found it interesting in that new script is that there is a dictator in a country that invades another country, and Superman interferes politically. That’s the first time we ever see Superman interferes politically. So basically it was Russia and Ukraine, but because of me, it was like it couldn’t be Russia and Ukraine. So it had to be something kind of with a flavor."
  },
  {
    "start": 928,
    "end": 929,
    "speaker": "",
    "timestamp": "(02:06:59)",
    "text": "So I read the role as if a mixture of Trump and Mubarak. I did this mix, like, “You know…” Kind of the Middle East, but also kind of the essence of Trump into it. I went to the airport. It’s like an hour. It’s like James Gunn saw it, he loves it. It’s like, what? I never had an audition that fast. I mean, I had a few roles, but not that fast, not like that. And then I said, “Well, the strike starts tomorrow and we need to be on the phone… After the strike, we cannot talk.” The SAG after strike, like the writers and the actors strike. So like, “well, I’m going to be on a plane right now.” It’s like, “Okay, once you land, you can have a Zoom call with James Gunn.”"
  },
  {
    "start": 930,
    "end": 931,
    "speaker": "",
    "timestamp": "(02:07:41)",
    "text": "I have a call with James Gunn. I’m a huge fan of him. The guy took something like Guardians of the Galaxy, nobody knew about it, made amazing trilogy. And he is like a really cool guy. I like what he did. And it was really nice. And he started to talk to me about the movie. And I talked to people before we were casting them. So I know that everybody on set have a good chemistry. It was amazing. So in your mind, if you’re an actor, what does that mean? You got the part. And he told me, “You got the part.” Month goes by, strike goes by. October 7th happens. I do Piers Morgan one and two. And then I go to my Australian tour. My manager called me. “Bassem…” The strike was over. It’s like, “You don’t have the part anymore.”"
  },
  {
    "start": 932,
    "end": 933,
    "speaker": "",
    "timestamp": "(02:08:27)",
    "text": "I was sad, very sad, but for three days. And I said, “[inaudible 02:08:30].” I’m actually doing very well. [inaudible 02:08:34]. And then when I went to Chris Cuomo after I finished the show, he told me, “Did you lose any opportunities?” And that was off record, after the show was concluded. And I talked about Superman, and I found myself when I was talking, I was angry, I was bitter. And I went home. I was like, ” Why was I angry? Why was I bitter? It wasn’t meant to be. And I’m living a good life now. I don’t need to…”"
  },
  {
    "start": 934,
    "end": 935,
    "speaker": "",
    "timestamp": "(02:09:08)",
    "text": "So when I was asked again the next day in two different interviews, the BBC and another one also with my friend, [inaudible 02:09:15], I said the story in a different way. I said, “I don’t have any anger. As a matter of fact, maybe if I was Warner Brothers…” I didn’t talk about James Gunn. I thought it was the studio. If I was Warner Brothers and I’m a Muslim, I wouldn’t have a Zionist or a pro-Israeli in my movie. But I want to tell them that when I criticize Israel, I am not a threat to you as a Jew. And we can actually have more in common. That was more of a kind of empathic."
  },
  {
    "start": 936,
    "end": 937,
    "speaker": "",
    "timestamp": "(02:09:41)",
    "text": "So when I said, that the internet went crazy, and James Gunn have haters because the Snyder-verse and all of this. It’s a world that I don’t understand. And James Gunn had all of these attacks on him, and I was pissed with how it was handled. I wasn’t angry at James Gunn, but I thought it was handled… So my publicist and manager is like, “Bassem, stay calm, don’t speak. It’s better to not talk about it.” I said, “Okay.”"
  },
  {
    "start": 938,
    "end": 939,
    "speaker": "",
    "timestamp": "(02:10:13)",
    "text": "So there’s nothing wrong about me, but I see the heat is rising against James Gunn. And that is a guy that I had a personal connection with, even through Zoom. And I didn’t like what was happening. And then he called me and he explained to me and said, “Bassem, I actually have camera tests before people, before finally…” I didn’t know that. “And then we changed the script and it was the strike. So I didn’t call.” And also I thought to myself, I’m small. I’m a small actor. I’m not that important for him to call me to say, “We’re going to change the script.”"
  },
  {
    "start": 940,
    "end": 941,
    "speaker": "",
    "timestamp": "(02:10:42)",
    "text": "So I still think that the timing sucks and everything. But then I went and I did a video explaining exactly what I’m telling you, because I didn’t want to be famous for the wrong reasons, because that would be unfair. Because already people were… and I was having interviews. “Can you come about to Superman?” I was like, ” Guys, that’s it. I’m not going to talk about it, because this is a non-issue.” And when I talked to James on the phone, I felt how sincere he was. So I didn’t want someone, because of me will, have that kind of attack, because I know what it means to be on the other side of that kind of attack. It’s terrible. And it ruins your life and it ruins your day. And nobody deserves to be doing that. And I don’t want to be the reason for someone else to go through that pain."
  },
  {
    "start": 942,
    "end": 943,
    "speaker": "Lex Fridman",
    "timestamp": "(02:11:25)",
    "text": "And you also said that you don’t want to be a victim."
  },
  {
    "start": 944,
    "end": 945,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:11:29)",
    "text": "Yeah, I don’t want to be. I’m doing great. I’m selling out everywhere. I’m having a wonderful, loyal audiences coming to me. Why I would be angry about the role of its Superman? Yes, it’s great to be in the superhero movies, but so what?"
  },
  {
    "start": 946,
    "end": 947,
    "speaker": "Lex Fridman",
    "timestamp": "(02:11:43)",
    "text": "There’s a wisdom in that. Even if you weren’t doing great, that’s a choice a lot of people can come to, which is like, do I play victim here or not?"
  },
  {
    "start": 948,
    "end": 949,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:11:53)",
    "text": "It’s greed. It’s greed. They want more attention. They want to be more into the thing. They want more and more. And there’s so much to go around to be enough for all of us. But it is-"
  },
  {
    "start": 950,
    "end": 951,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:12:00)",
    "text": "There is so much to go around to be enough for all of us, but it’s great. It is ego, ego, ego, ego. I need to be in the center, I need to be victimized, I need to make people feel sorry for me and love me. It is not the right way. It is not because it is fake, it’s fake, it’s made up. I did not victimize myself when I left for Egypt. I speak about it now, but in that dark times, I was detained in airports. I didn’t have my American passport yet, I was still traveling with my Egyptian passport, and I was detained in an Arab airport and I was going to be delivered to the Egyptians."
  },
  {
    "start": 952,
    "end": 953,
    "speaker": "",
    "timestamp": "(02:12:38)",
    "text": "I had shows, when I was still starting, I had hecklers being sent to me by the Egyptian embassy and Egyptian Consulate in New York and in London to curse me and to take videos of that and then send it to state-run media in Egypt. I didn’t speak about that because I felt that if I speak about that, I feel about what was going on to me, I would be victimizing myself. It’s like if I’m going to be good, I’m going to be good because of what I do, not because of what people’s perception of what I’m going through."
  },
  {
    "start": 954,
    "end": 955,
    "speaker": "Lex Fridman",
    "timestamp": "(02:13:07)",
    "text": "That becomes a slippery slope, and somehow victimizing yourself="
  },
  {
    "start": 956,
    "end": 957,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:13:10)",
    "text": "Goes to more victimizing, and then you cannot leave that habit. You can only exist and thrive if people feel sorry for you."
  },
  {
    "start": 958,
    "end": 959,
    "speaker": "Lex Fridman",
    "timestamp": "(02:13:18)",
    "text": "Yeah, Israel and Palestine currently both have that temptation."
  },
  {
    "start": 960,
    "end": 961,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:13:25)",
    "text": "I would always push back when you do the comparison, because one of them is not really the same kind of power."
  },
  {
    "start": 962,
    "end": 963,
    "speaker": "Lex Fridman",
    "timestamp": "(02:13:33)",
    "text": "For sure, for you that’s a big problem."
  },
  {
    "start": 964,
    "end": 965,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:13:35)",
    "text": "It’s very easy to say why Palestinians would victimize themselves, but Israel, with all of that military white man, it’s too much. What Israel is doing is that they’re victimizing the Jewish experience, and I don’t think it’s fair for a lot of Jews. I don’t think that they should use the Holocaust and the persecution that happened to Jewish people all through history in order to push an equally oppressive agenda. That is not fair and it’s not good for the Jewish people living, and it is basically a disrespect to the memory of the Holocaust. I told you I want to make a movie about the Holocaust. I do, because what happened, that kind of engineered torture, should never happen again, and it should not be happening now."
  },
  {
    "start": 966,
    "end": 967,
    "speaker": "Lex Fridman",
    "timestamp": "(02:14:20)",
    "text": "To you, what Israel is doing is leading to more anti-Semitism in the world?"
  },
  {
    "start": 968,
    "end": 969,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:14:23)",
    "text": "A hundred percent. Can I be a conspiracy theorist for a second?"
  },
  {
    "start": 970,
    "end": 971,
    "speaker": "Lex Fridman",
    "timestamp": "(02:14:27)",
    "text": "Please. There earth is flat, we all know this."
  },
  {
    "start": 972,
    "end": 973,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:14:30)",
    "text": "A part of me thinking maybe they’re doing that intentionally, because if there’s a rise of anti-Semitism in Jews, there will always point like, “See, they hate us, so we can do whatever we want. If we let go of our might in our strength, we are going to go back to the concentration camps because you see how the word hates you.”"
  },
  {
    "start": 974,
    "end": 975,
    "speaker": "Lex Fridman",
    "timestamp": "(02:14:53)",
    "text": "Again, when you say “they”, are people in power."
  },
  {
    "start": 976,
    "end": 977,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:14:56)",
    "text": "Yeah, absolutely. Listen, it’s always the people in power. I believe that humans are easily corruptible and easily repairable, but the corruptive part is much easier. People could change, but power, people in power are very dangerous. Very, very dangerous. Especially if you have religion – which is power by itself -military might, political support, and money. Dude, that’s a very, very, very dangerous recipe."
  },
  {
    "start": 978,
    "end": 979,
    "speaker": "Lex Fridman",
    "timestamp": "(02:15:29)",
    "text": "All that said, I do believe in the power of the little guy. The individual just overthrow the government. I don’t know if you heard, but the Arab Spring… It happens."
  },
  {
    "start": 980,
    "end": 981,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:15:41)",
    "text": "We are here-"
  },
  {
    "start": 982,
    "end": 983,
    "speaker": "Lex Fridman",
    "timestamp": "(02:15:42)",
    "text": "Just among friends."
  },
  {
    "start": 984,
    "end": 985,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:15:43)",
    "text": "We are Americans, right?"
  },
  {
    "start": 986,
    "end": 987,
    "speaker": "Lex Fridman",
    "timestamp": "(02:15:44)",
    "text": "Yes."
  },
  {
    "start": 988,
    "end": 989,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:15:44)",
    "text": "We’re Americans"
  },
  {
    "start": 990,
    "end": 991,
    "speaker": "Lex Fridman",
    "timestamp": "(02:15:45)",
    "text": "Allegedly."
  },
  {
    "start": 992,
    "end": 993,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:15:47)",
    "text": "We’re Americans."
  },
  {
    "start": 994,
    "end": 995,
    "speaker": "Lex Fridman",
    "timestamp": "(02:15:50)",
    "text": "How funny is that? Just given our two backgrounds. We’re American."
  },
  {
    "start": 996,
    "end": 997,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:15:54)",
    "text": "We’re Americans. It’s like we’re Americans. There’s one thing about the power of the little guy that I am very sad about because you see… I love America by the way. I consider it my new home, and I want my kids to grow up here. I am very grateful for the opportunity that I have in the United States, and I criticize the United States politics, and I criticize it out of love. The same way that I was criticizing what’s happening of Egypt out of love. What is worrying for me is how the power of the little man is diminishing."
  },
  {
    "start": 998,
    "end": 999,
    "speaker": "",
    "timestamp": "(02:16:35)",
    "text": "It doesn’t matter now who you vote into power, they will not listen to you. They would listen to the people who paid them to be there, and it is very concerning because I can see the American democracies turning, not even slowly, very rapidly into an oligarchy. I’m sure that all of the millions of people who are voting, they don’t vote for the NRA, they don’t vote for APAC, they don’t vote for the pharmaceutical companies, they don’t vote for the military industry complex. Yet, the people in power, they come in, they take your vote and my vote, and they’re loyal to those people, not to us. It is very, very, very concerning. Very concerning. This is the danger of American policies, American politics and American democracies. It’s dangerous, because basically, the vote becomes just a ceremony that the someone with the more funding will get to power, and then he’s not loyal to you."
  },
  {
    "start": 1000,
    "end": 1001,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:41)",
    "text": "Still the fire. We are in Texas. Everybody’s armed to the teeth here."
  },
  {
    "start": 1002,
    "end": 1003,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:17:47)",
    "text": "What are these arms going to do in front of tanks?"
  },
  {
    "start": 1004,
    "end": 1005,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:51)",
    "text": "You said the American military is unique in this way."
  },
  {
    "start": 1006,
    "end": 1007,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:17:55)",
    "text": "I know, but for now"
  },
  {
    "start": 1008,
    "end": 1009,
    "speaker": "Lex Fridman",
    "timestamp": "(02:17:57)",
    "text": "For now, the tanks are… First of all, I believe Russia has more tanks than the United States. Tanks. I’m not an expert in military strategic deployment of arms, but the United States uses different kinds of weapons."
  },
  {
    "start": 1010,
    "end": 1011,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:18:13)",
    "text": "They have drones and they have the lasers, and they’re sitting comfortably behind the screens. It’s kind of like it turns a big Xbox game."
  },
  {
    "start": 1012,
    "end": 1013,
    "speaker": "Lex Fridman",
    "timestamp": "(02:18:22)",
    "text": "They sell a lot of those things to everybody."
  },
  {
    "start": 1014,
    "end": 1015,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:18:25)",
    "text": "It’s crazy because the defense budget is 68% of American military, it’s like almost 850 billion each year. Most of that weapons, we don’t even need it. We just do it because of the contracts. There was an incredible 60 Minutes, I’m sure that you saw it, the one about the gouging of the prices of the Department of… It was one of the most fascinating things that I’ve ever seen. They say like a valve, a safety of a oil valve, that used to be sold for $329, now it’s sold for $9,000. Why? Because there’s only five weapon companies and they can control the prices, and in 2006, the whole Apache fleet of the American army in Iraq was grounded because there was one valve that they were gouging the price and didn’t want to give them. The Stinger missile, the one that you carry and it’s like the anti-aircraft, used to be sold for $25,000. Now it’s sold for $400,000. Nobody is doing that because the DOD has fired 130,000 people, including engineers and negotiators."
  },
  {
    "start": 1016,
    "end": 1017,
    "speaker": "",
    "timestamp": "(02:19:35)",
    "text": "Now, in order to cut expenses, now we’re paying more money. The thing is, we do not have a say in this. We do not have a say in how my tax money and your tax money is being spent, because I’m sure you don’t want your money to be sent to Israel like that. I’m sure, even if you’re Jewish, I’m sure, I’m sure that I don’t want my money to be given to some Muslim countries who kill other Muslims. I’m sure. Here’s the thing, what kind of power do we have other than speaking? What is left for us is free speech. Now when you speak, they call you anti-Semitic. You see why I’m angry."
  },
  {
    "start": 1018,
    "end": 1019,
    "speaker": "Lex Fridman",
    "timestamp": "(02:20:11)",
    "text": "Still, America’s holding pretty strong despite the criticisms on the free speech front. If you look at the freedom of the press, freedom of the speech index, America is not at the top."
  },
  {
    "start": 1020,
    "end": 1021,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:20:23)",
    "text": "It is not. This is why, for example, it is very disheartening for me to see that the Western media, Western press, that used to be the beacon of freedom as now using as mouthpieces. It is funny how Nixon got angry in the New York Times in 1971 when they found leaks about Tim lying about the Vietnam War since the beginning. Now, he hired the plumbers, the special units, in order to go in and find the leaks. This was Watergate basically, because he was angry to see who leaked that instead of fixing the problem. Now, the New York Times have published this story about the rape that was a hoax that was written by Anna Schwartz, someone will have no experience, and now when it was leaked, instead of them correcting themselves, they went in and they had their own investigation to see who leaked. The New York Times in 2003 became the mouthpiece of George W. Bush of the WMD, and now as an American, I see the New York Times becoming a mouthpiece of a foreign country? Why do you do that?"
  },
  {
    "start": 1022,
    "end": 1023,
    "speaker": "Lex Fridman",
    "timestamp": "(02:21:28)",
    "text": "One of the things that’s really difficult to know is where to find the truth. It does seem that both sides use propaganda, and both sides lie a lot."
  },
  {
    "start": 1024,
    "end": 1025,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:21:40)",
    "text": "Both sides as in?"
  },
  {
    "start": 1026,
    "end": 1027,
    "speaker": "Lex Fridman",
    "timestamp": "(02:21:41)",
    "text": "Both Israel and Palestine. Pro-Palestine, Pro-Israel, there’s a lot of lies"
  },
  {
    "start": 1028,
    "end": 1029,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:21:48)",
    "text": "I know, but it’s a lot of inequality, man. There’s a lot of people on the internet, but who have the mainstream media siding with."
  },
  {
    "start": 1030,
    "end": 1031,
    "speaker": "Lex Fridman",
    "timestamp": "(02:21:59)",
    "text": "Thanks to social media."
  },
  {
    "start": 1032,
    "end": 1033,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:22:00)",
    "text": "Yes, thank God for social media, because now it’s individuals. They’re the people. They’re people. You are comparing BBC, New York Times, Washington Post with just people with a TikTok account."
  },
  {
    "start": 1034,
    "end": 1035,
    "speaker": "Lex Fridman",
    "timestamp": "(02:22:13)",
    "text": "Who have more power in your view?"
  },
  {
    "start": 1036,
    "end": 1037,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:22:15)",
    "text": "It is actually very, very fascinating to see the little man having that power over the media, because-"
  },
  {
    "start": 1038,
    "end": 1039,
    "speaker": "Lex Fridman",
    "timestamp": "(02:22:20)",
    "text": "In fact, disproportionately so. This is my problem."
  },
  {
    "start": 1040,
    "end": 1041,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:22:24)",
    "text": "You cannot call people with TikTok propagandists while people being paid to casually give you the news and they deliberately lie to you."
  },
  {
    "start": 1042,
    "end": 1043,
    "speaker": "Lex Fridman",
    "timestamp": "(02:22:31)",
    "text": "Yes, I can. They’re both propagandists."
  },
  {
    "start": 1044,
    "end": 1045,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:22:35)",
    "text": "Yes, but the mechanism and the intentions are different because here’s the thing-"
  },
  {
    "start": 1046,
    "end": 1047,
    "speaker": "Lex Fridman",
    "timestamp": "(02:22:42)",
    "text": "I’d rather have the TikTok guy than the…"
  },
  {
    "start": 1048,
    "end": 1049,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:22:47)",
    "text": "The TikTok guy is a TikTok guy, but if you have the New York Times being exposed to be lying, and then they get this UN report, which is like a disgrace, and you just put the title and you don’t talk about it. I’m fine with CNN and Jake Tapper and all of those people spreading the rape allegations for years. I don’t even want them to refute them, I want them to bring the Israeli reports saying that it didn’t happen. The Israeli media themselves, they didn’t even bother, not once. Is that balanced? That’s not, so that’s why people in TikTok, because they have to take matters in their own hand."
  },
  {
    "start": 1050,
    "end": 1051,
    "speaker": "Lex Fridman",
    "timestamp": "(02:23:24)",
    "text": "The problem with the people in TikTok is the drug, the dopamine rush, of getting a lot of likes. Instead of talking about the death of civilians, they’ll talk about beheaded babies, or the equivalent of. They’re going to actually make up stories, because the made up stories are going to be more viral. Now, we’re just in the sea, in this muck of lies."
  },
  {
    "start": 1052,
    "end": 1053,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:23:45)",
    "text": "There’s a lot of people who actually exposed those lies on TikTok. You have both."
  },
  {
    "start": 1054,
    "end": 1055,
    "speaker": "Lex Fridman",
    "timestamp": "(02:23:48)",
    "text": "True."
  },
  {
    "start": 1056,
    "end": 1057,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:23:49)",
    "text": "You have both. It’s kind of like the democracy of the social media as we always it. But if you have the street-run media that is the legacy media, CNN, BBC, New York Times, Fox News, all of those people, and they are spreading lies and they’re not even doing the journalistic job in order to at least bring the other side, that’s problematic."
  },
  {
    "start": 1058,
    "end": 1059,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:09)",
    "text": "That’s worse. You’re supposed to be journalists."
  },
  {
    "start": 1060,
    "end": 1061,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:24:12)",
    "text": "It’s supposed to be report. Report."
  },
  {
    "start": 1062,
    "end": 1063,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:17)",
    "text": "I see that this as a catalyst, an inspiration, for the citizen journalists to rise up."
  },
  {
    "start": 1064,
    "end": 1065,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:24:24)",
    "text": "This is what you’re doing."
  },
  {
    "start": 1066,
    "end": 1067,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:25)",
    "text": "This, yeah,"
  },
  {
    "start": 1068,
    "end": 1069,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:24:26)",
    "text": "This is what you’re doing. No, this is what you’re doing, because you go into a deep dive. This is a no filter thing. There’s no spin."
  },
  {
    "start": 1070,
    "end": 1071,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:32)",
    "text": "The long form, the long form is going to save us."
  },
  {
    "start": 1072,
    "end": 1073,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:24:38)",
    "text": "I see why you hate the TikToks, like a dopamine rush."
  },
  {
    "start": 1074,
    "end": 1075,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:40)",
    "text": "Stupid TikTok. Five hours later."
  },
  {
    "start": 1076,
    "end": 1077,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:24:43)",
    "text": "I saw the resentment in your face."
  },
  {
    "start": 1078,
    "end": 1079,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:47)",
    "text": "Can’t look away."
  },
  {
    "start": 1080,
    "end": 1081,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:24:48)",
    "text": "Those 30 seconds, I do four hours."
  },
  {
    "start": 1082,
    "end": 1083,
    "speaker": "Lex Fridman",
    "timestamp": "(02:24:53)",
    "text": "Both have a place, both are exciting, but it is very dangerous because you can’t look away. I almost never, maybe I’m doing it wrong, but I almost never feel better ever after having used TikTok."
  },
  {
    "start": 1084,
    "end": 1085,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:25:08)",
    "text": "Makes two of us. I can’t. I have a team. By the way, I give my password to a team. I don’t even go there because once in a dark night, very late at night, I went TikTok, and it was like, two hours. What?"
  },
  {
    "start": 1086,
    "end": 1087,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:26)",
    "text": "Yeah."
  },
  {
    "start": 1088,
    "end": 1089,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:25:27)",
    "text": "What? I said, ” No, this is dangerous.” I’m really like an Instagram and Facebook guy. I don’t need that."
  },
  {
    "start": 1090,
    "end": 1091,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:35)",
    "text": "Even there, man."
  },
  {
    "start": 1092,
    "end": 1093,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:25:37)",
    "text": "I barely get out of Twitter, I mean X, I can’t. It’s a cesspool. It’s just like the concentrated hate, X is too much. It’s too much. I can’t."
  },
  {
    "start": 1094,
    "end": 1095,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:47)",
    "text": "You don’t check it at all, you try not to check it at all? It is very intense."
  },
  {
    "start": 1096,
    "end": 1097,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:25:51)",
    "text": "I don’t, I post something and I run."
  },
  {
    "start": 1098,
    "end": 1099,
    "speaker": "Lex Fridman",
    "timestamp": "(02:25:57)",
    "text": "Post and ghost. You’re doing comedy here in the United States right now?"
  },
  {
    "start": 1100,
    "end": 1101,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:26:02)",
    "text": "Yes."
  },
  {
    "start": 1102,
    "end": 1103,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:03)",
    "text": "Joe Rogan has the Comedy Mothership, which is an incredible club. Have you considered doing that club?"
  },
  {
    "start": 1104,
    "end": 1105,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:26:09)",
    "text": "I would love to."
  },
  {
    "start": 1106,
    "end": 1107,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:09)",
    "text": "Do you know Joe?"
  },
  {
    "start": 1108,
    "end": 1109,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:26:11)",
    "text": "Of course. Who doesn’t new Joe?"
  },
  {
    "start": 1110,
    "end": 1111,
    "speaker": "Lex Fridman",
    "timestamp": "(02:26:14)",
    "text": "I feel like it’s a small world of comedy. That’s why I…"
  },
  {
    "start": 1112,
    "end": 1113,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:26:17)",
    "text": "I think Joe’s story, like what he did and stuff that he did in the UFC and his podcast, it’s very impressive. The fact that he’s there and he’s bringing all of those people, whether in comedy or his podcast, is very impressive. This is what the media is all about, what the internet is all about, to give you the experiences of stuff that you might never experience. That is very important. You do it with people where you go into their brains. He goes, takes people, and they take their experiences and their lives and their stories. It’s very interesting. This is the beauty of that art form, because you have all of these experiences at the tips of your hands and it’s there for you to learn from. When he moved to Texas and we did the Comedy Mothership, anybody who would push comedy forward, that is the most difficult art form and the most demanding. The fact that you do that, and he might not even be making money out of it, but he’s doing that because of his passion, that is enough."
  },
  {
    "start": 1114,
    "end": 1115,
    "speaker": "Lex Fridman",
    "timestamp": "(02:27:25)",
    "text": "He really believes in creating this place where comedians could be really free. One of the cool things about the Comedy Mothership is comedian is king there. You have to bow down to the…"
  },
  {
    "start": 1116,
    "end": 1117,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:27:41)",
    "text": "Because the comedian who came there came after eating shit, dying out there."
  },
  {
    "start": 1118,
    "end": 1119,
    "speaker": "Lex Fridman",
    "timestamp": "(02:27:46)",
    "text": "Eating shit everywhere else."
  },
  {
    "start": 1120,
    "end": 1121,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:27:47)",
    "text": "Basically, you’re a saint."
  },
  {
    "start": 1122,
    "end": 1123,
    "speaker": "Lex Fridman",
    "timestamp": "(02:27:50)",
    "text": "I have eaten shit for many years."
  },
  {
    "start": 1124,
    "end": 1125,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:27:54)",
    "text": "Now, I’m going to give you shit."
  },
  {
    "start": 1126,
    "end": 1127,
    "speaker": "Lex Fridman",
    "timestamp": "(02:27:58)",
    "text": "You already told me what you think about the state of politics in the United States, but now tell me what you really think. What do you think of the choice of Trump versus Biden? How did we end up here?"
  },
  {
    "start": 1128,
    "end": 1129,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:28:08)",
    "text": "I don’t know, man. The fact that you have two people over the age of 90, it is-"
  },
  {
    "start": 1130,
    "end": 1131,
    "speaker": "Lex Fridman",
    "timestamp": "(02:28:14)",
    "text": "I think it’s over a hundred, but that’s all right."
  },
  {
    "start": 1132,
    "end": 1133,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:28:16)",
    "text": "Combined like 170. It is so sad. It is so sad that this is what we can produce as a society, like a demagogue and a sleepy Joe. He’s not there, man. He’s gone. He’s gone. When old people could be a danger for themselves, he’s a danger for the whole world. The whole world. If an old person would die who would have a hip replacement, we can need them a new planet because of one decision. It’s not just that, it’s not that. I am a Democrat, and I told you I vote for Bernie Sanders. I supported him 2016, but I couldn’t vote then. Of course, a huge fan of Obama. One of my things is he’s the first Muslim president, but he killed Muslims. It’s like, that’s things Muslims do."
  },
  {
    "start": 1134,
    "end": 1135,
    "speaker": "Lex Fridman",
    "timestamp": "(02:29:24)",
    "text": "I love that line."
  },
  {
    "start": 1136,
    "end": 1137,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:29:31)",
    "text": "I think the whole idea, my shock, is… I told you about what Biden said about “I’m a Zionist.” Okay, you’re a Zionist, but then it’s, “Jews are not safe in anywhere other than Israel.” It’s like, dude, what the hell are you saying? If you don’t care about me and you don’t care about my misery, why would I care about you winning or losing? I have a joke that I told people. Why would even Biden listen to us? He just raised $ 145 million in California alone from pro-Israeli groups. What can we, Arabs, working in the vape business do to him? We cannot compete with that. Practically. Life is unfair. The guy’s a politician. He needs bills to pay. He needs a campaign to run. He needs money. He will go to the people who will give me money. Joe Biden is the highest paid politician from Israeli lobbyists, $4.6 million over the years."
  },
  {
    "start": 1138,
    "end": 1139,
    "speaker": "Lex Fridman",
    "timestamp": "(02:30:35)",
    "text": "I also believe in great leaders that go against all of that. Unfortunately-"
  },
  {
    "start": 1140,
    "end": 1141,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:30:41)",
    "text": "Bernie Sanders was like that."
  },
  {
    "start": 1142,
    "end": 1143,
    "speaker": "Lex Fridman",
    "timestamp": "(02:30:43)",
    "text": "Bernie Sanders, yes, but also age. I don’t want to be ageist."
  },
  {
    "start": 1144,
    "end": 1145,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:30:48)",
    "text": "Of course, no."
  },
  {
    "start": 1146,
    "end": 1147,
    "speaker": "Lex Fridman",
    "timestamp": "(02:30:50)",
    "text": "Because I remember listening to Bernie Sanders 20 years ago on Tom Hartman show, and I don’t want to say anything against Bernie, but he was sharper then."
  },
  {
    "start": 1148,
    "end": 1149,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:31:00)",
    "text": "Of course."
  },
  {
    "start": 1150,
    "end": 1151,
    "speaker": "Lex Fridman",
    "timestamp": "(02:31:01)",
    "text": "There’s a thing with age."
  },
  {
    "start": 1152,
    "end": 1153,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:31:02)",
    "text": "Of course. I think I’m a huge fan about putting a limit on your working years, because you don’t want to have a Mitch McConnell moment every now. Because now the whole thing of what is this, isn’t this not like a horse by [inaudible 02:31:17]? It is unfair. It is unfair. The whole idea that you have unlimited… You have a limit for the president, but you don’t have a limit for Congress people and senators? What do you mean? This is, basically, you can go in and be in governance forever, and the longer that you can get, the more corrupt you’ll get."
  },
  {
    "start": 1154,
    "end": 1155,
    "speaker": "Lex Fridman",
    "timestamp": "(02:31:35)",
    "text": "Yes, that’s the thing."
  },
  {
    "start": 1156,
    "end": 1157,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:31:38)",
    "text": "That is very concerning for Americans."
  },
  {
    "start": 1158,
    "end": 1159,
    "speaker": "Lex Fridman",
    "timestamp": "(02:31:39)",
    "text": "Everybody. Everybody becomes corrupt after. That’s why two terms is a good limit."
  },
  {
    "start": 1160,
    "end": 1161,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:31:44)",
    "text": "For everybody."
  },
  {
    "start": 1162,
    "end": 1163,
    "speaker": "Lex Fridman",
    "timestamp": "(02:31:46)",
    "text": "Maybe half a term for Egyptian leaders."
  },
  {
    "start": 1164,
    "end": 1165,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:31:51)",
    "text": "Our half-term is 15 years,"
  },
  {
    "start": 1166,
    "end": 1167,
    "speaker": "Lex Fridman",
    "timestamp": "(02:31:55)",
    "text": "Quarter term. You should come back and run for office there."
  },
  {
    "start": 1168,
    "end": 1169,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:32:01)",
    "text": "Oh my god, no. There’s a curse in Egyptian of Egyptian presidency. No, nobody comes there. He is either dead or in jail. It’s not the most appealing job."
  },
  {
    "start": 1170,
    "end": 1171,
    "speaker": "Lex Fridman",
    "timestamp": "(02:32:13)",
    "text": "They might make a statue of you though. Make you look good."
  },
  {
    "start": 1172,
    "end": 1173,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:32:16)",
    "text": "After my death. I look very good dead."
  },
  {
    "start": 1174,
    "end": 1175,
    "speaker": "Lex Fridman",
    "timestamp": "(02:32:24)",
    "text": "When you look at what happened with Navalny, since you kind of really thought about this in Egypt, what happened with Navalny in Russia? What do you think about that?"
  },
  {
    "start": 1176,
    "end": 1177,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:32:39)",
    "text": "What happened in Navalny in Russia is not something new in Russia. Putin have this whole history of poisoning and killing people. I would have to cite credit Putin. He’s bringing us the essence of the dark ages, the Middle Ages. Basically, Putin is the living example of what happens if Game of Thrones was reality. It’s like, death by poison. Like blow up a plane, it like mysteriously disappears. It is very dark, but it’s like, wow, it’s a television show."
  },
  {
    "start": 1178,
    "end": 1179,
    "speaker": "Lex Fridman",
    "timestamp": "(02:33:20)",
    "text": "Maybe that’s what attracts us to that part of the world is that it’s so much on display, this game of power, of geopolitics, of war."
  },
  {
    "start": 1180,
    "end": 1181,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:33:32)",
    "text": "The same happens in the West, but behind closed doors. It’s not that open, it’s not that pronounced. It’s like, “Oops, Epstein.” I think because the West is more advanced in movies and cinemas, we kind of direct it better. I think the outcome is the way that you kind of set the scene, it’s like scene, and scene."
  },
  {
    "start": 1182,
    "end": 1183,
    "speaker": "Lex Fridman",
    "timestamp": "(02:33:58)",
    "text": "That’s why people about landing on the moon, they’re like… I get it, but we haven’t gone back."
  },
  {
    "start": 1184,
    "end": 1185,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:34:06)",
    "text": "The Earth is flat."
  },
  {
    "start": 1186,
    "end": 1187,
    "speaker": "Lex Fridman",
    "timestamp": "(02:34:13)",
    "text": "If we zoom out, do you think there will always be war in the world?"
  },
  {
    "start": 1188,
    "end": 1189,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:34:17)",
    "text": "Yes."
  },
  {
    "start": 1190,
    "end": 1191,
    "speaker": "Lex Fridman",
    "timestamp": "(02:34:17)",
    "text": "Always be suffering? Yes?"
  },
  {
    "start": 1192,
    "end": 1193,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:34:19)",
    "text": "Yeah. But, here’s the thing, I don’t think for long. I don’t think that will happen for them."
  },
  {
    "start": 1194,
    "end": 1195,
    "speaker": "Lex Fridman",
    "timestamp": "(02:34:25)",
    "text": "Wait a minute."
  },
  {
    "start": 1196,
    "end": 1197,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:34:27)",
    "text": "Because here’s the thing. Humanity is destined to have war, it will have war, but something happened in the last 50 years. Now, we have much more lethal weapons. The problem is the beginning, it’s like swords against swords, horses, cavalry, like cannons, catapults, medium-sized. But now, like a press of a button, you can annihilate the whole planet, and this is the problem. Wars will always continue, the problem is when is going to be the tipping point where we are actually going to destroy ourselves. It is so easy now to destroy ourselves. The amount of weapons and the quality of weapons that we have, it is designed to kill more effectively. It is crazy. It’s like we can create our own destruction on ourselves, and I think we are not that far away from it."
  },
  {
    "start": 1198,
    "end": 1199,
    "speaker": "Lex Fridman",
    "timestamp": "(02:35:19)",
    "text": "Just looking at nuclear weapons. The fascinating thing about nuclear weapons is I’ve gotten to learn recently just how few people are involved in a full on nuclear war that basically kills everybody. Three plus billion people right away."
  },
  {
    "start": 1200,
    "end": 1201,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:35:39)",
    "text": "The consequences the of the nuclear winter, it’s unlivable."
  },
  {
    "start": 1202,
    "end": 1203,
    "speaker": "Lex Fridman",
    "timestamp": "(02:35:45)",
    "text": "All it takes is one president can do it. It could be even a false alarm, misunderstanding,"
  },
  {
    "start": 1204,
    "end": 1205,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:35:52)",
    "text": "Like what happened in the Cuba Missile crisis."
  },
  {
    "start": 1206,
    "end": 1207,
    "speaker": "Lex Fridman",
    "timestamp": "(02:35:56)",
    "text": "Again. And now there’s more nations are prepared and ready to launch. I don’t know."
  },
  {
    "start": 1208,
    "end": 1209,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:36:07)",
    "text": "You have a media and a 24 hours kind of thing that makes you at edge the whole time. That’s that’s crazy."
  },
  {
    "start": 1210,
    "end": 1211,
    "speaker": "Lex Fridman",
    "timestamp": "(02:36:13)",
    "text": "There’s a dark perspective on this where there’s certain members of the media that would kind of enjoy the prospect of nuclear war a little bit. Just let’s get as close to it as possible."
  },
  {
    "start": 1212,
    "end": 1213,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:36:26)",
    "text": "You have another factor that will contribute to that: religion. Remember how the radical Islamists talk about the end of time and whatever, but most of the Islamists don’t have that much power. Problem is with Christian Zionists now being on the top of the world with America, they have been pushing for that kind of conflict to kind of escalate, escalate. Listen to Sarah Palin’s “God wants us here”, like Karl Rove, “All of the new gods”, the Dispensationalist Reagan. Here’s an incredible book called Forcing the Hands of God. Beautiful book I read. It’s published 1998, but it still matters today. The whole idea about, especially the Zionist Christians who love Israel, but they hate the Jews, they’re anti-Semites but they love Israel because of its role. This is all basically formed because of the interpretation of the Bible of Schofield and how they talk about the end of time, then Armageddon, and then the late great planet Earth, and then left behind Sirius and all of that."
  },
  {
    "start": 1214,
    "end": 1215,
    "speaker": "",
    "timestamp": "(02:37:27)",
    "text": "It’s all about, we are heading to Armageddon. The problem is Islam, they’re people that believe that at the end of time. Then, we have the Christians that believe in the end of time. Then, you have Israel happy that those people are using it for the end of time. Then, the whole idea about them pushing as many weapons and troops and people in the Middle East to be there for the nuclear Holocaust. John Hagee, one of the pastors talk about that, about the brimstones and it’s not going to be a nuclear Holocaust. It’s crazy how people are so despising life that they are wanting death. Now, you all would have these revelations, but these revelations mean nothing if you don’t have an effective weapon in order to make it happen. This is the crazy thing, and I’m worried that the end is going to be by someone that wants to meet God a little bit earlier."
  },
  {
    "start": 1216,
    "end": 1217,
    "speaker": "Lex Fridman",
    "timestamp": "(02:38:20)",
    "text": "Somebody who’s really in a hurry. I have good news for you, maybe we’ll become a multi-planetary species."
  },
  {
    "start": 1218,
    "end": 1219,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:38:28)",
    "text": "Maybe Elon Musk will lead the way."
  },
  {
    "start": 1220,
    "end": 1221,
    "speaker": "Lex Fridman",
    "timestamp": "(02:38:31)",
    "text": "To get out in space."
  },
  {
    "start": 1222,
    "end": 1223,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:38:33)",
    "text": "Maybe he’s one of them. He’s a secret lizard."
  },
  {
    "start": 1224,
    "end": 1225,
    "speaker": "Lex Fridman",
    "timestamp": "(02:38:39)",
    "text": "I asked you offline to not mention the lizard people. They are-"
  },
  {
    "start": 1226,
    "end": 1227,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:38:43)",
    "text": "There’s like a whole people that believe in the lizard people, it’s crazy."
  },
  {
    "start": 1228,
    "end": 1229,
    "speaker": "Lex Fridman",
    "timestamp": "(02:38:48)",
    "text": "I actually have to be honest, I haven’t fully looked into lizard people. I probably should."
  },
  {
    "start": 1230,
    "end": 1231,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:38:51)",
    "text": "You should."
  },
  {
    "start": 1232,
    "end": 1233,
    "speaker": "Lex Fridman",
    "timestamp": "(02:38:53)",
    "text": "Maybe I’m afraid of the truth."
  },
  {
    "start": 1234,
    "end": 1235,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:39:04)",
    "text": "Removing my face."
  },
  {
    "start": 1236,
    "end": 1237,
    "speaker": "Lex Fridman",
    "timestamp": "(02:39:09)",
    "text": "Let’s say you’re wrong about the end of the world,-"
  },
  {
    "start": 1238,
    "end": 1239,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:39:12)",
    "text": "I hope so."
  },
  {
    "start": 1240,
    "end": 1241,
    "speaker": "Lex Fridman",
    "timestamp": "(02:39:12)",
    "text": "And it all turns out great and humanity flourishes. Why would that happen? What gives you hope for that trajectory for humanity?"
  },
  {
    "start": 1242,
    "end": 1243,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:39:26)",
    "text": "Younger people, the people of TikTok that you don’t like. There is a lot of bullshit there."
  },
  {
    "start": 1244,
    "end": 1245,
    "speaker": "Lex Fridman",
    "timestamp": "(02:39:36)",
    "text": "After you saying this, people just keep sending you TikTok videos. These younger people, these younger people?"
  },
  {
    "start": 1246,
    "end": 1247,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:39:43)",
    "text": "This woman showing her boobs, that woman?"
  },
  {
    "start": 1248,
    "end": 1249,
    "speaker": "Lex Fridman",
    "timestamp": "(02:39:45)",
    "text": "That’s going to save us? All right, awesome. Thank you."
  },
  {
    "start": 1250,
    "end": 1251,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:39:57)",
    "text": "Remember the joke that said, we thought that when we have internet, we’re going to have be more informed, and now we are watching twerking videos. That is true. But on the other side, the fact that you have the availability of information, I’m learning a lot. There’s people who are using that platform for that. It’s not the majority because it’s not very interesting and exciting, but I think there might be a tipping point where there’s enough people that will be aware and maybe they would collectively do something in order to bring back the power to the small man. Maybe it sounds very naive, but we don’t know. We don’t know, because you have already seen the legacy media and the legacy politicians shaking in the past few months."
  },
  {
    "start": 1252,
    "end": 1253,
    "speaker": "Lex Fridman",
    "timestamp": "(02:40:48)",
    "text": "They’re getting nervous."
  },
  {
    "start": 1254,
    "end": 1255,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:40:49)",
    "text": "They’re getting nervous because people are calling them out, and those people were hiding behind their desk, behind in their offices and not to holding out how to support that. People now are calling them out. It is not going to happen this year or next year. But I think it’s something."
  },
  {
    "start": 1256,
    "end": 1257,
    "speaker": "Lex Fridman",
    "timestamp": "(02:41:02)",
    "text": "What advice would you give to those young folks?"
  },
  {
    "start": 1258,
    "end": 1259,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:41:03)",
    "text": "I will never give advice to those people."
  },
  {
    "start": 1260,
    "end": 1261,
    "speaker": "Lex Fridman",
    "timestamp": "(02:41:07)",
    "text": "Get off TikTok."
  },
  {
    "start": 1262,
    "end": 1263,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:41:09)",
    "text": "I will never, because their input is different than mine. There’s one thing I learned when people saw me. Did the revolution fail in Egypt? The revolution is not an event. It’s not like, “Hey, we go in, we topple the government.” That’s not a revolution. A revolution is a process, it’s a very long process, and maybe that process, as much as we don’t like what happened in the Arab War, but the people there, the awareness that happened and the discussions that have been opened that you didn’t even imagine would happen in the Middle East is happening. Maybe the beginning of any hope of change is that people start talking, speaking out, talking about stuff they were not allowed to speak about. Like, for example, Israel."
  },
  {
    "start": 1264,
    "end": 1265,
    "speaker": "Lex Fridman",
    "timestamp": "(02:41:54)",
    "text": "The revolution continues. Bassem, you’re a beautiful human being. It was truly a pleasure and honor to meet you, I can just feel the love radiating from you. I hope I get to see you perform live. I hope to get to see you many more times. Thank you for being who you are."
  },
  {
    "start": 1266,
    "end": 1267,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:42:11)",
    "text": "Thank you so much. AI would love to invite you for my new special, the Islamo-Nazi Bassem."
  },
  {
    "start": 1268,
    "end": 1269,
    "speaker": "Lex Fridman",
    "timestamp": "(02:42:18)",
    "text": "That should be the title of your autobiography."
  },
  {
    "start": 1270,
    "end": 1271,
    "speaker": "Bassem Youssef",
    "timestamp": "(02:42:20)",
    "text": "Islamo-Nazi. Thank you so much."
  },
  {
    "start": 1272,
    "end": 1273,
    "speaker": "Lex Fridman",
    "timestamp": "(02:42:22)",
    "text": "Thank you, brother. Thanks for listening to this conversation with Bassem Youssef. To support this podcast, please check out our sponsors in the description. Now, let me leave you some words from John Stewart: “The press can hold this magnifying glass up to our problems, bringing them into focus, illuminating issues heretofore unseen, or they can use that magnifying glass to light ants on fire and then perhaps host a week of shows on the sudden, unexpected, dangerous, flaming ant epidemic. If we amplify everything, we hear nothing.” Thank you for listening, and hope to see you next time."
  }
]